// BoringSSL commit: 1a41b9025c2c0a37edd07ff10f6944f03e028522 (stamped by regenerate.sh; verified by scripts/build/deps/boringssl.ts)
/* automatically generated by rust-bindgen 0.72.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = unsafe {
            *(core::ptr::addr_of!((*this).storage) as *const u8).offset(byte_index as isize)
        };
        Self::extract_bit(byte, index)
    }
    #[inline]

pub const SSL_R_TLSV1_ALERT_INTERNAL_ERROR: i32 = 1080;
pub const SSL_R_TLSV1_ALERT_INAPPROPRIATE_FALLBACK: i32 = 1086;
pub const SSL_R_TLSV1_ALERT_USER_CANCELLED: i32 = 1090;
pub const SSL_R_TLSV1_ALERT_NO_RENEGOTIATION: i32 = 1100;
pub const SSL_R_TLSV1_ALERT_UNSUPPORTED_EXTENSION: i32 = 1110;
pub const SSL_R_TLSV1_ALERT_CERTIFICATE_UNOBTAINABLE: i32 = 1111;
pub const SSL_R_TLSV1_ALERT_UNRECOGNIZED_NAME: i32 = 1112;
pub const SSL_R_TLSV1_ALERT_BAD_CERTIFICATE_STATUS_RESPONSE: i32 = 1113;
pub const SSL_R_TLSV1_ALERT_BAD_CERTIFICATE_HASH_VALUE: i32 = 1114;
pub const SSL_R_TLSV1_ALERT_UNKNOWN_PSK_IDENTITY: i32 = 1115;
pub const SSL_R_TLSV1_ALERT_CERTIFICATE_REQUIRED: i32 = 1116;
pub const SSL_R_TLSV1_ALERT_NO_APPLICATION_PROTOCOL: i32 = 1120;
pub const SSL_R_TLSV1_ALERT_ECH_REQUIRED: i32 = 1121;
pub const TRUST_TOKEN_MAX_PRIVATE_KEY_SIZE: i32 = 512;
pub const TRUST_TOKEN_MAX_PUBLIC_KEY_SIZE: i32 = 512;
pub const TRUST_TOKEN_R_KEYGEN_FAILURE: i32 = 100;
pub const TRUST_TOKEN_R_BUFFER_TOO_SMALL: i32 = 101;
pub const TRUST_TOKEN_R_OVER_BATCHSIZE: i32 = 102;
pub const TRUST_TOKEN_R_DECODE_ERROR: i32 = 103;
pub const TRUST_TOKEN_R_SRR_SIGNATURE_ERROR: i32 = 104;
pub const TRUST_TOKEN_R_DECODE_FAILURE: i32 = 105;
pub const TRUST_TOKEN_R_INVALID_METADATA: i32 = 106;
pub const TRUST_TOKEN_R_TOO_MANY_KEYS: i32 = 107;
pub const TRUST_TOKEN_R_NO_KEYS_CONFIGURED: i32 = 108;
pub const TRUST_TOKEN_R_INVALID_KEY_ID: i32 = 109;
pub const TRUST_TOKEN_R_INVALID_TOKEN: i32 = 110;
pub const TRUST_TOKEN_R_BAD_VALIDITY_CHECK: i32 = 111;
pub const TRUST_TOKEN_R_NO_SRR_KEY_CONFIGURED: i32 = 112;
pub const TRUST_TOKEN_R_INVALID_METADATA_KEY: i32 = 113;
pub const TRUST_TOKEN_R_INVALID_PROOF: i32 = 114;
pub const CRL_REASON_NONE: i32 = -1;
pub const CRL_REASON_UNSPECIFIED: i32 = 0;
pub const CRL_REASON_KEY_COMPROMISE: i32 = 1;
pub const CRL_REASON_CA_COMPROMISE: i32 = 2;
pub const CRL_REASON_AFFILIATION_CHANGED: i32 = 3;
pub const CRL_REASON_SUPERSEDED: i32 = 4;
pub const CRL_REASON_CESSATION_OF_OPERATION: i32 = 5;
pub const CRL_REASON_CERTIFICATE_HOLD: i32 = 6;
pub const CRL_REASON_REMOVE_FROM_CRL: i32 = 8;
pub const CRL_REASON_PRIVILEGE_WITHDRAWN: i32 = 9;
pub const CRL_REASON_AA_COMPROMISE: i32 = 10;
pub const KU_DIGITAL_SIGNATURE: i32 = 128;
pub const KU_NON_REPUDIATION: i32 = 64;
pub const KU_KEY_ENCIPHERMENT: i32 = 32;
pub const KU_DATA_ENCIPHERMENT: i32 = 16;
pub const KU_KEY_AGREEMENT: i32 = 8;
pub const KU_KEY_CERT_SIGN: i32 = 4;
pub const KU_CRL_SIGN: i32 = 2;
pub const KU_ENCIPHER_ONLY: i32 = 1;
pub const KU_DECIPHER_ONLY: i32 = 32768;
pub type __int32_t = ::core::ffi::c_int;
pub type __int64_t = ::core::ffi::c_longlong;
pub type __darwin_va_list = __builtin_va_list;
pub type __darwin_time_t = ::core::ffi::c_long;
pub type __darwin_off_t = __int64_t;
pub type __darwin_suseconds_t = __int32_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __darwin_time_t,
    pub tv_usec: __darwin_suseconds_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timeval"][::core::mem::size_of::<timeval>() - 16usize];
    ["Alignment of timeval"][::core::mem::align_of::<timeval>() - 8usize];
    ["Offset of field: timeval::tv_sec"][::core::mem::offset_of!(timeval, tv_sec) - 0usize];
    ["Offset of field: timeval::tv_usec"][::core::mem::offset_of!(timeval, tv_usec) - 8usize];
};
pub type time_t = __darwin_time_t;
pub type ossl_ssize_t = isize;
pub type CBS_ASN1_TAG = u32;
pub type CRYPTO_THREADID = ::core::ffi::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn1_null_st {
    _unused: [u8; 0],
}
pub type ASN1_NULL = asn1_null_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct crypto_must_be_null_st {
    _unused: [u8; 0],
}
pub type CRYPTO_MUST_BE_NULL = crypto_must_be_null_st;
pub type ASN1_BOOLEAN = ::core::ffi::c_int;
pub type ASN1_ITEM = ASN1_ITEM_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn1_object_st {
    _unused: [u8; 0],
}
pub type ASN1_OBJECT = asn1_object_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn1_pctx_st {
    _unused: [u8; 0],
}
pub type ASN1_PCTX = asn1_pctx_st;
pub type ASN1_BIT_STRING = asn1_string_st;
pub type ASN1_BMPSTRING = asn1_string_st;
pub type ASN1_ENUMERATED = asn1_string_st;
pub type ASN1_GENERALIZEDTIME = asn1_string_st;
pub type ASN1_GENERALSTRING = asn1_string_st;
pub type ASN1_IA5STRING = asn1_string_st;
pub type ASN1_INTEGER = asn1_string_st;
pub type ASN1_OCTET_STRING = asn1_string_st;
pub type ASN1_PRINTABLESTRING = asn1_string_st;
pub type ASN1_STRING = asn1_string_st;
pub type ASN1_T61STRING = asn1_string_st;
pub type ASN1_TIME = asn1_string_st;
pub type ASN1_UNIVERSALSTRING = asn1_string_st;
pub type ASN1_UTCTIME = asn1_string_st;
pub type ASN1_UTF8STRING = asn1_string_st;
pub type ASN1_VISIBLESTRING = asn1_string_st;
pub type ASN1_TYPE = asn1_type_st;
pub type AUTHORITY_KEYID = AUTHORITY_KEYID_st;
pub type BASIC_CONSTRAINTS = BASIC_CONSTRAINTS_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CMS_ContentInfo_st {
    _unused: [u8; 0],
}
pub type CMS_ContentInfo = CMS_ContentInfo_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CMS_SignerInfo_st {
    _unused: [u8; 0],
}
pub type CMS_SignerInfo = CMS_SignerInfo_st;
pub type DIST_POINT = DIST_POINT_st;
pub type DSA_SIG = DSA_SIG_st;
pub type GENERAL_NAME = GENERAL_NAME_st;
pub type ISSUING_DIST_POINT = ISSUING_DIST_POINT_st;
pub type NAME_CONSTRAINTS = NAME_CONSTRAINTS_st;
pub type NETSCAPE_SPKAC = Netscape_spkac_st;
pub type NETSCAPE_SPKI = Netscape_spki_st;
pub type RIPEMD160_CTX = RIPEMD160state_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct X509_VERIFY_PARAM_st {
    _unused: [u8; 0],
}
pub type X509_VERIFY_PARAM = X509_VERIFY_PARAM_st;
pub type X509_ALGOR = X509_algor_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct X509_crl_st {
    _unused: [u8; 0],
}
pub type X509_CRL = X509_crl_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct X509_extension_st {
    _unused: [u8; 0],
}
pub type X509_EXTENSION = X509_extension_st;
pub type X509_INFO = X509_info_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct X509_name_entry_st {
    _unused: [u8; 0],
}
pub type X509_NAME_ENTRY = X509_name_entry_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct X509_name_st {
    _unused: [u8; 0],
}
pub type X509_NAME = X509_name_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct X509_pubkey_st {
    _unused: [u8; 0],
}
pub type X509_PUBKEY = X509_pubkey_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct X509_req_st {
    _unused: [u8; 0],
}
pub type X509_REQ = X509_req_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct X509_sig_st {
    _unused: [u8; 0],
}
pub type X509_SIG = X509_sig_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bignum_ctx {
    _unused: [u8; 0],
}
pub type BN_CTX = bignum_ctx;
pub type BIGNUM = bignum_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bio_method_st {
    _unused: [u8; 0],
}
pub type BIO_METHOD = bio_method_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bio_st {
    _unused: [u8; 0],
}
pub type BIO = bio_st;
pub type BLAKE2B_CTX = blake2b_state_st;
pub type BN_GENCB = bn_gencb_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bn_mont_ctx_st {
    _unused: [u8; 0],
}
pub type BN_MONT_CTX = bn_mont_ctx_st;
pub type BUF_MEM = buf_mem_st;
pub type CBB = cbb_st;
pub type CBS = cbs_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cmac_ctx_st {
    _unused: [u8; 0],
}
pub type CMAC_CTX = cmac_ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct conf_st {
    _unused: [u8; 0],
}
pub type CONF = conf_st;
pub type CONF_VALUE = conf_value_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct crypto_buffer_pool_st {
    _unused: [u8; 0],
}
pub type CRYPTO_BUFFER_POOL = crypto_buffer_pool_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct crypto_buffer_st {
    _unused: [u8; 0],
}
pub type CRYPTO_BUFFER = crypto_buffer_st;
pub type CRYPTO_IVEC = crypto_ivec_st;
pub type CRYPTO_IOVEC = crypto_iovec_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ctr_drbg_state_st {
    _unused: [u8; 0],
}
pub type CTR_DRBG_STATE = ctr_drbg_state_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dh_st {
    _unused: [u8; 0],
}
pub type DH = dh_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dsa_st {
    _unused: [u8; 0],
}
pub type DSA = dsa_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ec_group_st {
    _unused: [u8; 0],
}
pub type EC_GROUP = ec_group_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ec_key_st {
    _unused: [u8; 0],
}
pub type EC_KEY = ec_key_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ec_point_st {
    _unused: [u8; 0],
}
pub type EC_POINT = ec_point_st;
pub type ECDSA_METHOD = ecdsa_method_st;
pub type ECDSA_SIG = ecdsa_sig_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct engine_st {
    _unused: [u8; 0],
}
pub type ENGINE = engine_st;
pub type EVP_MD_CTX = env_md_ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct env_md_st {
    _unused: [u8; 0],
}
pub type EVP_MD = env_md_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_aead_st {
    _unused: [u8; 0],
}
pub type EVP_AEAD = evp_aead_st;
pub type EVP_AEAD_CTX = evp_aead_ctx_st;
pub type EVP_CIPHER_CTX = evp_cipher_ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_cipher_st {
    _unused: [u8; 0],
}
pub type EVP_CIPHER = evp_cipher_st;
pub type EVP_ENCODE_CTX = evp_encode_ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_hpke_aead_st {
    _unused: [u8; 0],
}
pub type EVP_HPKE_AEAD = evp_hpke_aead_st;
pub type EVP_HPKE_CTX = evp_hpke_ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_hpke_kdf_st {
    _unused: [u8; 0],
}
pub type EVP_HPKE_KDF = evp_hpke_kdf_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_hpke_kem_st {
    _unused: [u8; 0],
}
pub type EVP_HPKE_KEM = evp_hpke_kem_st;
pub type EVP_HPKE_KEY = evp_hpke_key_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_kem_st {
    _unused: [u8; 0],
}
pub type EVP_KEM = evp_kem_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_pkey_alg_st {
    _unused: [u8; 0],
}
pub type EVP_PKEY_ALG = evp_pkey_alg_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_pkey_ctx_st {
    _unused: [u8; 0],
}
pub type EVP_PKEY_CTX = evp_pkey_ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_pkey_st {
    _unused: [u8; 0],
}
pub type EVP_PKEY = evp_pkey_st;
pub type HMAC_CTX = hmac_ctx_st;
pub type MD4_CTX = md4_state_st;
pub type MD5_CTX = md5_state_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ossl_init_settings_st {
    _unused: [u8; 0],
}
pub type OPENSSL_INIT_SETTINGS = ossl_init_settings_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ossl_lib_ctx_st {
    _unused: [u8; 0],
}
pub type OSSL_LIB_CTX = ossl_lib_ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ossl_param_st {
    _unused: [u8; 0],
}
pub type OSSL_PARAM = ossl_param_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pkcs12_st {
    _unused: [u8; 0],
}
pub type PKCS12 = pkcs12_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pkcs8_priv_key_info_st {
    _unused: [u8; 0],
}
pub type PKCS8_PRIV_KEY_INFO = pkcs8_priv_key_info_st;
pub type X509_PKEY = private_key_st;
pub type RAND_METHOD = rand_meth_st;
pub type RC4_KEY = rc4_key_st;
pub type RSA_METHOD = rsa_meth_st;
pub type RSA_PSS_PARAMS = rsa_pss_params_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rsa_st {
    _unused: [u8; 0],
}
pub type RSA = rsa_st;
pub type SHA256_CTX = sha256_state_st;
pub type SHA512_CTX = sha512_state_st;
pub type SHA_CTX = sha_state_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spake2_ctx_st {
    _unused: [u8; 0],
}
pub type SPAKE2_CTX = spake2_ctx_st;
pub type SRTP_PROTECTION_PROFILE = srtp_protection_profile_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ssl_cipher_st {
    _unused: [u8; 0],
}
pub type SSL_CIPHER = ssl_cipher_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ssl_credential_st {
    _unused: [u8; 0],
}
pub type SSL_CREDENTIAL = ssl_credential_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ssl_ctx_st {
    _unused: [u8; 0],
}
pub type SSL_CTX = ssl_ctx_st;
pub type SSL_CLIENT_HELLO = ssl_early_callback_ctx;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ssl_ech_keys_st {
    _unused: [u8; 0],
}
pub type SSL_ECH_KEYS = ssl_ech_keys_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ssl_method_st {
    _unused: [u8; 0],
}
pub type SSL_METHOD = ssl_method_st;
pub type SSL_PRIVATE_KEY_METHOD = ssl_private_key_method_st;
pub type SSL_QUIC_METHOD = ssl_quic_method_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ssl_session_st {
    _unused: [u8; 0],
}
pub type SSL_SESSION = ssl_session_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ssl_st {
    _unused: [u8; 0],
}
pub type SSL = ssl_st;
pub type SSL_TICKET_AEAD_METHOD = ssl_ticket_aead_method_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct st_ERR_FNS {
    _unused: [u8; 0],
}
pub type ERR_FNS = st_ERR_FNS;
pub type TRUST_TOKEN = trust_token_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct trust_token_client_st {
    _unused: [u8; 0],
}
pub type TRUST_TOKEN_CLIENT = trust_token_client_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct trust_token_issuer_st {
    _unused: [u8; 0],
}
pub type TRUST_TOKEN_ISSUER = trust_token_issuer_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct trust_token_method_st {
    _unused: [u8; 0],
}
pub type TRUST_TOKEN_METHOD = trust_token_method_st;
pub type X509V3_CTX = v3_ext_ctx;
pub type X509V3_EXT_METHOD = v3_ext_method;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x509_attributes_st {
    _unused: [u8; 0],
}
pub type X509_ATTRIBUTE = x509_attributes_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x509_lookup_st {
    _unused: [u8; 0],
}
pub type X509_LOOKUP = x509_lookup_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x509_lookup_method_st {
    _unused: [u8; 0],
}
pub type X509_LOOKUP_METHOD = x509_lookup_method_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x509_object_st {
    _unused: [u8; 0],
}
pub type X509_OBJECT = x509_object_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x509_purpose_st {
    _unused: [u8; 0],
}
pub type X509_PURPOSE = x509_purpose_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x509_revoked_st {
    _unused: [u8; 0],
}
pub type X509_REVOKED = x509_revoked_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x509_st {
    _unused: [u8; 0],
}
pub type X509 = x509_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x509_store_ctx_st {
    _unused: [u8; 0],
}
pub type X509_STORE_CTX = x509_store_ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x509_store_st {
    _unused: [u8; 0],
}
pub type X509_STORE = x509_store_st;
pub type OPENSSL_BLOCK = *mut ::core::ffi::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct aes_key_st {
    pub rd_key: [u32; 60usize],
    pub rounds: ::core::ffi::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of aes_key_st"][::core::mem::size_of::<aes_key_st>() - 244usize];
    ["Alignment of aes_key_st"][::core::mem::align_of::<aes_key_st>() - 4usize];
    ["Offset of field: aes_key_st::rd_key"][::core::mem::offset_of!(aes_key_st, rd_key) - 0usize];
    ["Offset of field: aes_key_st::rounds"][::core::mem::offset_of!(aes_key_st, rounds) - 240usize];
};
pub type AES_KEY = aes_key_st;
unsafe extern "C" {
    pub fn AES_set_encrypt_key(
        key: *const u8,
        bits: ::core::ffi::c_uint,
        aeskey: *mut AES_KEY,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn AES_set_decrypt_key(
        key: *const u8,
        bits: ::core::ffi::c_uint,
        aeskey: *mut AES_KEY,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn AES_encrypt(in_: *const u8, out: *mut u8, key: *const AES_KEY);
}
unsafe extern "C" {
    pub fn AES_decrypt(in_: *const u8, out: *mut u8, key: *const AES_KEY);
}
unsafe extern "C" {
    pub fn AES_ctr128_encrypt(
        in_: *const u8,
        out: *mut u8,
        len: usize,
        key: *const AES_KEY,
        ivec: *mut u8,
        ecount_buf: *mut u8,
        num: *mut ::core::ffi::c_uint,
    );
}
unsafe extern "C" {
    pub fn AES_ecb_encrypt(
        in_: *const u8,
        out: *mut u8,
        key: *const AES_KEY,
        enc: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn AES_cbc_encrypt(
        in_: *const u8,
        out: *mut u8,
        len: usize,
        key: *const AES_KEY,
        ivec: *mut u8,
        enc: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn AES_ofb128_encrypt(
        in_: *const u8,
        out: *mut u8,
        len: usize,
        key: *const AES_KEY,
        ivec: *mut u8,
        num: *mut ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn AES_cfb128_encrypt(
        in_: *const u8,
        out: *mut u8,
        len: usize,
        key: *const AES_KEY,
        ivec: *mut u8,
        num: *mut ::core::ffi::c_int,
        enc: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn AES_wrap_key(
        key: *const AES_KEY,
        iv: *const u8,
        out: *mut u8,
        in_: *const u8,
        in_len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn AES_unwrap_key(
        key: *const AES_KEY,
        iv: *const u8,
        out: *mut u8,
        in_: *const u8,
        in_len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn AES_wrap_key_padded(
        key: *const AES_KEY,
        out: *mut u8,
        out_len: *mut usize,
        max_out: usize,
        in_: *const u8,
        in_len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn AES_unwrap_key_padded(
        key: *const AES_KEY,
        out: *mut u8,
        out_len: *mut usize,
        max_out: usize,
        in_: *const u8,
        in_len: usize,
    ) -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    pub tm_sec: ::core::ffi::c_int,
    pub tm_min: ::core::ffi::c_int,
    pub tm_hour: ::core::ffi::c_int,
    pub tm_mday: ::core::ffi::c_int,
    pub tm_mon: ::core::ffi::c_int,
    pub tm_year: ::core::ffi::c_int,
    pub tm_wday: ::core::ffi::c_int,
    pub tm_yday: ::core::ffi::c_int,
    pub tm_isdst: ::core::ffi::c_int,
    pub tm_gmtoff: ::core::ffi::c_long,
    pub tm_zone: *mut ::core::ffi::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tm"][::core::mem::size_of::<tm>() - 56usize];
    ["Alignment of tm"][::core::mem::align_of::<tm>() - 8usize];
    ["Offset of field: tm::tm_sec"][::core::mem::offset_of!(tm, tm_sec) - 0usize];
    ["Offset of field: tm::tm_min"][::core::mem::offset_of!(tm, tm_min) - 4usize];
    ["Offset of field: tm::tm_hour"][::core::mem::offset_of!(tm, tm_hour) - 8usize];
    ["Offset of field: tm::tm_mday"][::core::mem::offset_of!(tm, tm_mday) - 12usize];
    ["Offset of field: tm::tm_mon"][::core::mem::offset_of!(tm, tm_mon) - 16usize];
    ["Offset of field: tm::tm_year"][::core::mem::offset_of!(tm, tm_year) - 20usize];
    ["Offset of field: tm::tm_wday"][::core::mem::offset_of!(tm, tm_wday) - 24usize];
    ["Offset of field: tm::tm_yday"][::core::mem::offset_of!(tm, tm_yday) - 28usize];
    ["Offset of field: tm::tm_isdst"][::core::mem::offset_of!(tm, tm_isdst) - 32usize];
    ["Offset of field: tm::tm_gmtoff"][::core::mem::offset_of!(tm, tm_gmtoff) - 40usize];
    ["Offset of field: tm::tm_zone"][::core::mem::offset_of!(tm, tm_zone) - 48usize];
};
pub type va_list = __darwin_va_list;
pub type fpos_t = __darwin_off_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sbuf {
    pub _base: *mut ::core::ffi::c_uchar,
    pub _size: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sbuf"][::core::mem::size_of::<__sbuf>() - 16usize];
    ["Alignment of __sbuf"][::core::mem::align_of::<__sbuf>() - 8usize];
    ["Offset of field: __sbuf::_base"][::core::mem::offset_of!(__sbuf, _base) - 0usize];
    ["Offset of field: __sbuf::_size"][::core::mem::offset_of!(__sbuf, _size) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILEX {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILE {
    pub _p: *mut ::core::ffi::c_uchar,
    pub _r: ::core::ffi::c_int,
    pub _w: ::core::ffi::c_int,
    pub _flags: ::core::ffi::c_short,
    pub _file: ::core::ffi::c_short,
    pub _bf: __sbuf,
    pub _lbfsize: ::core::ffi::c_int,
    pub _cookie: *mut ::core::ffi::c_void,
    pub _close: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void) -> ::core::ffi::c_int,
    >,
    pub _read: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::core::ffi::c_void,
            arg2: *mut ::core::ffi::c_char,
            __n: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub _seek: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::core::ffi::c_void,
            arg2: fpos_t,
            arg3: ::core::ffi::c_int,
        ) -> fpos_t,
    >,
    pub _write: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::core::ffi::c_void,
            arg2: *const ::core::ffi::c_char,
            __n: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub _ub: __sbuf,
    pub _extra: *mut __sFILEX,
    pub _ur: ::core::ffi::c_int,
    pub _ubuf: [::core::ffi::c_uchar; 3usize],
    pub _nbuf: [::core::ffi::c_uchar; 1usize],
    pub _lb: __sbuf,
    pub _blksize: ::core::ffi::c_int,
    pub _offset: fpos_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sFILE"][::core::mem::size_of::<__sFILE>() - 152usize];
    ["Alignment of __sFILE"][::core::mem::align_of::<__sFILE>() - 8usize];
    ["Offset of field: __sFILE::_p"][::core::mem::offset_of!(__sFILE, _p) - 0usize];
    ["Offset of field: __sFILE::_r"][::core::mem::offset_of!(__sFILE, _r) - 8usize];
    ["Offset of field: __sFILE::_w"][::core::mem::offset_of!(__sFILE, _w) - 12usize];
    ["Offset of field: __sFILE::_flags"][::core::mem::offset_of!(__sFILE, _flags) - 16usize];
    ["Offset of field: __sFILE::_file"][::core::mem::offset_of!(__sFILE, _file) - 18usize];
    ["Offset of field: __sFILE::_bf"][::core::mem::offset_of!(__sFILE, _bf) - 24usize];
    ["Offset of field: __sFILE::_lbfsize"][::core::mem::offset_of!(__sFILE, _lbfsize) - 40usize];
    ["Offset of field: __sFILE::_cookie"][::core::mem::offset_of!(__sFILE, _cookie) - 48usize];
    ["Offset of field: __sFILE::_close"][::core::mem::offset_of!(__sFILE, _close) - 56usize];
    ["Offset of field: __sFILE::_read"][::core::mem::offset_of!(__sFILE, _read) - 64usize];
    ["Offset of field: __sFILE::_seek"][::core::mem::offset_of!(__sFILE, _seek) - 72usize];
    ["Offset of field: __sFILE::_write"][::core::mem::offset_of!(__sFILE, _write) - 80usize];
    ["Offset of field: __sFILE::_ub"][::core::mem::offset_of!(__sFILE, _ub) - 88usize];
    ["Offset of field: __sFILE::_extra"][::core::mem::offset_of!(__sFILE, _extra) - 104usize];
    ["Offset of field: __sFILE::_ur"][::core::mem::offset_of!(__sFILE, _ur) - 112usize];
    ["Offset of field: __sFILE::_ubuf"][::core::mem::offset_of!(__sFILE, _ubuf) - 116usize];
    ["Offset of field: __sFILE::_nbuf"][::core::mem::offset_of!(__sFILE, _nbuf) - 119usize];
    ["Offset of field: __sFILE::_lb"][::core::mem::offset_of!(__sFILE, _lb) - 120usize];
    ["Offset of field: __sFILE::_blksize"][::core::mem::offset_of!(__sFILE, _blksize) - 136usize];
    ["Offset of field: __sFILE::_offset"][::core::mem::offset_of!(__sFILE, _offset) - 144usize];
};
pub type FILE = __sFILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct buf_mem_st {
    pub length: usize,
    pub data: *mut ::core::ffi::c_char,
    pub max: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of buf_mem_st"][::core::mem::size_of::<buf_mem_st>() - 24usize];
    ["Alignment of buf_mem_st"][::core::mem::align_of::<buf_mem_st>() - 8usize];
    ["Offset of field: buf_mem_st::length"][::core::mem::offset_of!(buf_mem_st, length) - 0usize];
    ["Offset of field: buf_mem_st::data"][::core::mem::offset_of!(buf_mem_st, data) - 8usize];
    ["Offset of field: buf_mem_st::max"][::core::mem::offset_of!(buf_mem_st, max) - 16usize];
};
unsafe extern "C" {
    pub fn BUF_MEM_new() -> *mut BUF_MEM;
}
unsafe extern "C" {
    pub fn BUF_MEM_free(buf: *mut BUF_MEM);
}
unsafe extern "C" {
    pub fn BUF_MEM_reserve(buf: *mut BUF_MEM, cap: usize) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BUF_MEM_grow(buf: *mut BUF_MEM, len: usize) -> usize;
}
unsafe extern "C" {
    pub fn BUF_MEM_grow_clean(buf: *mut BUF_MEM, len: usize) -> usize;
}
unsafe extern "C" {
    pub fn BUF_MEM_append(
        buf: *mut BUF_MEM,
        in_: *const ::core::ffi::c_void,
        len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BUF_strdup(str_: *const ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn BUF_strnlen(str_: *const ::core::ffi::c_char, max_len: usize) -> usize;
}
unsafe extern "C" {
    pub fn BUF_strndup(str_: *const ::core::ffi::c_char, size: usize) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn BUF_memdup(data: *const ::core::ffi::c_void, size: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn BUF_strlcpy(
        dst: *mut ::core::ffi::c_char,
        src: *const ::core::ffi::c_char,
        dst_size: usize,
    ) -> usize;
}
unsafe extern "C" {
    pub fn BUF_strlcat(
        dst: *mut ::core::ffi::c_char,
        src: *const ::core::ffi::c_char,
        dst_size: usize,
    ) -> usize;
}
unsafe extern "C" {
    #[link_name = "ERR_GET_LIB__extern"]
    pub fn ERR_GET_LIB(packed_error: u32) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "ERR_GET_REASON__extern"]
    pub fn ERR_GET_REASON(packed_error: u32) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "ERR_equals__extern"]
    pub fn ERR_equals(
        packed_error: u32,
        lib: ::core::ffi::c_int,
        reason: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ERR_get_error() -> u32;
}
unsafe extern "C" {
    pub fn ERR_get_error_line(
        file: *mut *const ::core::ffi::c_char,
        line: *mut ::core::ffi::c_int,
    ) -> u32;
}
unsafe extern "C" {
    pub fn ERR_get_error_line_data(
        file: *mut *const ::core::ffi::c_char,
        line: *mut ::core::ffi::c_int,
        data: *mut *const ::core::ffi::c_char,
        flags: *mut ::core::ffi::c_int,
    ) -> u32;
}
unsafe extern "C" {
    pub fn ERR_peek_error() -> u32;
}
unsafe extern "C" {
    pub fn ERR_peek_error_line(
        file: *mut *const ::core::ffi::c_char,
        line: *mut ::core::ffi::c_int,
    ) -> u32;
}
unsafe extern "C" {
    pub fn ERR_peek_error_line_data(
        file: *mut *const ::core::ffi::c_char,
        line: *mut ::core::ffi::c_int,
        data: *mut *const ::core::ffi::c_char,
        flags: *mut ::core::ffi::c_int,
    ) -> u32;
}
unsafe extern "C" {
    pub fn ERR_peek_last_error() -> u32;
}
unsafe extern "C" {
    pub fn ERR_peek_last_error_line(
        file: *mut *const ::core::ffi::c_char,
        line: *mut ::core::ffi::c_int,
    ) -> u32;
}
unsafe extern "C" {
    pub fn ERR_peek_last_error_line_data(
        file: *mut *const ::core::ffi::c_char,
        line: *mut ::core::ffi::c_int,
        data: *mut *const ::core::ffi::c_char,
        flags: *mut ::core::ffi::c_int,
    ) -> u32;
}
unsafe extern "C" {
    pub fn ERR_error_string_n(
        packed_error: u32,
        buf: *mut ::core::ffi::c_char,
        len: usize,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn ERR_lib_error_string(packed_error: u32) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn ERR_reason_error_string(packed_error: u32) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn ERR_lib_symbol_name(packed_error: u32) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn ERR_reason_symbol_name(packed_error: u32) -> *const ::core::ffi::c_char;
}
pub type ERR_print_errors_callback_t = ::core::option::Option<
    unsafe extern "C" fn(
        str_: *const ::core::ffi::c_char,
        len: usize,
        ctx: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int,
>;
unsafe extern "C" {
    pub fn ERR_print_errors_cb(
        callback: ERR_print_errors_callback_t,
        ctx: *mut ::core::ffi::c_void,
    );
}
unsafe extern "C" {
    pub fn ERR_print_errors_fp(file: *mut FILE);
}
unsafe extern "C" {
    pub fn ERR_clear_error();
}
unsafe extern "C" {
    pub fn ERR_set_mark() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ERR_pop_to_mark() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ERR_get_next_error_library() -> ::core::ffi::c_int;
}
pub const ERR_LIB_NONE: _bindgen_ty_1 = 1;
pub const ERR_LIB_SYS: _bindgen_ty_1 = 2;
pub const ERR_LIB_BN: _bindgen_ty_1 = 3;
pub const ERR_LIB_RSA: _bindgen_ty_1 = 4;
pub const ERR_LIB_DH: _bindgen_ty_1 = 5;
pub const ERR_LIB_EVP: _bindgen_ty_1 = 6;
pub const ERR_LIB_BUF: _bindgen_ty_1 = 7;
pub const ERR_LIB_OBJ: _bindgen_ty_1 = 8;
pub const ERR_LIB_PEM: _bindgen_ty_1 = 9;
pub const ERR_LIB_DSA: _bindgen_ty_1 = 10;
pub const ERR_LIB_X509: _bindgen_ty_1 = 11;
pub const ERR_LIB_ASN1: _bindgen_ty_1 = 12;
pub const ERR_LIB_CONF: _bindgen_ty_1 = 13;
pub const ERR_LIB_CRYPTO: _bindgen_ty_1 = 14;
pub const ERR_LIB_EC: _bindgen_ty_1 = 15;
pub const ERR_LIB_SSL: _bindgen_ty_1 = 16;
pub const ERR_LIB_BIO: _bindgen_ty_1 = 17;
pub const ERR_LIB_PKCS7: _bindgen_ty_1 = 18;
pub const ERR_LIB_PKCS8: _bindgen_ty_1 = 19;
pub const ERR_LIB_X509V3: _bindgen_ty_1 = 20;
pub const ERR_LIB_RAND: _bindgen_ty_1 = 21;
pub const ERR_LIB_ENGINE: _bindgen_ty_1 = 22;
pub const ERR_LIB_OCSP: _bindgen_ty_1 = 23;
pub const ERR_LIB_UI: _bindgen_ty_1 = 24;
pub const ERR_LIB_COMP: _bindgen_ty_1 = 25;
pub const ERR_LIB_ECDSA: _bindgen_ty_1 = 26;
pub const ERR_LIB_ECDH: _bindgen_ty_1 = 27;
pub const ERR_LIB_HMAC: _bindgen_ty_1 = 28;
pub const ERR_LIB_DIGEST: _bindgen_ty_1 = 29;
pub const ERR_LIB_CIPHER: _bindgen_ty_1 = 30;
pub const ERR_LIB_HKDF: _bindgen_ty_1 = 31;
pub const ERR_LIB_TRUST_TOKEN: _bindgen_ty_1 = 32;
pub const ERR_LIB_CMS: _bindgen_ty_1 = 33;
pub const ERR_LIB_USER: _bindgen_ty_1 = 34;
pub const ERR_NUM_LIBS: _bindgen_ty_1 = 35;
pub type _bindgen_ty_1 = ::core::ffi::c_uint;
unsafe extern "C" {
    pub fn ERR_load_BIO_strings();
}
unsafe extern "C" {
    pub fn ERR_load_ERR_strings();
}
unsafe extern "C" {
    pub fn ERR_load_crypto_strings();
}
unsafe extern "C" {
    pub fn ERR_load_RAND_strings();
}
unsafe extern "C" {
    pub fn ERR_free_strings();
}
unsafe extern "C" {
    pub fn ERR_remove_state(pid: ::core::ffi::c_ulong);
}
unsafe extern "C" {
    pub fn ERR_remove_thread_state(tid: *const CRYPTO_THREADID);
}
unsafe extern "C" {
    pub fn ERR_func_error_string(packed_error: u32) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn ERR_error_string(
        packed_error: u32,
        buf: *mut ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    #[link_name = "ERR_GET_FUNC__extern"]
    pub fn ERR_GET_FUNC(packed_error: u32) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ERR_clear_system_error();
}
unsafe extern "C" {
    pub fn ERR_put_error(
        library: ::core::ffi::c_int,
        unused: ::core::ffi::c_int,
        reason: ::core::ffi::c_int,
        file: *const ::core::ffi::c_char,
        line: ::core::ffi::c_uint,
    );
}
unsafe extern "C" {
    pub fn ERR_add_error_data(count: ::core::ffi::c_uint, ...);
}
unsafe extern "C" {
    pub fn ERR_add_error_dataf(format: *const ::core::ffi::c_char, ...);
}
unsafe extern "C" {
    pub fn ERR_set_error_data(data: *mut ::core::ffi::c_char, flags: ::core::ffi::c_int);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct crypto_ex_data_st {
    _unused: [u8; 0],
}
pub type CRYPTO_EX_DATA = crypto_ex_data_st;
pub type CRYPTO_EX_free = ::core::option::Option<
    unsafe extern "C" fn(
        parent: *mut ::core::ffi::c_void,
        ptr: *mut ::core::ffi::c_void,
        ad: *mut CRYPTO_EX_DATA,
        index: ::core::ffi::c_int,
        argl: ::core::ffi::c_long,
        argp: *mut ::core::ffi::c_void,
    ),
>;
unsafe extern "C" {
    pub fn CRYPTO_cleanup_all_ex_data();
}
pub type CRYPTO_EX_dup = ::core::option::Option<
    unsafe extern "C" fn(
        to: *mut CRYPTO_EX_DATA,
        from: *const CRYPTO_EX_DATA,
        from_d: *mut *mut ::core::ffi::c_void,
        index: ::core::ffi::c_int,
        argl: ::core::ffi::c_long,
        argp: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int,
>;
pub type CRYPTO_EX_unused = ::core::ffi::c_int;
pub type OPENSSL_sk_free_func =
    ::core::option::Option<unsafe extern "C" fn(ptr: *mut ::core::ffi::c_void)>;
pub type OPENSSL_sk_copy_func = ::core::option::Option<
    unsafe extern "C" fn(ptr: *const ::core::ffi::c_void) -> *mut ::core::ffi::c_void,
>;
pub type OPENSSL_sk_cmp_func = ::core::option::Option<
    unsafe extern "C" fn(
        a: *const *const ::core::ffi::c_void,
        b: *const *const ::core::ffi::c_void,
    ) -> ::core::ffi::c_int,
>;
pub type OPENSSL_sk_delete_if_func = ::core::option::Option<
    unsafe extern "C" fn(
        obj: *mut ::core::ffi::c_void,
        data: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int,
>;
pub type OPENSSL_sk_call_free_func = ::core::option::Option<
    unsafe extern "C" fn(arg1: OPENSSL_sk_free_func, arg2: *mut ::core::ffi::c_void),
>;
pub type OPENSSL_sk_call_copy_func = ::core::option::Option<
    unsafe extern "C" fn(
        arg1: OPENSSL_sk_copy_func,
        arg2: *const ::core::ffi::c_void,
    ) -> *mut ::core::ffi::c_void,
>;
pub type OPENSSL_sk_call_cmp_func = ::core::option::Option<
    unsafe extern "C" fn(
        arg1: OPENSSL_sk_cmp_func,
        arg2: *const ::core::ffi::c_void,
        arg3: *const ::core::ffi::c_void,
    ) -> ::core::ffi::c_int,
>;
pub type OPENSSL_sk_call_delete_if_func = ::core::option::Option<
    unsafe extern "C" fn(
        arg1: OPENSSL_sk_delete_if_func,
        arg2: *mut ::core::ffi::c_void,
        arg3: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_st {
    _unused: [u8; 0],
}
pub type OPENSSL_STACK = stack_st;
unsafe extern "C" {
    pub fn OPENSSL_sk_new(comp: OPENSSL_sk_cmp_func) -> *mut OPENSSL_STACK;
}
unsafe extern "C" {
    pub fn OPENSSL_sk_new_null() -> *mut OPENSSL_STACK;
}
unsafe extern "C" {
    pub fn OPENSSL_sk_num(sk: *const OPENSSL_STACK) -> usize;
}
unsafe extern "C" {
    pub fn OPENSSL_sk_zero(sk: *mut OPENSSL_STACK);
}
unsafe extern "C" {
    pub fn OPENSSL_sk_value(sk: *const OPENSSL_STACK, i: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn OPENSSL_sk_set(
        sk: *mut OPENSSL_STACK,
        i: usize,
        p: *mut ::core::ffi::c_void,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn OPENSSL_sk_free(sk: *mut OPENSSL_STACK);
}
unsafe extern "C" {
    pub fn OPENSSL_sk_pop_free_ex(
        sk: *mut OPENSSL_STACK,
        call_free_func: OPENSSL_sk_call_free_func,
        free_func: OPENSSL_sk_free_func,
    );
}
unsafe extern "C" {
    pub fn OPENSSL_sk_insert(
        sk: *mut OPENSSL_STACK,
        p: *mut ::core::ffi::c_void,
        where_: usize,
    ) -> usize;
}
unsafe extern "C" {
    pub fn OPENSSL_sk_delete(sk: *mut OPENSSL_STACK, where_: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn OPENSSL_sk_delete_ptr(
        sk: *mut OPENSSL_STACK,
        p: *const ::core::ffi::c_void,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn OPENSSL_sk_delete_if(
        sk: *mut OPENSSL_STACK,
        call_func: OPENSSL_sk_call_delete_if_func,
        func: OPENSSL_sk_delete_if_func,
        data: *mut ::core::ffi::c_void,
    );
}
unsafe extern "C" {
    pub fn OPENSSL_sk_find(
        sk: *const OPENSSL_STACK,
        out_index: *mut usize,
        p: *const ::core::ffi::c_void,
        call_cmp_func: OPENSSL_sk_call_cmp_func,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn OPENSSL_sk_shift(sk: *mut OPENSSL_STACK) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn OPENSSL_sk_push(sk: *mut OPENSSL_STACK, p: *mut ::core::ffi::c_void) -> usize;
}
unsafe extern "C" {
    pub fn OPENSSL_sk_pop(sk: *mut OPENSSL_STACK) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn OPENSSL_sk_dup(sk: *const OPENSSL_STACK) -> *mut OPENSSL_STACK;
}
unsafe extern "C" {
    pub fn OPENSSL_sk_sort(sk: *mut OPENSSL_STACK, call_cmp_func: OPENSSL_sk_call_cmp_func);
}
unsafe extern "C" {
    pub fn OPENSSL_sk_sort_and_dedup(
        sk: *mut OPENSSL_STACK,
        call_cmp_func: OPENSSL_sk_call_cmp_func,
        call_free_func: OPENSSL_sk_call_free_func,
        free_func: OPENSSL_sk_free_func,
    );
}
unsafe extern "C" {
    pub fn OPENSSL_sk_is_sorted(sk: *const OPENSSL_STACK) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn OPENSSL_sk_set_cmp_func(
        sk: *mut OPENSSL_STACK,
        comp: OPENSSL_sk_cmp_func,
    ) -> OPENSSL_sk_cmp_func;
}
unsafe extern "C" {
    pub fn OPENSSL_sk_deep_copy(
        sk: *const OPENSSL_STACK,
        call_copy_func: OPENSSL_sk_call_copy_func,
        copy_func: OPENSSL_sk_copy_func,
        call_free_func: OPENSSL_sk_call_free_func,
        free_func: OPENSSL_sk_free_func,
    ) -> *mut OPENSSL_STACK;
}
pub type _STACK = OPENSSL_STACK;
unsafe extern "C" {
    pub fn sk_new_null() -> *mut OPENSSL_STACK;
}
unsafe extern "C" {
    pub fn sk_num(sk: *const OPENSSL_STACK) -> usize;
}
unsafe extern "C" {
    pub fn sk_value(sk: *const OPENSSL_STACK, i: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn sk_free(sk: *mut OPENSSL_STACK);
}
unsafe extern "C" {
    pub fn sk_push(sk: *mut OPENSSL_STACK, p: *mut ::core::ffi::c_void) -> usize;
}
unsafe extern "C" {
    pub fn sk_pop(sk: *mut OPENSSL_STACK) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn sk_pop_free_ex(
        sk: *mut OPENSSL_STACK,
        call_free_func: OPENSSL_sk_call_free_func,
        free_func: OPENSSL_sk_free_func,
    );
}
unsafe extern "C" {
    pub fn sk_pop_free(sk: *mut OPENSSL_STACK, free_func: OPENSSL_sk_free_func);
}
pub type OPENSSL_STRING = *mut ::core::ffi::c_char;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_st_void {
    _unused: [u8; 0],
}
pub type sk_void_free_func =
    ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>;
pub type sk_void_copy_func = ::core::option::Option<
    unsafe extern "C" fn(arg1: *const ::core::ffi::c_void) -> *mut ::core::ffi::c_void,
>;
pub type sk_void_cmp_func = ::core::option::Option<
    unsafe extern "C" fn(
        arg1: *const *const ::core::ffi::c_void,
        arg2: *const *const ::core::ffi::c_void,
    ) -> ::core::ffi::c_int,
>;
pub type sk_void_delete_if_func = ::core::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::core::ffi::c_void,
        arg2: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int,
>;
unsafe extern "C" {
    #[link_name = "sk_void_call_free_func__extern"]
    pub fn sk_void_call_free_func(free_func: OPENSSL_sk_free_func, ptr: *mut ::core::ffi::c_void);
}
unsafe extern "C" {
    #[link_name = "sk_void_call_copy_func__extern"]
    pub fn sk_void_call_copy_func(
        copy_func: OPENSSL_sk_copy_func,
        ptr: *const ::core::ffi::c_void,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[link_name = "sk_void_call_cmp_func__extern"]
    pub fn sk_void_call_cmp_func(
        cmp_func: OPENSSL_sk_cmp_func,
        a: *const ::core::ffi::c_void,
        b: *const ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "sk_void_call_delete_if_func__extern"]
    pub fn sk_void_call_delete_if_func(
        func: OPENSSL_sk_delete_if_func,
        obj: *mut ::core::ffi::c_void,
        data: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "sk_void_new__extern"]
    pub fn sk_void_new(comp: sk_void_cmp_func) -> *mut stack_st_void;
}
unsafe extern "C" {
    #[link_name = "sk_void_new_null__extern"]
    pub fn sk_void_new_null() -> *mut stack_st_void;
}
unsafe extern "C" {
    #[link_name = "sk_void_num__extern"]
    pub fn sk_void_num(sk: *const stack_st_void) -> usize;
}
unsafe extern "C" {
    #[link_name = "sk_void_zero__extern"]
    pub fn sk_void_zero(sk: *mut stack_st_void);
}
unsafe extern "C" {
    #[link_name = "sk_void_value__extern"]
    pub fn sk_void_value(sk: *const stack_st_void, i: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[link_name = "sk_void_set__extern"]
    pub fn sk_void_set(
        sk: *mut stack_st_void,
        i: usize,
        p: *mut ::core::ffi::c_void,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[link_name = "sk_void_free__extern"]
    pub fn sk_void_free(sk: *mut stack_st_void);
}
unsafe extern "C" {
    #[link_name = "sk_void_pop_free__extern"]
    pub fn sk_void_pop_free(sk: *mut stack_st_void, free_func: sk_void_free_func);
}
unsafe extern "C" {
    #[link_name = "sk_void_insert__extern"]
    pub fn sk_void_insert(
        sk: *mut stack_st_void,
        p: *mut ::core::ffi::c_void,
        where_: usize,
    ) -> usize;
}
unsafe extern "C" {
    #[link_name = "sk_void_delete__extern"]
    pub fn sk_void_delete(sk: *mut stack_st_void, where_: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[link_name = "sk_void_delete_ptr__extern"]
    pub fn sk_void_delete_ptr(
        sk: *mut stack_st_void,
        p: *const ::core::ffi::c_void,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[link_name = "sk_void_delete_if__extern"]
    pub fn sk_void_delete_if(
        sk: *mut stack_st_void,
        func: sk_void_delete_if_func,
        data: *mut ::core::ffi::c_void,
    );
}
unsafe extern "C" {
    #[link_name = "sk_void_find__extern"]
    pub fn sk_void_find(
        sk: *const stack_st_void,
        out_index: *mut usize,
        p: *const ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "sk_void_shift__extern"]
    pub fn sk_void_shift(sk: *mut stack_st_void) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[link_name = "sk_void_push__extern"]
    pub fn sk_void_push(sk: *mut stack_st_void, p: *mut ::core::ffi::c_void) -> usize;
}
unsafe extern "C" {
    #[link_name = "sk_void_pop__extern"]
    pub fn sk_void_pop(sk: *mut stack_st_void) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[link_name = "sk_void_dup__extern"]
    pub fn sk_void_dup(sk: *const stack_st_void) -> *mut stack_st_void;
}
unsafe extern "C" {
    #[link_name = "sk_void_sort__extern"]
    pub fn sk_void_sort(sk: *mut stack_st_void);
}
unsafe extern "C" {
    #[link_name = "sk_void_sort_and_dedup__extern"]
    pub fn sk_void_sort_and_dedup(sk: *mut stack_st_void, free_func: sk_void_free_func);
}
unsafe extern "C" {
    #[link_name = "sk_void_is_sorted__extern"]
    pub fn sk_void_is_sorted(sk: *const stack_st_void) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "sk_void_set_cmp_func__extern"]
    pub fn sk_void_set_cmp_func(sk: *mut stack_st_void, comp: sk_void_cmp_func)
        -> sk_void_cmp_func;
}
unsafe extern "C" {
    #[link_name = "sk_void_deep_copy__extern"]
    pub fn sk_void_deep_copy(
        sk: *const stack_st_void,
        copy_func: sk_void_copy_func,
        free_func: sk_void_free_func,
    ) -> *mut stack_st_void;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_st_OPENSSL_STRING {
    _unused: [u8; 0],
}
pub type sk_OPENSSL_STRING_free_func =
    ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_char)>;
pub type sk_OPENSSL_STRING_copy_func = ::core::option::Option<
    unsafe extern "C" fn(arg1: *const ::core::ffi::c_char) -> *mut ::core::ffi::c_char,
>;
pub type sk_OPENSSL_STRING_cmp_func = ::core::option::Option<
    unsafe extern "C" fn(
        arg1: *const *const ::core::ffi::c_char,
        arg2: *const *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int,
>;
pub type sk_OPENSSL_STRING_delete_if_func = ::core::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::core::ffi::c_char,
        arg2: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int,
>;
unsafe extern "C" {
    #[link_name = "sk_OPENSSL_STRING_call_free_func__extern"]
    pub fn sk_OPENSSL_STRING_call_free_func(
        free_func: OPENSSL_sk_free_func,
        ptr: *mut ::core::ffi::c_void,
    );
}
unsafe extern "C" {
    #[link_name = "sk_OPENSSL_STRING_call_copy_func__extern"]
    pub fn sk_OPENSSL_STRING_call_copy_func(
        copy_func: OPENSSL_sk_copy_func,
        ptr: *const ::core::ffi::c_void,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[link_name = "sk_OPENSSL_STRING_call_cmp_func__extern"]
    pub fn sk_OPENSSL_STRING_call_cmp_func(
        cmp_func: OPENSSL_sk_cmp_func,
        a: *const ::core::ffi::c_void,
        b: *const ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "sk_OPENSSL_STRING_call_delete_if_func__extern"]
    pub fn sk_OPENSSL_STRING_call_delete_if_func(
        func: OPENSSL_sk_delete_if_func,
        obj: *mut ::core::ffi::c_void,
        data: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "sk_OPENSSL_STRING_new__extern"]
    pub fn sk_OPENSSL_STRING_new(comp: sk_OPENSSL_STRING_cmp_func) -> *mut stack_st_OPENSSL_STRING;
}
unsafe extern "C" {
    #[link_name = "sk_OPENSSL_STRING_new_null__extern"]
    pub fn sk_OPENSSL_STRING_new_null() -> *mut stack_st_OPENSSL_STRING;
}
unsafe extern "C" {
    #[link_name = "sk_OPENSSL_STRING_num__extern"]
    pub fn sk_OPENSSL_STRING_num(sk: *const stack_st_OPENSSL_STRING) -> usize;
}
unsafe extern "C" {
    #[link_name = "sk_OPENSSL_STRING_zero__extern"]
    pub fn sk_OPENSSL_STRING_zero(sk: *mut stack_st_OPENSSL_STRING);
}
unsafe extern "C" {
    #[link_name = "sk_OPENSSL_STRING_value__extern"]
    pub fn sk_OPENSSL_STRING_value(
        sk: *const stack_st_OPENSSL_STRING,
        i: usize,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    #[link_name = "sk_OPENSSL_STRING_set__extern"]
    pub fn sk_OPENSSL_STRING_set(
        sk: *mut stack_st_OPENSSL_STRING,
        i: usize,
        p: *mut ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    #[link_name = "sk_OPENSSL_STRING_free__extern"]
    pub fn sk_OPENSSL_STRING_free(sk: *mut stack_st_OPENSSL_STRING);
}
unsafe extern "C" {
    #[link_name = "sk_OPENSSL_STRING_pop_free__extern"]
    pub fn sk_OPENSSL_STRING_pop_free(
        sk: *mut stack_st_OPENSSL_STRING,
        free_func: sk_OPENSSL_STRING_free_func,
    );
}
unsafe extern "C" {
    #[link_name = "sk_OPENSSL_STRING_insert__extern"]
    pub fn sk_OPENSSL_STRING_insert(
        sk: *mut stack_st_OPENSSL_STRING,
        p: *mut ::core::ffi::c_char,
        where_: usize,
    ) -> usize;
}
unsafe extern "C" {
    #[link_name = "sk_OPENSSL_STRING_delete__extern"]
    pub fn sk_OPENSSL_STRING_delete(
        sk: *mut stack_st_OPENSSL_STRING,
        where_: usize,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    #[link_name = "sk_OPENSSL_STRING_delete_ptr__extern"]
    pub fn sk_OPENSSL_STRING_delete_ptr(
        sk: *mut stack_st_OPENSSL_STRING,
        p: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    #[link_name = "sk_OPENSSL_STRING_delete_if__extern"]
    pub fn sk_OPENSSL_STRING_delete_if(
        sk: *mut stack_st_OPENSSL_STRING,
        func: sk_OPENSSL_STRING_delete_if_func,
        data: *mut ::core::ffi::c_void,
    );
}
unsafe extern "C" {
    #[link_name = "sk_OPENSSL_STRING_find__extern"]
    pub fn sk_OPENSSL_STRING_find(
        sk: *const stack_st_OPENSSL_STRING,
        out_index: *mut usize,
        p: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "sk_OPENSSL_STRING_shift__extern"]
    pub fn sk_OPENSSL_STRING_shift(sk: *mut stack_st_OPENSSL_STRING) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    #[link_name = "sk_OPENSSL_STRING_push__extern"]
    pub fn sk_OPENSSL_STRING_push(
        sk: *mut stack_st_OPENSSL_STRING,
        p: *mut ::core::ffi::c_char,
    ) -> usize;
}
unsafe extern "C" {
    #[link_name = "sk_OPENSSL_STRING_pop__extern"]
    pub fn sk_OPENSSL_STRING_pop(sk: *mut stack_st_OPENSSL_STRING) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    #[link_name = "sk_OPENSSL_STRING_dup__extern"]
    pub fn sk_OPENSSL_STRING_dup(
        sk: *const stack_st_OPENSSL_STRING,
    ) -> *mut stack_st_OPENSSL_STRING;
}
unsafe extern "C" {
    #[link_name = "sk_OPENSSL_STRING_sort__extern"]
    pub fn sk_OPENSSL_STRING_sort(sk: *mut stack_st_OPENSSL_STRING);
}
unsafe extern "C" {
    #[link_name = "sk_OPENSSL_STRING_sort_and_dedup__extern"]
    pub fn sk_OPENSSL_STRING_sort_and_dedup(
        sk: *mut stack_st_OPENSSL_STRING,
        free_func: sk_OPENSSL_STRING_free_func,
    );
}
unsafe extern "C" {
    #[link_name = "sk_OPENSSL_STRING_is_sorted__extern"]
    pub fn sk_OPENSSL_STRING_is_sorted(sk: *const stack_st_OPENSSL_STRING) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "sk_OPENSSL_STRING_set_cmp_func__extern"]
    pub fn sk_OPENSSL_STRING_set_cmp_func(
        sk: *mut stack_st_OPENSSL_STRING,
        comp: sk_OPENSSL_STRING_cmp_func,
    ) -> sk_OPENSSL_STRING_cmp_func;
}
unsafe extern "C" {
    #[link_name = "sk_OPENSSL_STRING_deep_copy__extern"]
    pub fn sk_OPENSSL_STRING_deep_copy(
        sk: *const stack_st_OPENSSL_STRING,
        copy_func: sk_OPENSSL_STRING_copy_func,
        free_func: sk_OPENSSL_STRING_free_func,
    ) -> *mut stack_st_OPENSSL_STRING;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_st_BIO {
    _unused: [u8; 0],
}
pub type sk_BIO_free_func = ::core::option::Option<unsafe extern "C" fn(arg1: *mut BIO)>;
pub type sk_BIO_copy_func =
    ::core::option::Option<unsafe extern "C" fn(arg1: *const BIO) -> *mut BIO>;
pub type sk_BIO_cmp_func = ::core::option::Option<
    unsafe extern "C" fn(arg1: *const *const BIO, arg2: *const *const BIO) -> ::core::ffi::c_int,
>;
pub type sk_BIO_delete_if_func = ::core::option::Option<
    unsafe extern "C" fn(arg1: *mut BIO, arg2: *mut ::core::ffi::c_void) -> ::core::ffi::c_int,
>;
unsafe extern "C" {
    #[link_name = "sk_BIO_call_free_func__extern"]
    pub fn sk_BIO_call_free_func(free_func: OPENSSL_sk_free_func, ptr: *mut ::core::ffi::c_void);
}
unsafe extern "C" {
    #[link_name = "sk_BIO_call_copy_func__extern"]
    pub fn sk_BIO_call_copy_func(
        copy_func: OPENSSL_sk_copy_func,
        ptr: *const ::core::ffi::c_void,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[link_name = "sk_BIO_call_cmp_func__extern"]
    pub fn sk_BIO_call_cmp_func(
        cmp_func: OPENSSL_sk_cmp_func,
        a: *const ::core::ffi::c_void,
        b: *const ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "sk_BIO_call_delete_if_func__extern"]
    pub fn sk_BIO_call_delete_if_func(
        func: OPENSSL_sk_delete_if_func,
        obj: *mut ::core::ffi::c_void,
        data: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "sk_BIO_new__extern"]
    pub fn sk_BIO_new(comp: sk_BIO_cmp_func) -> *mut stack_st_BIO;
}
unsafe extern "C" {
    #[link_name = "sk_BIO_new_null__extern"]
    pub fn sk_BIO_new_null() -> *mut stack_st_BIO;
}
unsafe extern "C" {
    #[link_name = "sk_BIO_num__extern"]
    pub fn sk_BIO_num(sk: *const stack_st_BIO) -> usize;
}
unsafe extern "C" {
    #[link_name = "sk_BIO_zero__extern"]
    pub fn sk_BIO_zero(sk: *mut stack_st_BIO);
}
unsafe extern "C" {
    #[link_name = "sk_BIO_value__extern"]
    pub fn sk_BIO_value(sk: *const stack_st_BIO, i: usize) -> *mut BIO;
}
unsafe extern "C" {
    #[link_name = "sk_BIO_set__extern"]
    pub fn sk_BIO_set(sk: *mut stack_st_BIO, i: usize, p: *mut BIO) -> *mut BIO;
}
unsafe extern "C" {
    #[link_name = "sk_BIO_free__extern"]
    pub fn sk_BIO_free(sk: *mut stack_st_BIO);
}
unsafe extern "C" {
    #[link_name = "sk_BIO_pop_free__extern"]
    pub fn sk_BIO_pop_free(sk: *mut stack_st_BIO, free_func: sk_BIO_free_func);
}
unsafe extern "C" {
    #[link_name = "sk_BIO_insert__extern"]
    pub fn sk_BIO_insert(sk: *mut stack_st_BIO, p: *mut BIO, where_: usize) -> usize;
}
unsafe extern "C" {
    #[link_name = "sk_BIO_delete__extern"]
    pub fn sk_BIO_delete(sk: *mut stack_st_BIO, where_: usize) -> *mut BIO;
}
unsafe extern "C" {
    #[link_name = "sk_BIO_delete_ptr__extern"]
    pub fn sk_BIO_delete_ptr(sk: *mut stack_st_BIO, p: *const BIO) -> *mut BIO;
}
unsafe extern "C" {
    #[link_name = "sk_BIO_delete_if__extern"]
    pub fn sk_BIO_delete_if(
        sk: *mut stack_st_BIO,
        func: sk_BIO_delete_if_func,
        data: *mut ::core::ffi::c_void,
    );
}
unsafe extern "C" {
    #[link_name = "sk_BIO_find__extern"]
    pub fn sk_BIO_find(
        sk: *const stack_st_BIO,
        out_index: *mut usize,
        p: *const BIO,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "sk_BIO_shift__extern"]
    pub fn sk_BIO_shift(sk: *mut stack_st_BIO) -> *mut BIO;
}
unsafe extern "C" {
    #[link_name = "sk_BIO_push__extern"]
    pub fn sk_BIO_push(sk: *mut stack_st_BIO, p: *mut BIO) -> usize;
}
unsafe extern "C" {
    #[link_name = "sk_BIO_pop__extern"]
    pub fn sk_BIO_pop(sk: *mut stack_st_BIO) -> *mut BIO;
}
unsafe extern "C" {
    #[link_name = "sk_BIO_dup__extern"]
    pub fn sk_BIO_dup(sk: *const stack_st_BIO) -> *mut stack_st_BIO;
}
unsafe extern "C" {
    #[link_name = "sk_BIO_sort__extern"]
    pub fn sk_BIO_sort(sk: *mut stack_st_BIO);
}
unsafe extern "C" {
    #[link_name = "sk_BIO_sort_and_dedup__extern"]
    pub fn sk_BIO_sort_and_dedup(sk: *mut stack_st_BIO, free_func: sk_BIO_free_func);
}
unsafe extern "C" {
    #[link_name = "sk_BIO_is_sorted__extern"]
    pub fn sk_BIO_is_sorted(sk: *const stack_st_BIO) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "sk_BIO_set_cmp_func__extern"]
    pub fn sk_BIO_set_cmp_func(sk: *mut stack_st_BIO, comp: sk_BIO_cmp_func) -> sk_BIO_cmp_func;
}
unsafe extern "C" {
    #[link_name = "sk_BIO_deep_copy__extern"]
    pub fn sk_BIO_deep_copy(
        sk: *const stack_st_BIO,
        copy_func: sk_BIO_copy_func,
        free_func: sk_BIO_free_func,
    ) -> *mut stack_st_BIO;
}
unsafe extern "C" {
    pub fn BIO_new(method: *const BIO_METHOD) -> *mut BIO;
}
unsafe extern "C" {
    pub fn BIO_free(bio: *mut BIO) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_vfree(bio: *mut BIO);
}
unsafe extern "C" {
    pub fn BIO_up_ref(bio: *mut BIO) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_read(
        bio: *mut BIO,
        data: *mut ::core::ffi::c_void,
        len: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_gets(
        bio: *mut BIO,
        buf: *mut ::core::ffi::c_char,
        size: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_write_ex(
        bio: *mut BIO,
        data: *const ::core::ffi::c_void,
        len: usize,
        out_written: *mut usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_write(
        bio: *mut BIO,
        data: *const ::core::ffi::c_void,
        len: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_write_all(
        bio: *mut BIO,
        data: *const ::core::ffi::c_void,
        len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_puts(bio: *mut BIO, buf: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_flush(bio: *mut BIO) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_ctrl(
        bio: *mut BIO,
        cmd: ::core::ffi::c_int,
        larg: ::core::ffi::c_long,
        parg: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn BIO_ptr_ctrl(
        bp: *mut BIO,
        cmd: ::core::ffi::c_int,
        larg: ::core::ffi::c_long,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn BIO_int_ctrl(
        bp: *mut BIO,
        cmd: ::core::ffi::c_int,
        larg: ::core::ffi::c_long,
        iarg: ::core::ffi::c_int,
    ) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn BIO_reset(bio: *mut BIO) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_eof(bio: *mut BIO) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_set_flags(bio: *mut BIO, flags: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn BIO_clear_flags(bio: *mut BIO, flags: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn BIO_test_flags(bio: *const BIO, flags: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_should_read(bio: *const BIO) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_should_write(bio: *const BIO) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_should_retry(bio: *const BIO) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_should_io_special(bio: *const BIO) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_get_retry_reason(bio: *const BIO) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_set_retry_reason(bio: *mut BIO, reason: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn BIO_set_retry_read(bio: *mut BIO);
}
unsafe extern "C" {
    pub fn BIO_set_retry_write(bio: *mut BIO);
}
unsafe extern "C" {
    pub fn BIO_get_retry_flags(bio: *mut BIO) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_clear_retry_flags(bio: *mut BIO);
}
unsafe extern "C" {
    pub fn BIO_method_type(bio: *const BIO) -> ::core::ffi::c_int;
}
pub type BIO_info_cb = ::core::option::Option<
    unsafe extern "C" fn(
        arg1: *mut BIO,
        arg2: ::core::ffi::c_int,
        arg3: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int,
>;
unsafe extern "C" {
    pub fn BIO_callback_ctrl(
        bio: *mut BIO,
        cmd: ::core::ffi::c_int,
        fp: BIO_info_cb,
    ) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn BIO_pending(bio: *const BIO) -> usize;
}
unsafe extern "C" {
    pub fn BIO_ctrl_pending(bio: *const BIO) -> usize;
}
unsafe extern "C" {
    pub fn BIO_wpending(bio: *const BIO) -> usize;
}
unsafe extern "C" {
    pub fn BIO_set_close(bio: *mut BIO, close_flag: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_number_read(bio: *const BIO) -> u64;
}
unsafe extern "C" {
    pub fn BIO_number_written(bio: *const BIO) -> u64;
}
unsafe extern "C" {
    pub fn BIO_push(bio: *mut BIO, appended_bio: *mut BIO) -> *mut BIO;
}
unsafe extern "C" {
    pub fn BIO_pop(bio: *mut BIO) -> *mut BIO;
}
unsafe extern "C" {
    pub fn BIO_next(bio: *mut BIO) -> *mut BIO;
}
unsafe extern "C" {
    pub fn BIO_find_type(bio: *mut BIO, type_: ::core::ffi::c_int) -> *mut BIO;
}
unsafe extern "C" {
    pub fn BIO_copy_next_retry(bio: *mut BIO);
}
unsafe extern "C" {
    pub fn BIO_printf(bio: *mut BIO, format: *const ::core::ffi::c_char, ...)
        -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_indent(
        bio: *mut BIO,
        indent: ::core::ffi::c_uint,
        max_indent: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_hexdump(
        bio: *mut BIO,
        data: *const u8,
        len: usize,
        indent: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ERR_print_errors(bio: *mut BIO);
}
unsafe extern "C" {
    pub fn BIO_read_asn1(
        bio: *mut BIO,
        out: *mut *mut u8,
        out_len: *mut usize,
        max_len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_s_mem() -> *const BIO_METHOD;
}
unsafe extern "C" {
    pub fn BIO_new_mem_buf(buf: *const ::core::ffi::c_void, len: ossl_ssize_t) -> *mut BIO;
}
unsafe extern "C" {
    pub fn BIO_mem_contents(
        bio: *const BIO,
        out_contents: *mut *const u8,
        out_len: *mut usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_get_mem_data(
        bio: *mut BIO,
        contents: *mut *mut ::core::ffi::c_char,
    ) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn BIO_get_mem_ptr(bio: *mut BIO, out: *mut *mut BUF_MEM) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_set_mem_buf(
        bio: *mut BIO,
        b: *mut BUF_MEM,
        take_ownership: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_set_mem_eof_return(
        bio: *mut BIO,
        eof_value: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_s_fd() -> *const BIO_METHOD;
}
unsafe extern "C" {
    pub fn BIO_new_fd(fd: ::core::ffi::c_int, close_flag: ::core::ffi::c_int) -> *mut BIO;
}
unsafe extern "C" {
    pub fn BIO_set_fd(
        bio: *mut BIO,
        fd: ::core::ffi::c_int,
        close_flag: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_get_fd(bio: *mut BIO, out_fd: *mut ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_s_file() -> *const BIO_METHOD;
}
unsafe extern "C" {
    pub fn BIO_new_file(
        filename: *const ::core::ffi::c_char,
        mode: *const ::core::ffi::c_char,
    ) -> *mut BIO;
}
unsafe extern "C" {
    pub fn BIO_new_fp(file: *mut FILE, flags: ::core::ffi::c_int) -> *mut BIO;
}
unsafe extern "C" {
    pub fn BIO_get_fp(bio: *mut BIO, out_file: *mut *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_set_fp(
        bio: *mut BIO,
        file: *mut FILE,
        flags: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_read_filename(
        bio: *mut BIO,
        filename: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_write_filename(
        bio: *mut BIO,
        filename: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_append_filename(
        bio: *mut BIO,
        filename: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_rw_filename(
        bio: *mut BIO,
        filename: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_tell(bio: *mut BIO) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn BIO_seek(bio: *mut BIO, offset: ::core::ffi::c_long) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn BIO_s_socket() -> *const BIO_METHOD;
}
unsafe extern "C" {
    pub fn BIO_new_socket(fd: ::core::ffi::c_int, close_flag: ::core::ffi::c_int) -> *mut BIO;
}
unsafe extern "C" {
    pub fn BIO_s_connect() -> *const BIO_METHOD;
}
unsafe extern "C" {
    pub fn BIO_new_connect(host_and_optional_port: *const ::core::ffi::c_char) -> *mut BIO;
}
unsafe extern "C" {
    pub fn BIO_set_conn_hostname(
        bio: *mut BIO,
        host_and_optional_port: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_set_conn_port(
        bio: *mut BIO,
        port_str: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_set_conn_int_port(
        bio: *mut BIO,
        port: *const ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_set_nbio(bio: *mut BIO, on: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_do_connect(bio: *mut BIO) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_new_bio_pair(
        out1: *mut *mut BIO,
        writebuf1: usize,
        out2: *mut *mut BIO,
        writebuf2: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_ctrl_get_read_request(bio: *mut BIO) -> usize;
}
unsafe extern "C" {
    pub fn BIO_ctrl_get_write_guarantee(bio: *mut BIO) -> usize;
}
unsafe extern "C" {
    pub fn BIO_shutdown_wr(bio: *mut BIO) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_get_new_index() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_meth_new(
        type_: ::core::ffi::c_int,
        name: *const ::core::ffi::c_char,
    ) -> *mut BIO_METHOD;
}
unsafe extern "C" {
    pub fn BIO_meth_free(method: *mut BIO_METHOD);
}
unsafe extern "C" {
    pub fn BIO_meth_set_create(
        method: *mut BIO_METHOD,
        create_func: ::core::option::Option<
            unsafe extern "C" fn(arg1: *mut BIO) -> ::core::ffi::c_int,
        >,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_meth_set_destroy(
        method: *mut BIO_METHOD,
        destroy_func: ::core::option::Option<
            unsafe extern "C" fn(arg1: *mut BIO) -> ::core::ffi::c_int,
        >,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_meth_set_write_ex(
        method: *mut BIO_METHOD,
        write_ex_func: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut BIO,
                arg2: *const ::core::ffi::c_char,
                arg3: usize,
                arg4: *mut usize,
            ) -> ::core::ffi::c_int,
        >,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_meth_set_write(
        method: *mut BIO_METHOD,
        write_func: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut BIO,
                arg2: *const ::core::ffi::c_char,
                arg3: ::core::ffi::c_int,
            ) -> ::core::ffi::c_int,
        >,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_meth_set_read(
        method: *mut BIO_METHOD,
        read_func: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut BIO,
                arg2: *mut ::core::ffi::c_char,
                arg3: ::core::ffi::c_int,
            ) -> ::core::ffi::c_int,
        >,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_meth_set_gets(
        method: *mut BIO_METHOD,
        gets_func: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut BIO,
                arg2: *mut ::core::ffi::c_char,
                arg3: ::core::ffi::c_int,
            ) -> ::core::ffi::c_int,
        >,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_meth_set_ctrl(
        method: *mut BIO_METHOD,
        ctrl_func: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut BIO,
                arg2: ::core::ffi::c_int,
                arg3: ::core::ffi::c_long,
                arg4: *mut ::core::ffi::c_void,
            ) -> ::core::ffi::c_long,
        >,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_meth_set_callback_ctrl(
        method: *mut BIO_METHOD,
        callback_ctrl_func: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut BIO,
                arg2: ::core::ffi::c_int,
                arg3: BIO_info_cb,
            ) -> ::core::ffi::c_long,
        >,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_set_data(bio: *mut BIO, ptr: *mut ::core::ffi::c_void);
}
unsafe extern "C" {
    pub fn BIO_get_data(bio: *mut BIO) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn BIO_set_init(bio: *mut BIO, init: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn BIO_get_init(bio: *mut BIO) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_get_ex_new_index(
        argl: ::core::ffi::c_long,
        argp: *mut ::core::ffi::c_void,
        unused: *mut CRYPTO_EX_unused,
        dup_unused: CRYPTO_EX_dup,
        free_func: CRYPTO_EX_free,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_set_ex_data(
        bio: *mut BIO,
        idx: ::core::ffi::c_int,
        arg: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_get_ex_data(bio: *const BIO, idx: ::core::ffi::c_int) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn BIO_free_all(bio: *mut BIO);
}
pub type bio_info_cb = BIO_info_cb;
unsafe extern "C" {
    pub fn BIO_f_base64() -> *const BIO_METHOD;
}
unsafe extern "C" {
    pub fn BIO_set_retry_special(bio: *mut BIO);
}
unsafe extern "C" {
    pub fn BIO_set_write_buffer_size(
        bio: *mut BIO,
        buffer_size: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_set_shutdown(bio: *mut BIO, shutdown: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn BIO_get_shutdown(bio: *mut BIO) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_meth_set_puts(
        method: *mut BIO_METHOD,
        puts: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut BIO,
                arg2: *const ::core::ffi::c_char,
            ) -> ::core::ffi::c_int,
        >,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_meth_get_write(
        method: *const BIO_METHOD,
    ) -> ::core::option::Option<
        unsafe extern "C" fn(
            method: *mut BIO,
            arg1: *const ::core::ffi::c_char,
            arg2: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >;
}
unsafe extern "C" {
    pub fn BIO_meth_get_read(
        method: *const BIO_METHOD,
    ) -> ::core::option::Option<
        unsafe extern "C" fn(
            method: *mut BIO,
            arg1: *mut ::core::ffi::c_char,
            arg2: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >;
}
unsafe extern "C" {
    pub fn BIO_meth_get_gets(
        method: *const BIO_METHOD,
    ) -> ::core::option::Option<
        unsafe extern "C" fn(
            method: *mut BIO,
            arg1: *mut ::core::ffi::c_char,
            arg2: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >;
}
unsafe extern "C" {
    pub fn BIO_meth_get_puts(
        method: *const BIO_METHOD,
    ) -> ::core::option::Option<
        unsafe extern "C" fn(
            method: *mut BIO,
            arg1: *const ::core::ffi::c_char,
        ) -> ::core::ffi::c_int,
    >;
}
unsafe extern "C" {
    pub fn BIO_meth_get_ctrl(
        method: *const BIO_METHOD,
    ) -> ::core::option::Option<
        unsafe extern "C" fn(
            method: *mut BIO,
            arg1: ::core::ffi::c_int,
            arg2: ::core::ffi::c_long,
            arg3: *mut ::core::ffi::c_void,
        ) -> ::core::ffi::c_long,
    >;
}
unsafe extern "C" {
    pub fn BIO_meth_get_create(
        method: *const BIO_METHOD,
    ) -> ::core::option::Option<unsafe extern "C" fn(method: *mut BIO) -> ::core::ffi::c_int>;
}
unsafe extern "C" {
    pub fn BIO_meth_get_destroy(
        method: *const BIO_METHOD,
    ) -> ::core::option::Option<unsafe extern "C" fn(method: *mut BIO) -> ::core::ffi::c_int>;
}
unsafe extern "C" {
    pub fn BIO_meth_get_callback_ctrl(
        method: *const BIO_METHOD,
    ) -> ::core::option::Option<
        unsafe extern "C" fn(
            method: *mut BIO,
            arg1: ::core::ffi::c_int,
            arg2: BIO_info_cb,
        ) -> ::core::ffi::c_long,
    >;
}
pub type BN_ULONG = u64;
unsafe extern "C" {
    pub fn BN_new() -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn BN_init(bn: *mut BIGNUM);
}
unsafe extern "C" {
    pub fn BN_free(bn: *mut BIGNUM);
}
unsafe extern "C" {
    pub fn BN_clear_free(bn: *mut BIGNUM);
}
unsafe extern "C" {
    pub fn BN_dup(src: *const BIGNUM) -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn BN_copy(dest: *mut BIGNUM, src: *const BIGNUM) -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn BN_clear(bn: *mut BIGNUM);
}
unsafe extern "C" {
    pub fn BN_value_one() -> *const BIGNUM;
}
unsafe extern "C" {
    pub fn BN_num_bits(bn: *const BIGNUM) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn BN_num_bytes(bn: *const BIGNUM) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn BN_zero(bn: *mut BIGNUM);
}
unsafe extern "C" {
    pub fn BN_one(bn: *mut BIGNUM) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_set_word(bn: *mut BIGNUM, value: BN_ULONG) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_set_u64(bn: *mut BIGNUM, value: u64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_set_negative(bn: *mut BIGNUM, sign: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn BN_is_negative(bn: *const BIGNUM) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_bin2bn(in_: *const u8, len: usize, ret: *mut BIGNUM) -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn BN_bn2bin(in_: *const BIGNUM, out: *mut u8) -> usize;
}
unsafe extern "C" {
    pub fn BN_lebin2bn(in_: *const u8, len: usize, ret: *mut BIGNUM) -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn BN_bn2le_padded(out: *mut u8, len: usize, in_: *const BIGNUM) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_bn2bin_padded(out: *mut u8, len: usize, in_: *const BIGNUM) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_bn2cbb_padded(out: *mut CBB, len: usize, in_: *const BIGNUM) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_bn2hex(bn: *const BIGNUM) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn BN_hex2bn(outp: *mut *mut BIGNUM, in_: *const ::core::ffi::c_char)
        -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_bn2dec(a: *const BIGNUM) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn BN_dec2bn(outp: *mut *mut BIGNUM, in_: *const ::core::ffi::c_char)
        -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_asc2bn(outp: *mut *mut BIGNUM, in_: *const ::core::ffi::c_char)
        -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_print(bio: *mut BIO, a: *const BIGNUM) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_print_fp(fp: *mut FILE, a: *const BIGNUM) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_get_word(bn: *const BIGNUM) -> BN_ULONG;
}
unsafe extern "C" {
    pub fn BN_get_u64(bn: *const BIGNUM, out: *mut u64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_parse_asn1_unsigned(cbs: *mut CBS, ret: *mut BIGNUM) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_marshal_asn1(cbb: *mut CBB, bn: *const BIGNUM) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_CTX_new() -> *mut BN_CTX;
}
unsafe extern "C" {
    pub fn BN_CTX_free(ctx: *mut BN_CTX);
}
unsafe extern "C" {
    pub fn BN_CTX_start(ctx: *mut BN_CTX);
}
unsafe extern "C" {
    pub fn BN_CTX_get(ctx: *mut BN_CTX) -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn BN_CTX_end(ctx: *mut BN_CTX);
}
unsafe extern "C" {
    pub fn BN_add(r: *mut BIGNUM, a: *const BIGNUM, b: *const BIGNUM) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_uadd(r: *mut BIGNUM, a: *const BIGNUM, b: *const BIGNUM) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_add_word(a: *mut BIGNUM, w: BN_ULONG) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_sub(r: *mut BIGNUM, a: *const BIGNUM, b: *const BIGNUM) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_usub(r: *mut BIGNUM, a: *const BIGNUM, b: *const BIGNUM) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_sub_word(a: *mut BIGNUM, w: BN_ULONG) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_mul(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_mul_word(bn: *mut BIGNUM, w: BN_ULONG) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_sqr(r: *mut BIGNUM, a: *const BIGNUM, ctx: *mut BN_CTX) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_div(
        quotient: *mut BIGNUM,
        rem: *mut BIGNUM,
        numerator: *const BIGNUM,
        divisor: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_div_word(numerator: *mut BIGNUM, divisor: BN_ULONG) -> BN_ULONG;
}
unsafe extern "C" {
    pub fn BN_sqrt(
        out_sqrt: *mut BIGNUM,
        in_: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_cmp(a: *const BIGNUM, b: *const BIGNUM) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_cmp_word(a: *const BIGNUM, b: BN_ULONG) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_ucmp(a: *const BIGNUM, b: *const BIGNUM) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_equal_consttime(a: *const BIGNUM, b: *const BIGNUM) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_abs_is_word(bn: *const BIGNUM, w: BN_ULONG) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_is_zero(bn: *const BIGNUM) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_is_one(bn: *const BIGNUM) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_is_word(bn: *const BIGNUM, w: BN_ULONG) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_is_odd(bn: *const BIGNUM) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_is_pow2(a: *const BIGNUM) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_lshift(r: *mut BIGNUM, a: *const BIGNUM, n: ::core::ffi::c_int)
        -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_lshift1(r: *mut BIGNUM, a: *const BIGNUM) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_rshift(r: *mut BIGNUM, a: *const BIGNUM, n: ::core::ffi::c_int)
        -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_rshift1(r: *mut BIGNUM, a: *const BIGNUM) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_set_bit(a: *mut BIGNUM, n: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_clear_bit(a: *mut BIGNUM, n: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_is_bit_set(a: *const BIGNUM, n: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_mask_bits(a: *mut BIGNUM, n: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_count_low_zero_bits(bn: *const BIGNUM) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_mod_word(a: *const BIGNUM, w: BN_ULONG) -> BN_ULONG;
}
unsafe extern "C" {
    pub fn BN_mod_pow2(r: *mut BIGNUM, a: *const BIGNUM, e: usize) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_nnmod_pow2(r: *mut BIGNUM, a: *const BIGNUM, e: usize) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_nnmod(
        rem: *mut BIGNUM,
        numerator: *const BIGNUM,
        divisor: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_mod_add(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        m: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_mod_add_quick(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        m: *const BIGNUM,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_mod_sub(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        m: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_mod_sub_quick(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        m: *const BIGNUM,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_mod_mul(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        m: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_mod_sqr(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        m: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_mod_lshift(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        n: ::core::ffi::c_int,
        m: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_mod_lshift_quick(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        n: ::core::ffi::c_int,
        m: *const BIGNUM,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_mod_lshift1(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        m: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_mod_lshift1_quick(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        m: *const BIGNUM,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_mod_sqrt(
        in_: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn BN_rand(
        rnd: *mut BIGNUM,
        bits: ::core::ffi::c_int,
        top: ::core::ffi::c_int,
        bottom: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_pseudo_rand(
        rnd: *mut BIGNUM,
        bits: ::core::ffi::c_int,
        top: ::core::ffi::c_int,
        bottom: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_rand_range(rnd: *mut BIGNUM, range: *const BIGNUM) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_rand_range_ex(
        r: *mut BIGNUM,
        min_inclusive: BN_ULONG,
        max_exclusive: *const BIGNUM,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_pseudo_rand_range(rnd: *mut BIGNUM, range: *const BIGNUM) -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bn_gencb_st {
    pub arg: *mut ::core::ffi::c_void,
    pub callback: ::core::option::Option<
        unsafe extern "C" fn(
            event: ::core::ffi::c_int,
            n: ::core::ffi::c_int,
            arg1: *mut bn_gencb_st,
        ) -> ::core::ffi::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bn_gencb_st"][::core::mem::size_of::<bn_gencb_st>() - 16usize];
    ["Alignment of bn_gencb_st"][::core::mem::align_of::<bn_gencb_st>() - 8usize];
    ["Offset of field: bn_gencb_st::arg"][::core::mem::offset_of!(bn_gencb_st, arg) - 0usize];
    ["Offset of field: bn_gencb_st::callback"]
        [::core::mem::offset_of!(bn_gencb_st, callback) - 8usize];
};
unsafe extern "C" {
    pub fn BN_GENCB_new() -> *mut BN_GENCB;
}
unsafe extern "C" {
    pub fn BN_GENCB_free(callback: *mut BN_GENCB);
}
unsafe extern "C" {
    pub fn BN_GENCB_set(
        callback: *mut BN_GENCB,
        f: ::core::option::Option<
            unsafe extern "C" fn(
                event: ::core::ffi::c_int,
                n: ::core::ffi::c_int,
                arg1: *mut BN_GENCB,
            ) -> ::core::ffi::c_int,
        >,
        arg: *mut ::core::ffi::c_void,
    );
}
unsafe extern "C" {
    pub fn BN_GENCB_call(
        callback: *mut BN_GENCB,
        event: ::core::ffi::c_int,
        n: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_GENCB_get_arg(callback: *const BN_GENCB) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn BN_generate_prime_ex(
        ret: *mut BIGNUM,
        bits: ::core::ffi::c_int,
        safe: ::core::ffi::c_int,
        add: *const BIGNUM,
        rem: *const BIGNUM,
        cb: *mut BN_GENCB,
    ) -> ::core::ffi::c_int;
}
pub const bn_primality_result_t_bn_probably_prime: bn_primality_result_t = 0;
pub const bn_primality_result_t_bn_composite: bn_primality_result_t = 1;
pub const bn_primality_result_t_bn_non_prime_power_composite: bn_primality_result_t = 2;
pub type bn_primality_result_t = ::core::ffi::c_uint;
unsafe extern "C" {
    pub fn BN_enhanced_miller_rabin_primality_test(
        out_result: *mut bn_primality_result_t,
        w: *const BIGNUM,
        checks: ::core::ffi::c_int,
        ctx: *mut BN_CTX,
        cb: *mut BN_GENCB,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_primality_test(
        is_probably_prime: *mut ::core::ffi::c_int,
        candidate: *const BIGNUM,
        checks: ::core::ffi::c_int,
        ctx: *mut BN_CTX,
        do_trial_division: ::core::ffi::c_int,
        cb: *mut BN_GENCB,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_is_prime_fasttest_ex(
        candidate: *const BIGNUM,
        checks: ::core::ffi::c_int,
        ctx: *mut BN_CTX,
        do_trial_division: ::core::ffi::c_int,
        cb: *mut BN_GENCB,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_is_prime_ex(
        candidate: *const BIGNUM,
        checks: ::core::ffi::c_int,
        ctx: *mut BN_CTX,
        cb: *mut BN_GENCB,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_gcd(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_mod_inverse(
        out: *mut BIGNUM,
        a: *const BIGNUM,
        n: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn BN_mod_inverse_blinded(
        out: *mut BIGNUM,
        out_no_inverse: *mut ::core::ffi::c_int,
        a: *const BIGNUM,
        mont: *const BN_MONT_CTX,
        ctx: *mut BN_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_mod_inverse_odd(
        out: *mut BIGNUM,
        out_no_inverse: *mut ::core::ffi::c_int,
        a: *const BIGNUM,
        n: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_MONT_CTX_new_for_modulus(mod_: *const BIGNUM, ctx: *mut BN_CTX) -> *mut BN_MONT_CTX;
}
unsafe extern "C" {
    pub fn BN_MONT_CTX_new_consttime(mod_: *const BIGNUM, ctx: *mut BN_CTX) -> *mut BN_MONT_CTX;
}
unsafe extern "C" {
    pub fn BN_MONT_CTX_free(mont: *mut BN_MONT_CTX);
}
unsafe extern "C" {
    pub fn BN_MONT_CTX_copy(to: *mut BN_MONT_CTX, from: *const BN_MONT_CTX) -> *mut BN_MONT_CTX;
}
unsafe extern "C" {
    pub fn BN_to_montgomery(
        ret: *mut BIGNUM,
        a: *const BIGNUM,
        mont: *const BN_MONT_CTX,
        ctx: *mut BN_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_from_montgomery(
        ret: *mut BIGNUM,
        a: *const BIGNUM,
        mont: *const BN_MONT_CTX,
        ctx: *mut BN_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_mod_mul_montgomery(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        mont: *const BN_MONT_CTX,
        ctx: *mut BN_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_exp(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_mod_exp(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const BIGNUM,
        m: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_mod_exp_mont(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const BIGNUM,
        m: *const BIGNUM,
        ctx: *mut BN_CTX,
        mont: *const BN_MONT_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_mod_exp_mont_consttime(
        rr: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const BIGNUM,
        m: *const BIGNUM,
        ctx: *mut BN_CTX,
        mont: *const BN_MONT_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_bn2mpi(in_: *const BIGNUM, out: *mut u8) -> usize;
}
unsafe extern "C" {
    pub fn BN_mpi2bn(in_: *const u8, len: usize, out: *mut BIGNUM) -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn BN_mod_exp_mont_word(
        r: *mut BIGNUM,
        a: BN_ULONG,
        p: *const BIGNUM,
        m: *const BIGNUM,
        ctx: *mut BN_CTX,
        mont: *const BN_MONT_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_mod_exp2_mont(
        r: *mut BIGNUM,
        a1: *const BIGNUM,
        p1: *const BIGNUM,
        a2: *const BIGNUM,
        p2: *const BIGNUM,
        m: *const BIGNUM,
        ctx: *mut BN_CTX,
        mont: *const BN_MONT_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_MONT_CTX_new() -> *mut BN_MONT_CTX;
}
unsafe extern "C" {
    pub fn BN_MONT_CTX_set(
        mont: *mut BN_MONT_CTX,
        mod_: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_bn2binpad(
        in_: *const BIGNUM,
        out: *mut u8,
        len: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_bn2lebinpad(
        in_: *const BIGNUM,
        out: *mut u8,
        len: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_secure_new() -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn BN_le2bn(in_: *const u8, len: usize, ret: *mut BIGNUM) -> *mut BIGNUM;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bignum_st {
    pub d: *mut BN_ULONG,
    pub width: ::core::ffi::c_int,
    pub dmax: ::core::ffi::c_int,
    pub neg: ::core::ffi::c_int,
    pub flags: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bignum_st"][::core::mem::size_of::<bignum_st>() - 24usize];
    ["Alignment of bignum_st"][::core::mem::align_of::<bignum_st>() - 8usize];
    ["Offset of field: bignum_st::d"][::core::mem::offset_of!(bignum_st, d) - 0usize];
    ["Offset of field: bignum_st::width"][::core::mem::offset_of!(bignum_st, width) - 8usize];
    ["Offset of field: bignum_st::dmax"][::core::mem::offset_of!(bignum_st, dmax) - 12usize];
    ["Offset of field: bignum_st::neg"][::core::mem::offset_of!(bignum_st, neg) - 16usize];
    ["Offset of field: bignum_st::flags"][::core::mem::offset_of!(bignum_st, flags) - 20usize];
};
unsafe extern "C" {
    pub fn BN_num_bits_word(l: BN_ULONG) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn ASN1_tag2bit(tag: ::core::ffi::c_int) -> ::core::ffi::c_ulong;
}
unsafe extern "C" {
    pub fn ASN1_tag2str(tag: ::core::ffi::c_int) -> *const ::core::ffi::c_char;
}
pub type d2i_of_void = ::core::option::Option<
    unsafe extern "C" fn(
        arg1: *mut *mut ::core::ffi::c_void,
        arg2: *mut *const ::core::ffi::c_uchar,
        arg3: ::core::ffi::c_long,
    ) -> *mut ::core::ffi::c_void,
>;
pub type i2d_of_void = ::core::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::core::ffi::c_void,
        arg2: *mut *mut ::core::ffi::c_uchar,
    ) -> ::core::ffi::c_int,
>;
pub type ASN1_ITEM_EXP = ASN1_ITEM;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ASN1_VALUE_st {
    _unused: [u8; 0],
}
pub type ASN1_VALUE = ASN1_VALUE_st;
unsafe extern "C" {
    pub fn ASN1_item_new(it: *const ASN1_ITEM) -> *mut ASN1_VALUE;
}
unsafe extern "C" {
    pub fn ASN1_item_free(val: *mut ASN1_VALUE, it: *const ASN1_ITEM);
}
unsafe extern "C" {
    pub fn ASN1_item_d2i(
        out: *mut *mut ASN1_VALUE,
        inp: *mut *const ::core::ffi::c_uchar,
        len: ::core::ffi::c_long,
        it: *const ASN1_ITEM,
    ) -> *mut ASN1_VALUE;
}
unsafe extern "C" {
    pub fn ASN1_item_i2d(
        val: *mut ASN1_VALUE,
        outp: *mut *mut ::core::ffi::c_uchar,
        it: *const ASN1_ITEM,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_item_dup(
        it: *const ASN1_ITEM,
        x: *mut ::core::ffi::c_void,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn ASN1_item_d2i_fp(
        it: *const ASN1_ITEM,
        in_: *mut FILE,
        out: *mut ::core::ffi::c_void,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn ASN1_item_d2i_bio(
        it: *const ASN1_ITEM,
        in_: *mut BIO,
        out: *mut ::core::ffi::c_void,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn ASN1_item_i2d_fp(
        it: *const ASN1_ITEM,
        out: *mut FILE,
        in_: *const ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_item_i2d_bio(
        it: *const ASN1_ITEM,
        out: *mut BIO,
        in_: *const ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_item_unpack(
        oct: *const ASN1_STRING,
        it: *const ASN1_ITEM,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn ASN1_item_pack(
        obj: *mut ::core::ffi::c_void,
        it: *const ASN1_ITEM,
        out: *mut *mut ASN1_STRING,
    ) -> *mut ASN1_STRING;
}
unsafe extern "C" {
    pub fn d2i_ASN1_BOOLEAN(
        out: *mut ASN1_BOOLEAN,
        inp: *mut *const ::core::ffi::c_uchar,
        len: ::core::ffi::c_long,
    ) -> ASN1_BOOLEAN;
}
unsafe extern "C" {
    pub fn i2d_ASN1_BOOLEAN(
        a: ASN1_BOOLEAN,
        outp: *mut *mut ::core::ffi::c_uchar,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub static ASN1_BOOLEAN_it: ASN1_ITEM;
}
unsafe extern "C" {
    pub static ASN1_TBOOLEAN_it: ASN1_ITEM;
}
unsafe extern "C" {
    pub static ASN1_FBOOLEAN_it: ASN1_ITEM;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn1_string_st {
    pub length: ::core::ffi::c_int,
    pub type_: ::core::ffi::c_int,
    pub data: *mut ::core::ffi::c_uchar,
    pub flags: ::core::ffi::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of asn1_string_st"][::core::mem::size_of::<asn1_string_st>() - 24usize];
    ["Alignment of asn1_string_st"][::core::mem::align_of::<asn1_string_st>() - 8usize];
    ["Offset of field: asn1_string_st::length"]
        [::core::mem::offset_of!(asn1_string_st, length) - 0usize];
    ["Offset of field: asn1_string_st::type_"]
        [::core::mem::offset_of!(asn1_string_st, type_) - 4usize];
    ["Offset of field: asn1_string_st::data"]
        [::core::mem::offset_of!(asn1_string_st, data) - 8usize];
    ["Offset of field: asn1_string_st::flags"]
        [::core::mem::offset_of!(asn1_string_st, flags) - 16usize];
};
unsafe extern "C" {
    pub fn ASN1_STRING_type_new(type_: ::core::ffi::c_int) -> *mut ASN1_STRING;
}
unsafe extern "C" {
    pub fn ASN1_STRING_new() -> *mut ASN1_STRING;
}
unsafe extern "C" {
    pub fn ASN1_STRING_free(str_: *mut ASN1_STRING);
}
unsafe extern "C" {
    pub fn ASN1_STRING_copy(dst: *mut ASN1_STRING, str_: *const ASN1_STRING) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_STRING_dup(str_: *const ASN1_STRING) -> *mut ASN1_STRING;
}
unsafe extern "C" {
    pub fn ASN1_STRING_type(str_: *const ASN1_STRING) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_STRING_get0_data(str_: *const ASN1_STRING) -> *const ::core::ffi::c_uchar;
}
unsafe extern "C" {
    pub fn ASN1_STRING_data(str_: *mut ASN1_STRING) -> *mut ::core::ffi::c_uchar;
}
unsafe extern "C" {
    pub fn ASN1_STRING_length(str_: *const ASN1_STRING) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_STRING_cmp(a: *const ASN1_STRING, b: *const ASN1_STRING) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_STRING_set(
        str_: *mut ASN1_STRING,
        data: *const ::core::ffi::c_void,
        len: ossl_ssize_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_STRING_set0(
        str_: *mut ASN1_STRING,
        data: *mut ::core::ffi::c_void,
        len: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn ASN1_BMPSTRING_new() -> *mut ASN1_BMPSTRING;
}
unsafe extern "C" {
    pub fn ASN1_GENERALSTRING_new() -> *mut ASN1_GENERALSTRING;
}
unsafe extern "C" {
    pub fn ASN1_IA5STRING_new() -> *mut ASN1_IA5STRING;
}
unsafe extern "C" {
    pub fn ASN1_OCTET_STRING_new() -> *mut ASN1_OCTET_STRING;
}
unsafe extern "C" {
    pub fn ASN1_PRINTABLESTRING_new() -> *mut ASN1_PRINTABLESTRING;
}
unsafe extern "C" {
    pub fn ASN1_T61STRING_new() -> *mut ASN1_T61STRING;
}
unsafe extern "C" {
    pub fn ASN1_UNIVERSALSTRING_new() -> *mut ASN1_UNIVERSALSTRING;
}
unsafe extern "C" {
    pub fn ASN1_UTF8STRING_new() -> *mut ASN1_UTF8STRING;
}
unsafe extern "C" {
    pub fn ASN1_VISIBLESTRING_new() -> *mut ASN1_VISIBLESTRING;
}
unsafe extern "C" {
    pub fn ASN1_BMPSTRING_free(str_: *mut ASN1_BMPSTRING);
}
unsafe extern "C" {
    pub fn ASN1_GENERALSTRING_free(str_: *mut ASN1_GENERALSTRING);
}
unsafe extern "C" {
    pub fn ASN1_IA5STRING_free(str_: *mut ASN1_IA5STRING);
}
unsafe extern "C" {
    pub fn ASN1_OCTET_STRING_free(str_: *mut ASN1_OCTET_STRING);
}
unsafe extern "C" {
    pub fn ASN1_PRINTABLESTRING_free(str_: *mut ASN1_PRINTABLESTRING);
}
unsafe extern "C" {
    pub fn ASN1_T61STRING_free(str_: *mut ASN1_T61STRING);
}
unsafe extern "C" {
    pub fn ASN1_UNIVERSALSTRING_free(str_: *mut ASN1_UNIVERSALSTRING);
}
unsafe extern "C" {
    pub fn ASN1_UTF8STRING_free(str_: *mut ASN1_UTF8STRING);
}
unsafe extern "C" {
    pub fn ASN1_VISIBLESTRING_free(str_: *mut ASN1_VISIBLESTRING);
}
unsafe extern "C" {
    pub fn d2i_ASN1_BMPSTRING(
        out: *mut *mut ASN1_BMPSTRING,
        inp: *mut *const u8,
        len: ::core::ffi::c_long,
    ) -> *mut ASN1_BMPSTRING;
}
unsafe extern "C" {
    pub fn d2i_ASN1_GENERALSTRING(
        out: *mut *mut ASN1_GENERALSTRING,
        inp: *mut *const u8,
        len: ::core::ffi::c_long,
    ) -> *mut ASN1_GENERALSTRING;
}
unsafe extern "C" {
    pub fn d2i_ASN1_IA5STRING(
        out: *mut *mut ASN1_IA5STRING,
        inp: *mut *const u8,
        len: ::core::ffi::c_long,
    ) -> *mut ASN1_IA5STRING;
}
unsafe extern "C" {
    pub fn d2i_ASN1_OCTET_STRING(
        out: *mut *mut ASN1_OCTET_STRING,
        inp: *mut *const u8,
        len: ::core::ffi::c_long,
    ) -> *mut ASN1_OCTET_STRING;
}
unsafe extern "C" {
    pub fn d2i_ASN1_PRINTABLESTRING(
        out: *mut *mut ASN1_PRINTABLESTRING,
        inp: *mut *const u8,
        len: ::core::ffi::c_long,
    ) -> *mut ASN1_PRINTABLESTRING;
}
unsafe extern "C" {
    pub fn d2i_ASN1_T61STRING(
        out: *mut *mut ASN1_T61STRING,
        inp: *mut *const u8,
        len: ::core::ffi::c_long,
    ) -> *mut ASN1_T61STRING;
}
unsafe extern "C" {
    pub fn d2i_ASN1_UNIVERSALSTRING(
        out: *mut *mut ASN1_UNIVERSALSTRING,
        inp: *mut *const u8,
        len: ::core::ffi::c_long,
    ) -> *mut ASN1_UNIVERSALSTRING;
}
unsafe extern "C" {
    pub fn d2i_ASN1_UTF8STRING(
        out: *mut *mut ASN1_UTF8STRING,
        inp: *mut *const u8,
        len: ::core::ffi::c_long,
    ) -> *mut ASN1_UTF8STRING;
}
unsafe extern "C" {
    pub fn d2i_ASN1_VISIBLESTRING(
        out: *mut *mut ASN1_VISIBLESTRING,
        inp: *mut *const u8,
        len: ::core::ffi::c_long,
    ) -> *mut ASN1_VISIBLESTRING;
}
unsafe extern "C" {
    pub fn i2d_ASN1_BMPSTRING(in_: *const ASN1_BMPSTRING, outp: *mut *mut u8)
        -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn i2d_ASN1_GENERALSTRING(
        in_: *const ASN1_GENERALSTRING,
        outp: *mut *mut u8,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn i2d_ASN1_IA5STRING(in_: *const ASN1_IA5STRING, outp: *mut *mut u8)
        -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn i2d_ASN1_OCTET_STRING(
        in_: *const ASN1_OCTET_STRING,
        outp: *mut *mut u8,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn i2d_ASN1_PRINTABLESTRING(
        in_: *const ASN1_PRINTABLESTRING,
        outp: *mut *mut u8,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn i2d_ASN1_T61STRING(in_: *const ASN1_T61STRING, outp: *mut *mut u8)
        -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn i2d_ASN1_UNIVERSALSTRING(
        in_: *const ASN1_UNIVERSALSTRING,
        outp: *mut *mut u8,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn i2d_ASN1_UTF8STRING(
        in_: *const ASN1_UTF8STRING,
        outp: *mut *mut u8,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn i2d_ASN1_VISIBLESTRING(
        in_: *const ASN1_VISIBLESTRING,
        outp: *mut *mut u8,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub static ASN1_BMPSTRING_it: ASN1_ITEM;
}
unsafe extern "C" {
    pub static ASN1_GENERALSTRING_it: ASN1_ITEM;
}
unsafe extern "C" {
    pub static ASN1_IA5STRING_it: ASN1_ITEM;
}
unsafe extern "C" {
    pub static ASN1_OCTET_STRING_it: ASN1_ITEM;
}
unsafe extern "C" {
    pub static ASN1_PRINTABLESTRING_it: ASN1_ITEM;
}
unsafe extern "C" {
    pub static ASN1_T61STRING_it: ASN1_ITEM;
}
unsafe extern "C" {
    pub static ASN1_UNIVERSALSTRING_it: ASN1_ITEM;
}
unsafe extern "C" {
    pub static ASN1_UTF8STRING_it: ASN1_ITEM;
}
unsafe extern "C" {
    pub static ASN1_VISIBLESTRING_it: ASN1_ITEM;
}
unsafe extern "C" {
    pub fn ASN1_OCTET_STRING_dup(a: *const ASN1_OCTET_STRING) -> *mut ASN1_OCTET_STRING;
}
unsafe extern "C" {
    pub fn ASN1_OCTET_STRING_cmp(
        a: *const ASN1_OCTET_STRING,
        b: *const ASN1_OCTET_STRING,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_OCTET_STRING_set(
        str_: *mut ASN1_OCTET_STRING,
        data: *const ::core::ffi::c_uchar,
        len: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_STRING_to_UTF8(
        out: *mut *mut ::core::ffi::c_uchar,
        in_: *const ASN1_STRING,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_mbstring_copy(
        out: *mut *mut ASN1_STRING,
        in_: *const u8,
        len: ossl_ssize_t,
        inform: ::core::ffi::c_int,
        mask: ::core::ffi::c_ulong,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_mbstring_ncopy(
        out: *mut *mut ASN1_STRING,
        in_: *const u8,
        len: ossl_ssize_t,
        inform: ::core::ffi::c_int,
        mask: ::core::ffi::c_ulong,
        minsize: ossl_ssize_t,
        maxsize: ossl_ssize_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_STRING_set_by_NID(
        out: *mut *mut ASN1_STRING,
        in_: *const ::core::ffi::c_uchar,
        len: ossl_ssize_t,
        inform: ::core::ffi::c_int,
        nid: ::core::ffi::c_int,
    ) -> *mut ASN1_STRING;
}
unsafe extern "C" {
    pub fn ASN1_STRING_TABLE_add(
        nid: ::core::ffi::c_int,
        minsize: ::core::ffi::c_long,
        maxsize: ::core::ffi::c_long,
        mask: ::core::ffi::c_ulong,
        flags: ::core::ffi::c_ulong,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn DIRECTORYSTRING_new() -> *mut ASN1_STRING;
}
unsafe extern "C" {
    pub fn DIRECTORYSTRING_free(str_: *mut ASN1_STRING);
}
unsafe extern "C" {
    pub fn d2i_DIRECTORYSTRING(
        out: *mut *mut ASN1_STRING,
        inp: *mut *const u8,
        len: ::core::ffi::c_long,
    ) -> *mut ASN1_STRING;
}
unsafe extern "C" {
    pub fn i2d_DIRECTORYSTRING(in_: *const ASN1_STRING, outp: *mut *mut u8) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn DISPLAYTEXT_new() -> *mut ASN1_STRING;
}
unsafe extern "C" {
    pub fn DISPLAYTEXT_free(str_: *mut ASN1_STRING);
}
unsafe extern "C" {
    pub fn d2i_DISPLAYTEXT(
        out: *mut *mut ASN1_STRING,
        inp: *mut *const u8,
        len: ::core::ffi::c_long,
    ) -> *mut ASN1_STRING;
}
unsafe extern "C" {
    pub fn i2d_DISPLAYTEXT(in_: *const ASN1_STRING, outp: *mut *mut u8) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_BIT_STRING_new() -> *mut ASN1_BIT_STRING;
}
unsafe extern "C" {
    pub fn ASN1_BIT_STRING_free(str_: *mut ASN1_BIT_STRING);
}
unsafe extern "C" {
    pub fn d2i_ASN1_BIT_STRING(
        out: *mut *mut ASN1_BIT_STRING,
        inp: *mut *const u8,
        len: ::core::ffi::c_long,
    ) -> *mut ASN1_BIT_STRING;
}
unsafe extern "C" {
    pub fn i2d_ASN1_BIT_STRING(
        in_: *const ASN1_BIT_STRING,
        outp: *mut *mut u8,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn c2i_ASN1_BIT_STRING(
        out: *mut *mut ASN1_BIT_STRING,
        inp: *mut *const u8,
        len: ::core::ffi::c_long,
    ) -> *mut ASN1_BIT_STRING;
}
unsafe extern "C" {
    pub fn i2c_ASN1_BIT_STRING(
        in_: *const ASN1_BIT_STRING,
        outp: *mut *mut u8,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub static ASN1_BIT_STRING_it: ASN1_ITEM;
}
unsafe extern "C" {
    pub fn ASN1_BIT_STRING_unused_bits(str_: *const ASN1_BIT_STRING) -> u8;
}
unsafe extern "C" {
    pub fn ASN1_BIT_STRING_set(
        str_: *mut ASN1_BIT_STRING,
        data: *const u8,
        length: ossl_ssize_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_BIT_STRING_set1(
        str_: *mut ASN1_BIT_STRING,
        data: *const u8,
        length: usize,
        unused_bits: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_BIT_STRING_set_bit(
        str_: *mut ASN1_BIT_STRING,
        n: ::core::ffi::c_int,
        value: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_BIT_STRING_get_bit(
        str_: *const ASN1_BIT_STRING,
        n: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_BIT_STRING_check(
        str_: *const ASN1_BIT_STRING,
        flags: *const ::core::ffi::c_uchar,
        flags_len: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_st_ASN1_INTEGER {
    _unused: [u8; 0],
}
pub type sk_ASN1_INTEGER_free_func =
    ::core::option::Option<unsafe extern "C" fn(arg1: *mut ASN1_INTEGER)>;
pub type sk_ASN1_INTEGER_copy_func =
    ::core::option::Option<unsafe extern "C" fn(arg1: *const ASN1_INTEGER) -> *mut ASN1_INTEGER>;
pub type sk_ASN1_INTEGER_cmp_func = ::core::option::Option<
    unsafe extern "C" fn(
        arg1: *const *const ASN1_INTEGER,
        arg2: *const *const ASN1_INTEGER,
    ) -> ::core::ffi::c_int,
>;
pub type sk_ASN1_INTEGER_delete_if_func = ::core::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ASN1_INTEGER,
        arg2: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int,
>;
unsafe extern "C" {
    #[link_name = "sk_ASN1_INTEGER_call_free_func__extern"]
    pub fn sk_ASN1_INTEGER_call_free_func(
        free_func: OPENSSL_sk_free_func,
        ptr: *mut ::core::ffi::c_void,
    );
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_INTEGER_call_copy_func__extern"]
    pub fn sk_ASN1_INTEGER_call_copy_func(
        copy_func: OPENSSL_sk_copy_func,
        ptr: *const ::core::ffi::c_void,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_INTEGER_call_cmp_func__extern"]
    pub fn sk_ASN1_INTEGER_call_cmp_func(
        cmp_func: OPENSSL_sk_cmp_func,
        a: *const ::core::ffi::c_void,
        b: *const ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_INTEGER_call_delete_if_func__extern"]
    pub fn sk_ASN1_INTEGER_call_delete_if_func(
        func: OPENSSL_sk_delete_if_func,
        obj: *mut ::core::ffi::c_void,
        data: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_INTEGER_new__extern"]
    pub fn sk_ASN1_INTEGER_new(comp: sk_ASN1_INTEGER_cmp_func) -> *mut stack_st_ASN1_INTEGER;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_INTEGER_new_null__extern"]
    pub fn sk_ASN1_INTEGER_new_null() -> *mut stack_st_ASN1_INTEGER;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_INTEGER_num__extern"]
    pub fn sk_ASN1_INTEGER_num(sk: *const stack_st_ASN1_INTEGER) -> usize;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_INTEGER_zero__extern"]
    pub fn sk_ASN1_INTEGER_zero(sk: *mut stack_st_ASN1_INTEGER);
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_INTEGER_value__extern"]
    pub fn sk_ASN1_INTEGER_value(sk: *const stack_st_ASN1_INTEGER, i: usize) -> *mut ASN1_INTEGER;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_INTEGER_set__extern"]
    pub fn sk_ASN1_INTEGER_set(
        sk: *mut stack_st_ASN1_INTEGER,
        i: usize,
        p: *mut ASN1_INTEGER,
    ) -> *mut ASN1_INTEGER;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_INTEGER_free__extern"]
    pub fn sk_ASN1_INTEGER_free(sk: *mut stack_st_ASN1_INTEGER);
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_INTEGER_pop_free__extern"]
    pub fn sk_ASN1_INTEGER_pop_free(
        sk: *mut stack_st_ASN1_INTEGER,
        free_func: sk_ASN1_INTEGER_free_func,
    );
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_INTEGER_insert__extern"]
    pub fn sk_ASN1_INTEGER_insert(
        sk: *mut stack_st_ASN1_INTEGER,
        p: *mut ASN1_INTEGER,
        where_: usize,
    ) -> usize;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_INTEGER_delete__extern"]
    pub fn sk_ASN1_INTEGER_delete(
        sk: *mut stack_st_ASN1_INTEGER,
        where_: usize,
    ) -> *mut ASN1_INTEGER;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_INTEGER_delete_ptr__extern"]
    pub fn sk_ASN1_INTEGER_delete_ptr(
        sk: *mut stack_st_ASN1_INTEGER,
        p: *const ASN1_INTEGER,
    ) -> *mut ASN1_INTEGER;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_INTEGER_delete_if__extern"]
    pub fn sk_ASN1_INTEGER_delete_if(
        sk: *mut stack_st_ASN1_INTEGER,
        func: sk_ASN1_INTEGER_delete_if_func,
        data: *mut ::core::ffi::c_void,
    );
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_INTEGER_find__extern"]
    pub fn sk_ASN1_INTEGER_find(
        sk: *const stack_st_ASN1_INTEGER,
        out_index: *mut usize,
        p: *const ASN1_INTEGER,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_INTEGER_shift__extern"]
    pub fn sk_ASN1_INTEGER_shift(sk: *mut stack_st_ASN1_INTEGER) -> *mut ASN1_INTEGER;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_INTEGER_push__extern"]
    pub fn sk_ASN1_INTEGER_push(sk: *mut stack_st_ASN1_INTEGER, p: *mut ASN1_INTEGER) -> usize;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_INTEGER_pop__extern"]
    pub fn sk_ASN1_INTEGER_pop(sk: *mut stack_st_ASN1_INTEGER) -> *mut ASN1_INTEGER;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_INTEGER_dup__extern"]
    pub fn sk_ASN1_INTEGER_dup(sk: *const stack_st_ASN1_INTEGER) -> *mut stack_st_ASN1_INTEGER;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_INTEGER_sort__extern"]
    pub fn sk_ASN1_INTEGER_sort(sk: *mut stack_st_ASN1_INTEGER);
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_INTEGER_sort_and_dedup__extern"]
    pub fn sk_ASN1_INTEGER_sort_and_dedup(
        sk: *mut stack_st_ASN1_INTEGER,
        free_func: sk_ASN1_INTEGER_free_func,
    );
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_INTEGER_is_sorted__extern"]
    pub fn sk_ASN1_INTEGER_is_sorted(sk: *const stack_st_ASN1_INTEGER) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_INTEGER_set_cmp_func__extern"]
    pub fn sk_ASN1_INTEGER_set_cmp_func(
        sk: *mut stack_st_ASN1_INTEGER,
        comp: sk_ASN1_INTEGER_cmp_func,
    ) -> sk_ASN1_INTEGER_cmp_func;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_INTEGER_deep_copy__extern"]
    pub fn sk_ASN1_INTEGER_deep_copy(
        sk: *const stack_st_ASN1_INTEGER,
        copy_func: sk_ASN1_INTEGER_copy_func,
        free_func: sk_ASN1_INTEGER_free_func,
    ) -> *mut stack_st_ASN1_INTEGER;
}
unsafe extern "C" {
    pub fn ASN1_INTEGER_new() -> *mut ASN1_INTEGER;
}
unsafe extern "C" {
    pub fn ASN1_INTEGER_free(str_: *mut ASN1_INTEGER);
}
unsafe extern "C" {
    pub fn ASN1_INTEGER_dup(x: *const ASN1_INTEGER) -> *mut ASN1_INTEGER;
}
unsafe extern "C" {
    pub fn d2i_ASN1_INTEGER(
        out: *mut *mut ASN1_INTEGER,
        inp: *mut *const u8,
        len: ::core::ffi::c_long,
    ) -> *mut ASN1_INTEGER;
}
unsafe extern "C" {
    pub fn i2d_ASN1_INTEGER(in_: *const ASN1_INTEGER, outp: *mut *mut u8) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn c2i_ASN1_INTEGER(
        in_: *mut *mut ASN1_INTEGER,
        outp: *mut *const u8,
        len: ::core::ffi::c_long,
    ) -> *mut ASN1_INTEGER;
}
unsafe extern "C" {
    pub fn i2c_ASN1_INTEGER(in_: *const ASN1_INTEGER, outp: *mut *mut u8) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub static ASN1_INTEGER_it: ASN1_ITEM;
}
unsafe extern "C" {
    pub fn ASN1_INTEGER_set_uint64(out: *mut ASN1_INTEGER, v: u64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_INTEGER_set_int64(out: *mut ASN1_INTEGER, v: i64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_INTEGER_get_uint64(out: *mut u64, a: *const ASN1_INTEGER) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_INTEGER_get_int64(out: *mut i64, a: *const ASN1_INTEGER) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_to_ASN1_INTEGER(bn: *const BIGNUM, ai: *mut ASN1_INTEGER) -> *mut ASN1_INTEGER;
}
unsafe extern "C" {
    pub fn ASN1_INTEGER_to_BN(ai: *const ASN1_INTEGER, bn: *mut BIGNUM) -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn ASN1_INTEGER_cmp(x: *const ASN1_INTEGER, y: *const ASN1_INTEGER) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_ENUMERATED_new() -> *mut ASN1_ENUMERATED;
}
unsafe extern "C" {
    pub fn ASN1_ENUMERATED_free(str_: *mut ASN1_ENUMERATED);
}
unsafe extern "C" {
    pub fn d2i_ASN1_ENUMERATED(
        out: *mut *mut ASN1_ENUMERATED,
        inp: *mut *const u8,
        len: ::core::ffi::c_long,
    ) -> *mut ASN1_ENUMERATED;
}
unsafe extern "C" {
    pub fn i2d_ASN1_ENUMERATED(
        in_: *const ASN1_ENUMERATED,
        outp: *mut *mut u8,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub static ASN1_ENUMERATED_it: ASN1_ITEM;
}
unsafe extern "C" {
    pub fn ASN1_ENUMERATED_set_uint64(out: *mut ASN1_ENUMERATED, v: u64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_ENUMERATED_set_int64(out: *mut ASN1_ENUMERATED, v: i64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_ENUMERATED_get_uint64(
        out: *mut u64,
        a: *const ASN1_ENUMERATED,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_ENUMERATED_get_int64(
        out: *mut i64,
        a: *const ASN1_ENUMERATED,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BN_to_ASN1_ENUMERATED(
        bn: *const BIGNUM,
        ai: *mut ASN1_ENUMERATED,
    ) -> *mut ASN1_ENUMERATED;
}
unsafe extern "C" {
    pub fn ASN1_ENUMERATED_to_BN(ai: *const ASN1_ENUMERATED, bn: *mut BIGNUM) -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn ASN1_UTCTIME_new() -> *mut ASN1_UTCTIME;
}
unsafe extern "C" {
    pub fn ASN1_UTCTIME_free(str_: *mut ASN1_UTCTIME);
}
unsafe extern "C" {
    pub fn d2i_ASN1_UTCTIME(
        out: *mut *mut ASN1_UTCTIME,
        inp: *mut *const u8,
        len: ::core::ffi::c_long,
    ) -> *mut ASN1_UTCTIME;
}
unsafe extern "C" {
    pub fn i2d_ASN1_UTCTIME(in_: *const ASN1_UTCTIME, outp: *mut *mut u8) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub static ASN1_UTCTIME_it: ASN1_ITEM;
}
unsafe extern "C" {
    pub fn ASN1_UTCTIME_check(a: *const ASN1_UTCTIME) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_UTCTIME_set(s: *mut ASN1_UTCTIME, posix_time: i64) -> *mut ASN1_UTCTIME;
}
unsafe extern "C" {
    pub fn ASN1_UTCTIME_adj(
        s: *mut ASN1_UTCTIME,
        posix_time: i64,
        offset_day: ::core::ffi::c_int,
        offset_sec: ::core::ffi::c_long,
    ) -> *mut ASN1_UTCTIME;
}
unsafe extern "C" {
    pub fn ASN1_UTCTIME_set_string(
        s: *mut ASN1_UTCTIME,
        str_: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_GENERALIZEDTIME_new() -> *mut ASN1_GENERALIZEDTIME;
}
unsafe extern "C" {
    pub fn ASN1_GENERALIZEDTIME_free(str_: *mut ASN1_GENERALIZEDTIME);
}
unsafe extern "C" {
    pub fn d2i_ASN1_GENERALIZEDTIME(
        out: *mut *mut ASN1_GENERALIZEDTIME,
        inp: *mut *const u8,
        len: ::core::ffi::c_long,
    ) -> *mut ASN1_GENERALIZEDTIME;
}
unsafe extern "C" {
    pub fn i2d_ASN1_GENERALIZEDTIME(
        in_: *const ASN1_GENERALIZEDTIME,
        outp: *mut *mut u8,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub static ASN1_GENERALIZEDTIME_it: ASN1_ITEM;
}
unsafe extern "C" {
    pub fn ASN1_GENERALIZEDTIME_check(a: *const ASN1_GENERALIZEDTIME) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_GENERALIZEDTIME_set(
        s: *mut ASN1_GENERALIZEDTIME,
        posix_time: i64,
    ) -> *mut ASN1_GENERALIZEDTIME;
}
unsafe extern "C" {
    pub fn ASN1_GENERALIZEDTIME_adj(
        s: *mut ASN1_GENERALIZEDTIME,
        posix_time: i64,
        offset_day: ::core::ffi::c_int,
        offset_sec: ::core::ffi::c_long,
    ) -> *mut ASN1_GENERALIZEDTIME;
}
unsafe extern "C" {
    pub fn ASN1_GENERALIZEDTIME_set_string(
        s: *mut ASN1_GENERALIZEDTIME,
        str_: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_TIME_new() -> *mut ASN1_TIME;
}
unsafe extern "C" {
    pub fn ASN1_TIME_free(str_: *mut ASN1_TIME);
}
unsafe extern "C" {
    pub fn d2i_ASN1_TIME(
        out: *mut *mut ASN1_TIME,
        inp: *mut *const u8,
        len: ::core::ffi::c_long,
    ) -> *mut ASN1_TIME;
}
unsafe extern "C" {
    pub fn i2d_ASN1_TIME(in_: *const ASN1_TIME, outp: *mut *mut u8) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_TIME_diff(
        out_days: *mut ::core::ffi::c_int,
        out_seconds: *mut ::core::ffi::c_int,
        from: *const ASN1_TIME,
        to: *const ASN1_TIME,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_TIME_set_posix(s: *mut ASN1_TIME, posix_time: i64) -> *mut ASN1_TIME;
}
unsafe extern "C" {
    pub fn ASN1_TIME_set(s: *mut ASN1_TIME, time: time_t) -> *mut ASN1_TIME;
}
unsafe extern "C" {
    pub fn ASN1_TIME_adj(
        s: *mut ASN1_TIME,
        posix_time: i64,
        offset_day: ::core::ffi::c_int,
        offset_sec: ::core::ffi::c_long,
    ) -> *mut ASN1_TIME;
}
unsafe extern "C" {
    pub fn ASN1_TIME_check(t: *const ASN1_TIME) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_TIME_to_generalizedtime(
        t: *const ASN1_TIME,
        out: *mut *mut ASN1_GENERALIZEDTIME,
    ) -> *mut ASN1_GENERALIZEDTIME;
}
unsafe extern "C" {
    pub fn ASN1_TIME_set_string(
        s: *mut ASN1_TIME,
        str_: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_TIME_set_string_X509(
        s: *mut ASN1_TIME,
        str_: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_TIME_to_time_t(t: *const ASN1_TIME, out: *mut time_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_TIME_to_posix(t: *const ASN1_TIME, out: *mut i64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_TIME_to_posix_nonstandard(t: *const ASN1_TIME, out: *mut i64)
        -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_NULL_new() -> *mut ASN1_NULL;
}
unsafe extern "C" {
    pub fn ASN1_NULL_free(null: *mut ASN1_NULL);
}
unsafe extern "C" {
    pub fn d2i_ASN1_NULL(
        out: *mut *mut ASN1_NULL,
        inp: *mut *const u8,
        len: ::core::ffi::c_long,
    ) -> *mut ASN1_NULL;
}
unsafe extern "C" {
    pub fn i2d_ASN1_NULL(in_: *const ASN1_NULL, outp: *mut *mut u8) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub static ASN1_NULL_it: ASN1_ITEM;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_st_ASN1_OBJECT {
    _unused: [u8; 0],
}
pub type sk_ASN1_OBJECT_free_func =
    ::core::option::Option<unsafe extern "C" fn(arg1: *mut ASN1_OBJECT)>;
pub type sk_ASN1_OBJECT_copy_func =
    ::core::option::Option<unsafe extern "C" fn(arg1: *const ASN1_OBJECT) -> *mut ASN1_OBJECT>;
pub type sk_ASN1_OBJECT_cmp_func = ::core::option::Option<
    unsafe extern "C" fn(
        arg1: *const *const ASN1_OBJECT,
        arg2: *const *const ASN1_OBJECT,
    ) -> ::core::ffi::c_int,
>;
pub type sk_ASN1_OBJECT_delete_if_func = ::core::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ASN1_OBJECT,
        arg2: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int,
>;
unsafe extern "C" {
    #[link_name = "sk_ASN1_OBJECT_call_free_func__extern"]
    pub fn sk_ASN1_OBJECT_call_free_func(
        free_func: OPENSSL_sk_free_func,
        ptr: *mut ::core::ffi::c_void,
    );
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_OBJECT_call_copy_func__extern"]
    pub fn sk_ASN1_OBJECT_call_copy_func(
        copy_func: OPENSSL_sk_copy_func,
        ptr: *const ::core::ffi::c_void,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_OBJECT_call_cmp_func__extern"]
    pub fn sk_ASN1_OBJECT_call_cmp_func(
        cmp_func: OPENSSL_sk_cmp_func,
        a: *const ::core::ffi::c_void,
        b: *const ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_OBJECT_call_delete_if_func__extern"]
    pub fn sk_ASN1_OBJECT_call_delete_if_func(
        func: OPENSSL_sk_delete_if_func,
        obj: *mut ::core::ffi::c_void,
        data: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_OBJECT_new__extern"]
    pub fn sk_ASN1_OBJECT_new(comp: sk_ASN1_OBJECT_cmp_func) -> *mut stack_st_ASN1_OBJECT;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_OBJECT_new_null__extern"]
    pub fn sk_ASN1_OBJECT_new_null() -> *mut stack_st_ASN1_OBJECT;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_OBJECT_num__extern"]
    pub fn sk_ASN1_OBJECT_num(sk: *const stack_st_ASN1_OBJECT) -> usize;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_OBJECT_zero__extern"]
    pub fn sk_ASN1_OBJECT_zero(sk: *mut stack_st_ASN1_OBJECT);
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_OBJECT_value__extern"]
    pub fn sk_ASN1_OBJECT_value(sk: *const stack_st_ASN1_OBJECT, i: usize) -> *mut ASN1_OBJECT;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_OBJECT_set__extern"]
    pub fn sk_ASN1_OBJECT_set(
        sk: *mut stack_st_ASN1_OBJECT,
        i: usize,
        p: *mut ASN1_OBJECT,
    ) -> *mut ASN1_OBJECT;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_OBJECT_free__extern"]
    pub fn sk_ASN1_OBJECT_free(sk: *mut stack_st_ASN1_OBJECT);
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_OBJECT_pop_free__extern"]
    pub fn sk_ASN1_OBJECT_pop_free(
        sk: *mut stack_st_ASN1_OBJECT,
        free_func: sk_ASN1_OBJECT_free_func,
    );
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_OBJECT_insert__extern"]
    pub fn sk_ASN1_OBJECT_insert(
        sk: *mut stack_st_ASN1_OBJECT,
        p: *mut ASN1_OBJECT,
        where_: usize,
    ) -> usize;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_OBJECT_delete__extern"]
    pub fn sk_ASN1_OBJECT_delete(sk: *mut stack_st_ASN1_OBJECT, where_: usize) -> *mut ASN1_OBJECT;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_OBJECT_delete_ptr__extern"]
    pub fn sk_ASN1_OBJECT_delete_ptr(
        sk: *mut stack_st_ASN1_OBJECT,
        p: *const ASN1_OBJECT,
    ) -> *mut ASN1_OBJECT;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_OBJECT_delete_if__extern"]
    pub fn sk_ASN1_OBJECT_delete_if(
        sk: *mut stack_st_ASN1_OBJECT,
        func: sk_ASN1_OBJECT_delete_if_func,
        data: *mut ::core::ffi::c_void,
    );
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_OBJECT_find__extern"]
    pub fn sk_ASN1_OBJECT_find(
        sk: *const stack_st_ASN1_OBJECT,
        out_index: *mut usize,
        p: *const ASN1_OBJECT,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_OBJECT_shift__extern"]
    pub fn sk_ASN1_OBJECT_shift(sk: *mut stack_st_ASN1_OBJECT) -> *mut ASN1_OBJECT;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_OBJECT_push__extern"]
    pub fn sk_ASN1_OBJECT_push(sk: *mut stack_st_ASN1_OBJECT, p: *mut ASN1_OBJECT) -> usize;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_OBJECT_pop__extern"]
    pub fn sk_ASN1_OBJECT_pop(sk: *mut stack_st_ASN1_OBJECT) -> *mut ASN1_OBJECT;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_OBJECT_dup__extern"]
    pub fn sk_ASN1_OBJECT_dup(sk: *const stack_st_ASN1_OBJECT) -> *mut stack_st_ASN1_OBJECT;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_OBJECT_sort__extern"]
    pub fn sk_ASN1_OBJECT_sort(sk: *mut stack_st_ASN1_OBJECT);
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_OBJECT_sort_and_dedup__extern"]
    pub fn sk_ASN1_OBJECT_sort_and_dedup(
        sk: *mut stack_st_ASN1_OBJECT,
        free_func: sk_ASN1_OBJECT_free_func,
    );
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_OBJECT_is_sorted__extern"]
    pub fn sk_ASN1_OBJECT_is_sorted(sk: *const stack_st_ASN1_OBJECT) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_OBJECT_set_cmp_func__extern"]
    pub fn sk_ASN1_OBJECT_set_cmp_func(
        sk: *mut stack_st_ASN1_OBJECT,
        comp: sk_ASN1_OBJECT_cmp_func,
    ) -> sk_ASN1_OBJECT_cmp_func;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_OBJECT_deep_copy__extern"]
    pub fn sk_ASN1_OBJECT_deep_copy(
        sk: *const stack_st_ASN1_OBJECT,
        copy_func: sk_ASN1_OBJECT_copy_func,
        free_func: sk_ASN1_OBJECT_free_func,
    ) -> *mut stack_st_ASN1_OBJECT;
}
unsafe extern "C" {
    pub fn ASN1_OBJECT_create(
        nid: ::core::ffi::c_int,
        data: *const u8,
        len: usize,
        sn: *const ::core::ffi::c_char,
        ln: *const ::core::ffi::c_char,
    ) -> *mut ASN1_OBJECT;
}
unsafe extern "C" {
    pub fn ASN1_OBJECT_free(a: *mut ASN1_OBJECT);
}
unsafe extern "C" {
    pub fn d2i_ASN1_OBJECT(
        out: *mut *mut ASN1_OBJECT,
        inp: *mut *const u8,
        len: ::core::ffi::c_long,
    ) -> *mut ASN1_OBJECT;
}
unsafe extern "C" {
    pub fn i2d_ASN1_OBJECT(in_: *const ASN1_OBJECT, outp: *mut *mut u8) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn c2i_ASN1_OBJECT(
        out: *mut *mut ASN1_OBJECT,
        inp: *mut *const u8,
        len: ::core::ffi::c_long,
    ) -> *mut ASN1_OBJECT;
}
unsafe extern "C" {
    pub static ASN1_OBJECT_it: ASN1_ITEM;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct asn1_type_st {
    pub type_: ::core::ffi::c_int,
    pub value: asn1_type_st__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union asn1_type_st__bindgen_ty_1 {
    pub ptr: *mut ::core::ffi::c_char,
    pub boolean: ASN1_BOOLEAN,
    pub asn1_string: *mut ASN1_STRING,
    pub object: *mut ASN1_OBJECT,
    pub integer: *mut ASN1_INTEGER,
    pub enumerated: *mut ASN1_ENUMERATED,
    pub bit_string: *mut ASN1_BIT_STRING,
    pub octet_string: *mut ASN1_OCTET_STRING,
    pub printablestring: *mut ASN1_PRINTABLESTRING,
    pub t61string: *mut ASN1_T61STRING,
    pub ia5string: *mut ASN1_IA5STRING,
    pub generalstring: *mut ASN1_GENERALSTRING,
    pub bmpstring: *mut ASN1_BMPSTRING,
    pub universalstring: *mut ASN1_UNIVERSALSTRING,
    pub utctime: *mut ASN1_UTCTIME,
    pub generalizedtime: *mut ASN1_GENERALIZEDTIME,
    pub visiblestring: *mut ASN1_VISIBLESTRING,
    pub utf8string: *mut ASN1_UTF8STRING,
    pub set: *mut ASN1_STRING,
    pub sequence: *mut ASN1_STRING,
    pub asn1_value: *mut ASN1_VALUE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of asn1_type_st__bindgen_ty_1"]
        [::core::mem::size_of::<asn1_type_st__bindgen_ty_1>() - 8usize];
    ["Alignment of asn1_type_st__bindgen_ty_1"]
        [::core::mem::align_of::<asn1_type_st__bindgen_ty_1>() - 8usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::ptr"]
        [::core::mem::offset_of!(asn1_type_st__bindgen_ty_1, ptr) - 0usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::boolean"]
        [::core::mem::offset_of!(asn1_type_st__bindgen_ty_1, boolean) - 0usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::asn1_string"]
        [::core::mem::offset_of!(asn1_type_st__bindgen_ty_1, asn1_string) - 0usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::object"]
        [::core::mem::offset_of!(asn1_type_st__bindgen_ty_1, object) - 0usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::integer"]
        [::core::mem::offset_of!(asn1_type_st__bindgen_ty_1, integer) - 0usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::enumerated"]
        [::core::mem::offset_of!(asn1_type_st__bindgen_ty_1, enumerated) - 0usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::bit_string"]
        [::core::mem::offset_of!(asn1_type_st__bindgen_ty_1, bit_string) - 0usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::octet_string"]
        [::core::mem::offset_of!(asn1_type_st__bindgen_ty_1, octet_string) - 0usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::printablestring"]
        [::core::mem::offset_of!(asn1_type_st__bindgen_ty_1, printablestring) - 0usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::t61string"]
        [::core::mem::offset_of!(asn1_type_st__bindgen_ty_1, t61string) - 0usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::ia5string"]
        [::core::mem::offset_of!(asn1_type_st__bindgen_ty_1, ia5string) - 0usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::generalstring"]
        [::core::mem::offset_of!(asn1_type_st__bindgen_ty_1, generalstring) - 0usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::bmpstring"]
        [::core::mem::offset_of!(asn1_type_st__bindgen_ty_1, bmpstring) - 0usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::universalstring"]
        [::core::mem::offset_of!(asn1_type_st__bindgen_ty_1, universalstring) - 0usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::utctime"]
        [::core::mem::offset_of!(asn1_type_st__bindgen_ty_1, utctime) - 0usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::generalizedtime"]
        [::core::mem::offset_of!(asn1_type_st__bindgen_ty_1, generalizedtime) - 0usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::visiblestring"]
        [::core::mem::offset_of!(asn1_type_st__bindgen_ty_1, visiblestring) - 0usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::utf8string"]
        [::core::mem::offset_of!(asn1_type_st__bindgen_ty_1, utf8string) - 0usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::set"]
        [::core::mem::offset_of!(asn1_type_st__bindgen_ty_1, set) - 0usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::sequence"]
        [::core::mem::offset_of!(asn1_type_st__bindgen_ty_1, sequence) - 0usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::asn1_value"]
        [::core::mem::offset_of!(asn1_type_st__bindgen_ty_1, asn1_value) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of asn1_type_st"][::core::mem::size_of::<asn1_type_st>() - 16usize];
    ["Alignment of asn1_type_st"][::core::mem::align_of::<asn1_type_st>() - 8usize];
    ["Offset of field: asn1_type_st::type_"][::core::mem::offset_of!(asn1_type_st, type_) - 0usize];
    ["Offset of field: asn1_type_st::value"][::core::mem::offset_of!(asn1_type_st, value) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_st_ASN1_TYPE {
    _unused: [u8; 0],
}
pub type sk_ASN1_TYPE_free_func =
    ::core::option::Option<unsafe extern "C" fn(arg1: *mut ASN1_TYPE)>;
pub type sk_ASN1_TYPE_copy_func =
    ::core::option::Option<unsafe extern "C" fn(arg1: *const ASN1_TYPE) -> *mut ASN1_TYPE>;
pub type sk_ASN1_TYPE_cmp_func = ::core::option::Option<
    unsafe extern "C" fn(
        arg1: *const *const ASN1_TYPE,
        arg2: *const *const ASN1_TYPE,
    ) -> ::core::ffi::c_int,
>;
pub type sk_ASN1_TYPE_delete_if_func = ::core::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ASN1_TYPE,
        arg2: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int,
>;
unsafe extern "C" {
    #[link_name = "sk_ASN1_TYPE_call_free_func__extern"]
    pub fn sk_ASN1_TYPE_call_free_func(
        free_func: OPENSSL_sk_free_func,
        ptr: *mut ::core::ffi::c_void,
    );
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_TYPE_call_copy_func__extern"]
    pub fn sk_ASN1_TYPE_call_copy_func(
        copy_func: OPENSSL_sk_copy_func,
        ptr: *const ::core::ffi::c_void,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_TYPE_call_cmp_func__extern"]
    pub fn sk_ASN1_TYPE_call_cmp_func(
        cmp_func: OPENSSL_sk_cmp_func,
        a: *const ::core::ffi::c_void,
        b: *const ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_TYPE_call_delete_if_func__extern"]
    pub fn sk_ASN1_TYPE_call_delete_if_func(
        func: OPENSSL_sk_delete_if_func,
        obj: *mut ::core::ffi::c_void,
        data: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_TYPE_new__extern"]
    pub fn sk_ASN1_TYPE_new(comp: sk_ASN1_TYPE_cmp_func) -> *mut stack_st_ASN1_TYPE;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_TYPE_new_null__extern"]
    pub fn sk_ASN1_TYPE_new_null() -> *mut stack_st_ASN1_TYPE;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_TYPE_num__extern"]
    pub fn sk_ASN1_TYPE_num(sk: *const stack_st_ASN1_TYPE) -> usize;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_TYPE_zero__extern"]
    pub fn sk_ASN1_TYPE_zero(sk: *mut stack_st_ASN1_TYPE);
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_TYPE_value__extern"]
    pub fn sk_ASN1_TYPE_value(sk: *const stack_st_ASN1_TYPE, i: usize) -> *mut ASN1_TYPE;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_TYPE_set__extern"]
    pub fn sk_ASN1_TYPE_set(
        sk: *mut stack_st_ASN1_TYPE,
        i: usize,
        p: *mut ASN1_TYPE,
    ) -> *mut ASN1_TYPE;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_TYPE_free__extern"]
    pub fn sk_ASN1_TYPE_free(sk: *mut stack_st_ASN1_TYPE);
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_TYPE_pop_free__extern"]
    pub fn sk_ASN1_TYPE_pop_free(sk: *mut stack_st_ASN1_TYPE, free_func: sk_ASN1_TYPE_free_func);
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_TYPE_insert__extern"]
    pub fn sk_ASN1_TYPE_insert(
        sk: *mut stack_st_ASN1_TYPE,
        p: *mut ASN1_TYPE,
        where_: usize,
    ) -> usize;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_TYPE_delete__extern"]
    pub fn sk_ASN1_TYPE_delete(sk: *mut stack_st_ASN1_TYPE, where_: usize) -> *mut ASN1_TYPE;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_TYPE_delete_ptr__extern"]
    pub fn sk_ASN1_TYPE_delete_ptr(
        sk: *mut stack_st_ASN1_TYPE,
        p: *const ASN1_TYPE,
    ) -> *mut ASN1_TYPE;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_TYPE_delete_if__extern"]
    pub fn sk_ASN1_TYPE_delete_if(
        sk: *mut stack_st_ASN1_TYPE,
        func: sk_ASN1_TYPE_delete_if_func,
        data: *mut ::core::ffi::c_void,
    );
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_TYPE_find__extern"]
    pub fn sk_ASN1_TYPE_find(
        sk: *const stack_st_ASN1_TYPE,
        out_index: *mut usize,
        p: *const ASN1_TYPE,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_TYPE_shift__extern"]
    pub fn sk_ASN1_TYPE_shift(sk: *mut stack_st_ASN1_TYPE) -> *mut ASN1_TYPE;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_TYPE_push__extern"]
    pub fn sk_ASN1_TYPE_push(sk: *mut stack_st_ASN1_TYPE, p: *mut ASN1_TYPE) -> usize;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_TYPE_pop__extern"]
    pub fn sk_ASN1_TYPE_pop(sk: *mut stack_st_ASN1_TYPE) -> *mut ASN1_TYPE;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_TYPE_dup__extern"]
    pub fn sk_ASN1_TYPE_dup(sk: *const stack_st_ASN1_TYPE) -> *mut stack_st_ASN1_TYPE;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_TYPE_sort__extern"]
    pub fn sk_ASN1_TYPE_sort(sk: *mut stack_st_ASN1_TYPE);
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_TYPE_sort_and_dedup__extern"]
    pub fn sk_ASN1_TYPE_sort_and_dedup(
        sk: *mut stack_st_ASN1_TYPE,
        free_func: sk_ASN1_TYPE_free_func,
    );
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_TYPE_is_sorted__extern"]
    pub fn sk_ASN1_TYPE_is_sorted(sk: *const stack_st_ASN1_TYPE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_TYPE_set_cmp_func__extern"]
    pub fn sk_ASN1_TYPE_set_cmp_func(
        sk: *mut stack_st_ASN1_TYPE,
        comp: sk_ASN1_TYPE_cmp_func,
    ) -> sk_ASN1_TYPE_cmp_func;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_TYPE_deep_copy__extern"]
    pub fn sk_ASN1_TYPE_deep_copy(
        sk: *const stack_st_ASN1_TYPE,
        copy_func: sk_ASN1_TYPE_copy_func,
        free_func: sk_ASN1_TYPE_free_func,
    ) -> *mut stack_st_ASN1_TYPE;
}
unsafe extern "C" {
    pub fn ASN1_TYPE_new() -> *mut ASN1_TYPE;
}
unsafe extern "C" {
    pub fn ASN1_TYPE_free(a: *mut ASN1_TYPE);
}
unsafe extern "C" {
    pub fn d2i_ASN1_TYPE(
        out: *mut *mut ASN1_TYPE,
        inp: *mut *const u8,
        len: ::core::ffi::c_long,
    ) -> *mut ASN1_TYPE;
}
unsafe extern "C" {
    pub fn i2d_ASN1_TYPE(in_: *const ASN1_TYPE, outp: *mut *mut u8) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub static ASN1_ANY_it: ASN1_ITEM;
}
unsafe extern "C" {
    pub fn ASN1_TYPE_get(a: *const ASN1_TYPE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_TYPE_set(
        a: *mut ASN1_TYPE,
        type_: ::core::ffi::c_int,
        value: *mut ::core::ffi::c_void,
    );
}
unsafe extern "C" {
    pub fn ASN1_TYPE_set1(
        a: *mut ASN1_TYPE,
        type_: ::core::ffi::c_int,
        value: *const ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_TYPE_cmp(a: *const ASN1_TYPE, b: *const ASN1_TYPE) -> ::core::ffi::c_int;
}
pub type ASN1_SEQUENCE_ANY = stack_st_ASN1_TYPE;
unsafe extern "C" {
    pub fn d2i_ASN1_SEQUENCE_ANY(
        out: *mut *mut ASN1_SEQUENCE_ANY,
        inp: *mut *const u8,
        len: ::core::ffi::c_long,
    ) -> *mut ASN1_SEQUENCE_ANY;
}
unsafe extern "C" {
    pub fn i2d_ASN1_SEQUENCE_ANY(
        in_: *const ASN1_SEQUENCE_ANY,
        outp: *mut *mut u8,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn d2i_ASN1_SET_ANY(
        out: *mut *mut ASN1_SEQUENCE_ANY,
        inp: *mut *const u8,
        len: ::core::ffi::c_long,
    ) -> *mut ASN1_SEQUENCE_ANY;
}
unsafe extern "C" {
    pub fn i2d_ASN1_SET_ANY(
        in_: *const ASN1_SEQUENCE_ANY,
        outp: *mut *mut u8,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_UTCTIME_print(out: *mut BIO, a: *const ASN1_UTCTIME) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_GENERALIZEDTIME_print(
        out: *mut BIO,
        a: *const ASN1_GENERALIZEDTIME,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_TIME_print(out: *mut BIO, a: *const ASN1_TIME) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_STRING_print(out: *mut BIO, str_: *const ASN1_STRING) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_STRING_print_ex(
        out: *mut BIO,
        str_: *const ASN1_STRING,
        flags: ::core::ffi::c_ulong,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_STRING_print_ex_fp(
        fp: *mut FILE,
        str_: *const ASN1_STRING,
        flags: ::core::ffi::c_ulong,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn i2a_ASN1_INTEGER(bp: *mut BIO, a: *const ASN1_INTEGER) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn i2a_ASN1_ENUMERATED(bp: *mut BIO, a: *const ASN1_ENUMERATED) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn i2a_ASN1_OBJECT(bp: *mut BIO, a: *const ASN1_OBJECT) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn i2a_ASN1_STRING(
        bp: *mut BIO,
        a: *const ASN1_STRING,
        type_: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn i2t_ASN1_OBJECT(
        buf: *mut ::core::ffi::c_char,
        buf_len: ::core::ffi::c_int,
        a: *const ASN1_OBJECT,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_get_object(
        inp: *mut *const ::core::ffi::c_uchar,
        out_length: *mut ::core::ffi::c_long,
        out_tag: *mut ::core::ffi::c_int,
        out_class: *mut ::core::ffi::c_int,
        max_len: ::core::ffi::c_long,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_put_object(
        outp: *mut *mut ::core::ffi::c_uchar,
        constructed: ::core::ffi::c_int,
        length: ::core::ffi::c_int,
        tag: ::core::ffi::c_int,
        xclass: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn ASN1_put_eoc(outp: *mut *mut ::core::ffi::c_uchar) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_object_size(
        constructed: ::core::ffi::c_int,
        length: ::core::ffi::c_int,
        tag: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_BIT_STRING_num_bytes(
        str_: *const ASN1_BIT_STRING,
        out: *mut usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_STRING_set_default_mask(mask: ::core::ffi::c_ulong);
}
unsafe extern "C" {
    pub fn ASN1_STRING_set_default_mask_asc(p: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_STRING_get_default_mask() -> ::core::ffi::c_ulong;
}
unsafe extern "C" {
    pub fn ASN1_STRING_TABLE_cleanup();
}
unsafe extern "C" {
    pub fn ASN1_INTEGER_set(a: *mut ASN1_INTEGER, v: ::core::ffi::c_long) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_ENUMERATED_set(
        a: *mut ASN1_ENUMERATED,
        v: ::core::ffi::c_long,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ASN1_INTEGER_get(a: *const ASN1_INTEGER) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn ASN1_ENUMERATED_get(a: *const ASN1_ENUMERATED) -> ::core::ffi::c_long;
}
pub type ASN1_TEMPLATE = ASN1_TEMPLATE_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ASN1_TLC_st {
    _unused: [u8; 0],
}
pub type ASN1_TLC = ASN1_TLC_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ASN1_TEMPLATE_st {
    pub flags: u32,
    pub tag: ::core::ffi::c_int,
    pub offset: ::core::ffi::c_ulong,
    pub field_name: *const ::core::ffi::c_char,
    pub item: *const ASN1_ITEM_st,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ASN1_TEMPLATE_st"][::core::mem::size_of::<ASN1_TEMPLATE_st>() - 32usize];
    ["Alignment of ASN1_TEMPLATE_st"][::core::mem::align_of::<ASN1_TEMPLATE_st>() - 8usize];
    ["Offset of field: ASN1_TEMPLATE_st::flags"]
        [::core::mem::offset_of!(ASN1_TEMPLATE_st, flags) - 0usize];
    ["Offset of field: ASN1_TEMPLATE_st::tag"]
        [::core::mem::offset_of!(ASN1_TEMPLATE_st, tag) - 4usize];
    ["Offset of field: ASN1_TEMPLATE_st::offset"]
        [::core::mem::offset_of!(ASN1_TEMPLATE_st, offset) - 8usize];
    ["Offset of field: ASN1_TEMPLATE_st::field_name"]
        [::core::mem::offset_of!(ASN1_TEMPLATE_st, field_name) - 16usize];
    ["Offset of field: ASN1_TEMPLATE_st::item"]
        [::core::mem::offset_of!(ASN1_TEMPLATE_st, item) - 24usize];
};
pub type ASN1_ADB_TABLE = ASN1_ADB_TABLE_st;
pub type ASN1_ADB = ASN1_ADB_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ASN1_ADB_st {
    pub flags: u32,
    pub offset: ::core::ffi::c_ulong,
    pub unused: *mut CRYPTO_MUST_BE_NULL,
    pub tbl: *const ASN1_ADB_TABLE,
    pub tblcount: ::core::ffi::c_long,
    pub default_tt: *const ASN1_TEMPLATE,
    pub null_tt: *const ASN1_TEMPLATE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ASN1_ADB_st"][::core::mem::size_of::<ASN1_ADB_st>() - 56usize];
    ["Alignment of ASN1_ADB_st"][::core::mem::align_of::<ASN1_ADB_st>() - 8usize];
    ["Offset of field: ASN1_ADB_st::flags"][::core::mem::offset_of!(ASN1_ADB_st, flags) - 0usize];
    ["Offset of field: ASN1_ADB_st::offset"][::core::mem::offset_of!(ASN1_ADB_st, offset) - 8usize];
    ["Offset of field: ASN1_ADB_st::unused"]
        [::core::mem::offset_of!(ASN1_ADB_st, unused) - 16usize];
    ["Offset of field: ASN1_ADB_st::tbl"][::core::mem::offset_of!(ASN1_ADB_st, tbl) - 24usize];
    ["Offset of field: ASN1_ADB_st::tblcount"]
        [::core::mem::offset_of!(ASN1_ADB_st, tblcount) - 32usize];
    ["Offset of field: ASN1_ADB_st::default_tt"]
        [::core::mem::offset_of!(ASN1_ADB_st, default_tt) - 40usize];
    ["Offset of field: ASN1_ADB_st::null_tt"]
        [::core::mem::offset_of!(ASN1_ADB_st, null_tt) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ASN1_ADB_TABLE_st {
    pub value: ::core::ffi::c_int,
    pub tt: ASN1_TEMPLATE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ASN1_ADB_TABLE_st"][::core::mem::size_of::<ASN1_ADB_TABLE_st>() - 40usize];
    ["Alignment of ASN1_ADB_TABLE_st"][::core::mem::align_of::<ASN1_ADB_TABLE_st>() - 8usize];
    ["Offset of field: ASN1_ADB_TABLE_st::value"]
        [::core::mem::offset_of!(ASN1_ADB_TABLE_st, value) - 0usize];
    ["Offset of field: ASN1_ADB_TABLE_st::tt"]
        [::core::mem::offset_of!(ASN1_ADB_TABLE_st, tt) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ASN1_ITEM_st {
    pub itype: ::core::ffi::c_char,
    pub utype: ::core::ffi::c_int,
    pub templates: *const ASN1_TEMPLATE,
    pub tcount: ::core::ffi::c_long,
    pub funcs: *const ::core::ffi::c_void,
    pub size: ::core::ffi::c_long,
    pub sname: *const ::core::ffi::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ASN1_ITEM_st"][::core::mem::size_of::<ASN1_ITEM_st>() - 48usize];
    ["Alignment of ASN1_ITEM_st"][::core::mem::align_of::<ASN1_ITEM_st>() - 8usize];
    ["Offset of field: ASN1_ITEM_st::itype"][::core::mem::offset_of!(ASN1_ITEM_st, itype) - 0usize];
    ["Offset of field: ASN1_ITEM_st::utype"][::core::mem::offset_of!(ASN1_ITEM_st, utype) - 4usize];
    ["Offset of field: ASN1_ITEM_st::templates"]
        [::core::mem::offset_of!(ASN1_ITEM_st, templates) - 8usize];
    ["Offset of field: ASN1_ITEM_st::tcount"]
        [::core::mem::offset_of!(ASN1_ITEM_st, tcount) - 16usize];
    ["Offset of field: ASN1_ITEM_st::funcs"]
        [::core::mem::offset_of!(ASN1_ITEM_st, funcs) - 24usize];
    ["Offset of field: ASN1_ITEM_st::size"][::core::mem::offset_of!(ASN1_ITEM_st, size) - 32usize];
    ["Offset of field: ASN1_ITEM_st::sname"]
        [::core::mem::offset_of!(ASN1_ITEM_st, sname) - 40usize];
};
pub type ASN1_aux_cb = ::core::option::Option<
    unsafe extern "C" fn(
        operation: ::core::ffi::c_int,
        in_: *mut *mut ASN1_VALUE,
        it: *const ASN1_ITEM,
        exarg: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ASN1_AUX_st {
    pub app_data: *mut ::core::ffi::c_void,
    pub flags: u32,
    pub ref_offset: ::core::ffi::c_int,
    pub asn1_cb: ASN1_aux_cb,
    pub enc_offset: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ASN1_AUX_st"][::core::mem::size_of::<ASN1_AUX_st>() - 32usize];
    ["Alignment of ASN1_AUX_st"][::core::mem::align_of::<ASN1_AUX_st>() - 8usize];
    ["Offset of field: ASN1_AUX_st::app_data"]
        [::core::mem::offset_of!(ASN1_AUX_st, app_data) - 0usize];
    ["Offset of field: ASN1_AUX_st::flags"][::core::mem::offset_of!(ASN1_AUX_st, flags) - 8usize];
    ["Offset of field: ASN1_AUX_st::ref_offset"]
        [::core::mem::offset_of!(ASN1_AUX_st, ref_offset) - 12usize];
    ["Offset of field: ASN1_AUX_st::asn1_cb"]
        [::core::mem::offset_of!(ASN1_AUX_st, asn1_cb) - 16usize];
    ["Offset of field: ASN1_AUX_st::enc_offset"]
        [::core::mem::offset_of!(ASN1_AUX_st, enc_offset) - 24usize];
};
pub type ASN1_AUX = ASN1_AUX_st;
unsafe extern "C" {
    pub static ASN1_SEQUENCE_it: ASN1_ITEM;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_st_ASN1_VALUE {
    _unused: [u8; 0],
}
pub type sk_ASN1_VALUE_free_func =
    ::core::option::Option<unsafe extern "C" fn(arg1: *mut ASN1_VALUE)>;
pub type sk_ASN1_VALUE_copy_func =
    ::core::option::Option<unsafe extern "C" fn(arg1: *const ASN1_VALUE) -> *mut ASN1_VALUE>;
pub type sk_ASN1_VALUE_cmp_func = ::core::option::Option<
    unsafe extern "C" fn(
        arg1: *const *const ASN1_VALUE,
        arg2: *const *const ASN1_VALUE,
    ) -> ::core::ffi::c_int,
>;
pub type sk_ASN1_VALUE_delete_if_func = ::core::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ASN1_VALUE,
        arg2: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int,
>;
unsafe extern "C" {
    #[link_name = "sk_ASN1_VALUE_call_free_func__extern"]
    pub fn sk_ASN1_VALUE_call_free_func(
        free_func: OPENSSL_sk_free_func,
        ptr: *mut ::core::ffi::c_void,
    );
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_VALUE_call_copy_func__extern"]
    pub fn sk_ASN1_VALUE_call_copy_func(
        copy_func: OPENSSL_sk_copy_func,
        ptr: *const ::core::ffi::c_void,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_VALUE_call_cmp_func__extern"]
    pub fn sk_ASN1_VALUE_call_cmp_func(
        cmp_func: OPENSSL_sk_cmp_func,
        a: *const ::core::ffi::c_void,
        b: *const ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_VALUE_call_delete_if_func__extern"]
    pub fn sk_ASN1_VALUE_call_delete_if_func(
        func: OPENSSL_sk_delete_if_func,
        obj: *mut ::core::ffi::c_void,
        data: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_VALUE_new__extern"]
    pub fn sk_ASN1_VALUE_new(comp: sk_ASN1_VALUE_cmp_func) -> *mut stack_st_ASN1_VALUE;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_VALUE_new_null__extern"]
    pub fn sk_ASN1_VALUE_new_null() -> *mut stack_st_ASN1_VALUE;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_VALUE_num__extern"]
    pub fn sk_ASN1_VALUE_num(sk: *const stack_st_ASN1_VALUE) -> usize;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_VALUE_zero__extern"]
    pub fn sk_ASN1_VALUE_zero(sk: *mut stack_st_ASN1_VALUE);
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_VALUE_value__extern"]
    pub fn sk_ASN1_VALUE_value(sk: *const stack_st_ASN1_VALUE, i: usize) -> *mut ASN1_VALUE;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_VALUE_set__extern"]
    pub fn sk_ASN1_VALUE_set(
        sk: *mut stack_st_ASN1_VALUE,
        i: usize,
        p: *mut ASN1_VALUE,
    ) -> *mut ASN1_VALUE;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_VALUE_free__extern"]
    pub fn sk_ASN1_VALUE_free(sk: *mut stack_st_ASN1_VALUE);
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_VALUE_pop_free__extern"]
    pub fn sk_ASN1_VALUE_pop_free(sk: *mut stack_st_ASN1_VALUE, free_func: sk_ASN1_VALUE_free_func);
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_VALUE_insert__extern"]
    pub fn sk_ASN1_VALUE_insert(
        sk: *mut stack_st_ASN1_VALUE,
        p: *mut ASN1_VALUE,
        where_: usize,
    ) -> usize;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_VALUE_delete__extern"]
    pub fn sk_ASN1_VALUE_delete(sk: *mut stack_st_ASN1_VALUE, where_: usize) -> *mut ASN1_VALUE;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_VALUE_delete_ptr__extern"]
    pub fn sk_ASN1_VALUE_delete_ptr(
        sk: *mut stack_st_ASN1_VALUE,
        p: *const ASN1_VALUE,
    ) -> *mut ASN1_VALUE;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_VALUE_delete_if__extern"]
    pub fn sk_ASN1_VALUE_delete_if(
        sk: *mut stack_st_ASN1_VALUE,
        func: sk_ASN1_VALUE_delete_if_func,
        data: *mut ::core::ffi::c_void,
    );
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_VALUE_find__extern"]
    pub fn sk_ASN1_VALUE_find(
        sk: *const stack_st_ASN1_VALUE,
        out_index: *mut usize,
        p: *const ASN1_VALUE,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_VALUE_shift__extern"]
    pub fn sk_ASN1_VALUE_shift(sk: *mut stack_st_ASN1_VALUE) -> *mut ASN1_VALUE;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_VALUE_push__extern"]
    pub fn sk_ASN1_VALUE_push(sk: *mut stack_st_ASN1_VALUE, p: *mut ASN1_VALUE) -> usize;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_VALUE_pop__extern"]
    pub fn sk_ASN1_VALUE_pop(sk: *mut stack_st_ASN1_VALUE) -> *mut ASN1_VALUE;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_VALUE_dup__extern"]
    pub fn sk_ASN1_VALUE_dup(sk: *const stack_st_ASN1_VALUE) -> *mut stack_st_ASN1_VALUE;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_VALUE_sort__extern"]
    pub fn sk_ASN1_VALUE_sort(sk: *mut stack_st_ASN1_VALUE);
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_VALUE_sort_and_dedup__extern"]
    pub fn sk_ASN1_VALUE_sort_and_dedup(
        sk: *mut stack_st_ASN1_VALUE,
        free_func: sk_ASN1_VALUE_free_func,
    );
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_VALUE_is_sorted__extern"]
    pub fn sk_ASN1_VALUE_is_sorted(sk: *const stack_st_ASN1_VALUE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_VALUE_set_cmp_func__extern"]
    pub fn sk_ASN1_VALUE_set_cmp_func(
        sk: *mut stack_st_ASN1_VALUE,
        comp: sk_ASN1_VALUE_cmp_func,
    ) -> sk_ASN1_VALUE_cmp_func;
}
unsafe extern "C" {
    #[link_name = "sk_ASN1_VALUE_deep_copy__extern"]
    pub fn sk_ASN1_VALUE_deep_copy(
        sk: *const stack_st_ASN1_VALUE,
        copy_func: sk_ASN1_VALUE_copy_func,
        free_func: sk_ASN1_VALUE_free_func,
    ) -> *mut stack_st_ASN1_VALUE;
}
unsafe extern "C" {
    pub fn EVP_EncodeBlock(dst: *mut u8, src: *const u8, src_len: usize) -> usize;
}
unsafe extern "C" {
    pub fn EVP_EncodedLength(out_len: *mut usize, len: usize) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_DecodedLength(out_len: *mut usize, len: usize) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_DecodeBase64(
        out: *mut u8,
        out_len: *mut usize,
        max_out: usize,
        in_: *const u8,
        in_len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_ENCODE_CTX_new() -> *mut EVP_ENCODE_CTX;
}
unsafe extern "C" {
    pub fn EVP_ENCODE_CTX_free(ctx: *mut EVP_ENCODE_CTX);
}
unsafe extern "C" {
    pub fn EVP_EncodeInit(ctx: *mut EVP_ENCODE_CTX);
}
unsafe extern "C" {
    pub fn EVP_EncodeUpdate(
        ctx: *mut EVP_ENCODE_CTX,
        out: *mut u8,
        out_len: *mut ::core::ffi::c_int,
        in_: *const u8,
        in_len: usize,
    );
}
unsafe extern "C" {
    pub fn EVP_EncodeFinal(
        ctx: *mut EVP_ENCODE_CTX,
        out: *mut u8,
        out_len: *mut ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn EVP_DecodeInit(ctx: *mut EVP_ENCODE_CTX);
}
unsafe extern "C" {
    pub fn EVP_DecodeUpdate(
        ctx: *mut EVP_ENCODE_CTX,
        out: *mut u8,
        out_len: *mut ::core::ffi::c_int,
        in_: *const u8,
        in_len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_DecodeFinal(
        ctx: *mut EVP_ENCODE_CTX,
        out: *mut u8,
        out_len: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_DecodeBlock(dst: *mut u8, src: *const u8, src_len: usize) -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_encode_ctx_st {
    pub data_used: ::core::ffi::c_uint,
    pub data: [u8; 48usize],
    pub eof_seen: ::core::ffi::c_char,
    pub error_encountered: ::core::ffi::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of evp_encode_ctx_st"][::core::mem::size_of::<evp_encode_ctx_st>() - 56usize];
    ["Alignment of evp_encode_ctx_st"][::core::mem::align_of::<evp_encode_ctx_st>() - 4usize];
    ["Offset of field: evp_encode_ctx_st::data_used"]
        [::core::mem::offset_of!(evp_encode_ctx_st, data_used) - 0usize];
    ["Offset of field: evp_encode_ctx_st::data"]
        [::core::mem::offset_of!(evp_encode_ctx_st, data) - 4usize];
    ["Offset of field: evp_encode_ctx_st::eof_seen"]
        [::core::mem::offset_of!(evp_encode_ctx_st, eof_seen) - 52usize];
    ["Offset of field: evp_encode_ctx_st::error_encountered"]
        [::core::mem::offset_of!(evp_encode_ctx_st, error_encountered) - 53usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blake2b_state_st {
    pub h: [u64; 8usize],
    pub t_low: u64,
    pub t_high: u32,
    pub block_used: u32,
    pub block: [u8; 128usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of blake2b_state_st"][::core::mem::size_of::<blake2b_state_st>() - 208usize];
    ["Alignment of blake2b_state_st"][::core::mem::align_of::<blake2b_state_st>() - 8usize];
    ["Offset of field: blake2b_state_st::h"][::core::mem::offset_of!(blake2b_state_st, h) - 0usize];
    ["Offset of field: blake2b_state_st::t_low"]
        [::core::mem::offset_of!(blake2b_state_st, t_low) - 64usize];
    ["Offset of field: blake2b_state_st::t_high"]
        [::core::mem::offset_of!(blake2b_state_st, t_high) - 72usize];
    ["Offset of field: blake2b_state_st::block_used"]
        [::core::mem::offset_of!(blake2b_state_st, block_used) - 76usize];
    ["Offset of field: blake2b_state_st::block"]
        [::core::mem::offset_of!(blake2b_state_st, block) - 80usize];
};
unsafe extern "C" {
    pub fn BLAKE2B256_Init(b2b: *mut BLAKE2B_CTX);
}
unsafe extern "C" {
    pub fn BLAKE2B256_Update(b2b: *mut BLAKE2B_CTX, data: *const ::core::ffi::c_void, len: usize);
}
unsafe extern "C" {
    pub fn BLAKE2B256_Final(out: *mut u8, b2b: *mut BLAKE2B_CTX);
}
unsafe extern "C" {
    pub fn BLAKE2B256(data: *const u8, len: usize, out: *mut u8);
}
unsafe extern "C" {
    pub fn BLAKE2B512_Init(b2b: *mut BLAKE2B_CTX);
}
unsafe extern "C" {
    pub fn BLAKE2B512_Update(b2b: *mut BLAKE2B_CTX, data: *const ::core::ffi::c_void, len: usize);
}
unsafe extern "C" {
    pub fn BLAKE2B512_Final(out: *mut u8, b2b: *mut BLAKE2B_CTX);
}
unsafe extern "C" {
    pub fn BLAKE2B512(data: *const u8, len: usize, out: *mut u8);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bf_key_st {
    pub P: [u32; 18usize],
    pub S: [u32; 1024usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bf_key_st"][::core::mem::size_of::<bf_key_st>() - 4168usize];
    ["Alignment of bf_key_st"][::core::mem::align_of::<bf_key_st>() - 4usize];
    ["Offset of field: bf_key_st::P"][::core::mem::offset_of!(bf_key_st, P) - 0usize];
    ["Offset of field: bf_key_st::S"][::core::mem::offset_of!(bf_key_st, S) - 72usize];
};
pub type BF_KEY = bf_key_st;
unsafe extern "C" {
    pub fn BF_set_key(key: *mut BF_KEY, len: usize, data: *const u8);
}
unsafe extern "C" {
    pub fn BF_encrypt(data: *mut u32, key: *const BF_KEY);
}
unsafe extern "C" {
    pub fn BF_decrypt(data: *mut u32, key: *const BF_KEY);
}
unsafe extern "C" {
    pub fn BF_ecb_encrypt(
        in_: *const u8,
        out: *mut u8,
        key: *const BF_KEY,
        enc: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn BF_cbc_encrypt(
        in_: *const u8,
        out: *mut u8,
        length: usize,
        schedule: *const BF_KEY,
        ivec: *mut u8,
        enc: ::core::ffi::c_int,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cbs_st {
    pub data: *const u8,
    pub len: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cbs_st"][::core::mem::size_of::<cbs_st>() - 16usize];
    ["Alignment of cbs_st"][::core::mem::align_of::<cbs_st>() - 8usize];
    ["Offset of field: cbs_st::data"][::core::mem::offset_of!(cbs_st, data) - 0usize];
    ["Offset of field: cbs_st::len"][::core::mem::offset_of!(cbs_st, len) - 8usize];
};
unsafe extern "C" {
    #[link_name = "CBS_init__extern"]
    pub fn CBS_init(cbs: *mut CBS, data: *const u8, len: usize);
}
unsafe extern "C" {
    pub fn CBS_skip(cbs: *mut CBS, len: usize) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "CBS_data__extern"]
    pub fn CBS_data(cbs: *const CBS) -> *const u8;
}
unsafe extern "C" {
    #[link_name = "CBS_len__extern"]
    pub fn CBS_len(cbs: *const CBS) -> usize;
}
unsafe extern "C" {
    pub fn CBS_stow(
        cbs: *const CBS,
        out_ptr: *mut *mut u8,
        out_len: *mut usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_strdup(
        cbs: *const CBS,
        out_ptr: *mut *mut ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_contains_zero_byte(cbs: *const CBS) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_mem_equal(cbs: *const CBS, data: *const u8, len: usize) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_get_u8(cbs: *mut CBS, out: *mut u8) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_get_u16(cbs: *mut CBS, out: *mut u16) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_get_u16le(cbs: *mut CBS, out: *mut u16) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_get_u24(cbs: *mut CBS, out: *mut u32) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_get_u32(cbs: *mut CBS, out: *mut u32) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_get_u32le(cbs: *mut CBS, out: *mut u32) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_get_u48(cbs: *mut CBS, out: *mut u64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_get_u64(cbs: *mut CBS, out: *mut u64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_get_u64le(cbs: *mut CBS, out: *mut u64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_get_last_u8(cbs: *mut CBS, out: *mut u8) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_get_bytes(cbs: *mut CBS, out: *mut CBS, len: usize) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_copy_bytes(cbs: *mut CBS, out: *mut u8, len: usize) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_get_u8_length_prefixed(cbs: *mut CBS, out: *mut CBS) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_get_u16_length_prefixed(cbs: *mut CBS, out: *mut CBS) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_get_u24_length_prefixed(cbs: *mut CBS, out: *mut CBS) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_get_until_first(cbs: *mut CBS, out: *mut CBS, c: u8) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_get_until_first_of(
        cbs: *mut CBS,
        out: *mut CBS,
        chars: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_get_until_first_not_of(
        cbs: *mut CBS,
        out: *mut CBS,
        chars: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_get_u64_decimal(cbs: *mut CBS, out: *mut u64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_get_asn1(
        cbs: *mut CBS,
        out: *mut CBS,
        tag_value: CBS_ASN1_TAG,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_get_asn1_element(
        cbs: *mut CBS,
        out: *mut CBS,
        tag_value: CBS_ASN1_TAG,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_peek_any_asn1_tag(cbs: *const CBS) -> CBS_ASN1_TAG;
}
unsafe extern "C" {
    pub fn CBS_peek_asn1_tag(cbs: *const CBS, tag_value: CBS_ASN1_TAG) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_get_any_asn1(
        cbs: *mut CBS,
        out: *mut CBS,
        out_tag: *mut CBS_ASN1_TAG,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_get_any_asn1_element(
        cbs: *mut CBS,
        out: *mut CBS,
        out_tag: *mut CBS_ASN1_TAG,
        out_header_len: *mut usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_get_any_ber_asn1_element(
        cbs: *mut CBS,
        out: *mut CBS,
        out_tag: *mut CBS_ASN1_TAG,
        out_header_len: *mut usize,
        out_ber_found: *mut ::core::ffi::c_int,
        out_indefinite: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_get_asn1_uint64(cbs: *mut CBS, out: *mut u64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_get_asn1_uint64_with_tag(
        cbs: *mut CBS,
        out: *mut u64,
        tag: CBS_ASN1_TAG,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_get_asn1_int64(cbs: *mut CBS, out: *mut i64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_get_asn1_int64_with_tag(
        cbs: *mut CBS,
        out: *mut i64,
        tag: CBS_ASN1_TAG,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_get_asn1_bool(cbs: *mut CBS, out: *mut ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_get_optional_asn1(
        cbs: *mut CBS,
        out: *mut CBS,
        out_present: *mut ::core::ffi::c_int,
        tag: CBS_ASN1_TAG,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_get_optional_asn1_octet_string(
        cbs: *mut CBS,
        out: *mut CBS,
        out_present: *mut ::core::ffi::c_int,
        tag: CBS_ASN1_TAG,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_get_optional_asn1_uint64(
        cbs: *mut CBS,
        out: *mut u64,
        tag: CBS_ASN1_TAG,
        default_value: u64,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_get_optional_asn1_bool(
        cbs: *mut CBS,
        out: *mut ::core::ffi::c_int,
        tag: CBS_ASN1_TAG,
        default_value: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_is_valid_asn1_bitstring(cbs: *const CBS) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_asn1_bitstring_has_bit(
        cbs: *const CBS,
        bit: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_is_valid_asn1_integer(
        cbs: *const CBS,
        out_is_negative: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_is_unsigned_asn1_integer(cbs: *const CBS) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_is_valid_asn1_oid(cbs: *const CBS) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_asn1_oid_to_text(cbs: *const CBS) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn CBS_is_valid_asn1_relative_oid(cbs: *const CBS) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_asn1_relative_oid_to_text(cbs: *const CBS) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn CBS_parse_generalized_time(
        cbs: *const CBS,
        out_tm: *mut tm,
        allow_timezone_offset: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_parse_utc_time(
        cbs: *const CBS,
        out_tm: *mut tm,
        allow_timezone_offset: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cbb_buffer_st {
    pub buf: *mut u8,
    pub len: usize,
    pub cap: usize,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: [u8; 7usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cbb_buffer_st"][::core::mem::size_of::<cbb_buffer_st>() - 32usize];
    ["Alignment of cbb_buffer_st"][::core::mem::align_of::<cbb_buffer_st>() - 8usize];
    ["Offset of field: cbb_buffer_st::buf"][::core::mem::offset_of!(cbb_buffer_st, buf) - 0usize];
    ["Offset of field: cbb_buffer_st::len"][::core::mem::offset_of!(cbb_buffer_st, len) - 8usize];
    ["Offset of field: cbb_buffer_st::cap"][::core::mem::offset_of!(cbb_buffer_st, cap) - 16usize];
};
impl cbb_buffer_st {
    #[inline]
    pub fn can_resize(&self) -> ::core::ffi::c_uint {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_can_resize(&mut self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn can_resize_raw(this: *const Self) -> ::core::ffi::c_uint {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_can_resize_raw(this: *mut Self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn error(&self) -> ::core::ffi::c_uint {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_error(&mut self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn error_raw(this: *const Self) -> ::core::ffi::c_uint {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_error_raw(this: *mut Self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        can_resize: ::core::ffi::c_uint,
        error: ::core::ffi::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let can_resize: u32 = unsafe { ::core::mem::transmute(can_resize) };
            can_resize as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let error: u32 = unsafe { ::core::mem::transmute(error) };
            error as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cbb_child_st {
    pub base: *mut cbb_buffer_st,
    pub offset: usize,
    pub pending_len_len: u8,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: [u16; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cbb_child_st"][::core::mem::size_of::<cbb_child_st>() - 24usize];
    ["Alignment of cbb_child_st"][::core::mem::align_of::<cbb_child_st>() - 8usize];
    ["Offset of field: cbb_child_st::base"][::core::mem::offset_of!(cbb_child_st, base) - 0usize];
    ["Offset of field: cbb_child_st::offset"]
        [::core::mem::offset_of!(cbb_child_st, offset) - 8usize];
    ["Offset of field: cbb_child_st::pending_len_len"]
        [::core::mem::offset_of!(cbb_child_st, pending_len_len) - 16usize];
};
impl cbb_child_st {
    #[inline]
    pub fn pending_is_asn1(&self) -> ::core::ffi::c_uint {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_pending_is_asn1(&mut self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn pending_is_asn1_raw(this: *const Self) -> ::core::ffi::c_uint {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_pending_is_asn1_raw(this: *mut Self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        pending_is_asn1: ::core::ffi::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let pending_is_asn1: u32 = unsafe { ::core::mem::transmute(pending_is_asn1) };
            pending_is_asn1 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cbb_st {
    pub child: *mut CBB,
    pub is_child: ::core::ffi::c_char,
    pub u: cbb_st__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cbb_st__bindgen_ty_1 {
    pub base: cbb_buffer_st,
    pub child: cbb_child_st,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cbb_st__bindgen_ty_1"][::core::mem::size_of::<cbb_st__bindgen_ty_1>() - 32usize];
    ["Alignment of cbb_st__bindgen_ty_1"][::core::mem::align_of::<cbb_st__bindgen_ty_1>() - 8usize];
    ["Offset of field: cbb_st__bindgen_ty_1::base"]
        [::core::mem::offset_of!(cbb_st__bindgen_ty_1, base) - 0usize];
    ["Offset of field: cbb_st__bindgen_ty_1::child"]
        [::core::mem::offset_of!(cbb_st__bindgen_ty_1, child) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cbb_st"][::core::mem::size_of::<cbb_st>() - 48usize];
    ["Alignment of cbb_st"][::core::mem::align_of::<cbb_st>() - 8usize];
    ["Offset of field: cbb_st::child"][::core::mem::offset_of!(cbb_st, child) - 0usize];
    ["Offset of field: cbb_st::is_child"][::core::mem::offset_of!(cbb_st, is_child) - 8usize];
    ["Offset of field: cbb_st::u"][::core::mem::offset_of!(cbb_st, u) - 16usize];
};
unsafe extern "C" {
    pub fn CBB_zero(cbb: *mut CBB);
}
unsafe extern "C" {
    pub fn CBB_init(cbb: *mut CBB, initial_capacity: usize) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBB_init_fixed(cbb: *mut CBB, buf: *mut u8, len: usize) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBB_cleanup(cbb: *mut CBB);
}
unsafe extern "C" {
    pub fn CBB_finish(
        cbb: *mut CBB,
        out_data: *mut *mut u8,
        out_len: *mut usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBB_flush(cbb: *mut CBB) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBB_data(cbb: *const CBB) -> *mut u8;
}
unsafe extern "C" {
    pub fn CBB_len(cbb: *const CBB) -> usize;
}
unsafe extern "C" {
    pub fn CBB_add_u8_length_prefixed(cbb: *mut CBB, out_contents: *mut CBB) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBB_add_u16_length_prefixed(cbb: *mut CBB, out_contents: *mut CBB)
        -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBB_add_u24_length_prefixed(cbb: *mut CBB, out_contents: *mut CBB)
        -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBB_add_asn1(
        cbb: *mut CBB,
        out_contents: *mut CBB,
        tag: CBS_ASN1_TAG,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBB_add_bytes(cbb: *mut CBB, data: *const u8, len: usize) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBB_add_zeros(cbb: *mut CBB, len: usize) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBB_add_space(cbb: *mut CBB, out_data: *mut *mut u8, len: usize) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBB_reserve(cbb: *mut CBB, out_data: *mut *mut u8, len: usize) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBB_did_write(cbb: *mut CBB, len: usize) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBB_add_u8(cbb: *mut CBB, value: u8) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBB_add_u16(cbb: *mut CBB, value: u16) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBB_add_u16le(cbb: *mut CBB, value: u16) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBB_add_u24(cbb: *mut CBB, value: u32) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBB_add_u32(cbb: *mut CBB, value: u32) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBB_add_u32le(cbb: *mut CBB, value: u32) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBB_add_u64(cbb: *mut CBB, value: u64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBB_add_u64le(cbb: *mut CBB, value: u64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBB_discard(cbb: *mut CBB, len: usize);
}
unsafe extern "C" {
    pub fn CBB_discard_child(cbb: *mut CBB);
}
unsafe extern "C" {
    pub fn CBB_add_asn1_element(
        cbb: *mut CBB,
        tag: CBS_ASN1_TAG,
        data: *const u8,
        data_len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBB_add_asn1_uint64(cbb: *mut CBB, value: u64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBB_add_asn1_uint64_with_tag(
        cbb: *mut CBB,
        value: u64,
        tag: CBS_ASN1_TAG,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBB_add_asn1_int64(cbb: *mut CBB, value: i64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBB_add_asn1_int64_with_tag(
        cbb: *mut CBB,
        value: i64,
        tag: CBS_ASN1_TAG,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBB_add_asn1_octet_string(
        cbb: *mut CBB,
        data: *const u8,
        data_len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBB_add_asn1_bool(cbb: *mut CBB, value: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBB_add_asn1_oid_from_text(
        cbb: *mut CBB,
        text: *const ::core::ffi::c_char,
        len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBB_add_asn1_relative_oid_from_text(
        cbb: *mut CBB,
        text: *const ::core::ffi::c_char,
        len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBB_add_asn1_oid_component(cbb: *mut CBB, value: u64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBB_flush_asn1_set_of(cbb: *mut CBB) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_get_utf8(cbs: *mut CBS, out: *mut u32) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_get_latin1(cbs: *mut CBS, out: *mut u32) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_get_ucs2_be(cbs: *mut CBS, out: *mut u32) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBS_get_utf32_be(cbs: *mut CBS, out: *mut u32) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBB_get_utf8_len(u: u32) -> usize;
}
unsafe extern "C" {
    pub fn CBB_add_utf8(cbb: *mut CBB, u: u32) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBB_add_latin1(cbb: *mut CBB, u: u32) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBB_add_ucs2_be(cbb: *mut CBB, u: u32) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CBB_add_utf32_be(cbb: *mut CBB, u: u32) -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cast_key_st {
    pub data: [u32; 32usize],
    pub short_key: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cast_key_st"][::core::mem::size_of::<cast_key_st>() - 132usize];
    ["Alignment of cast_key_st"][::core::mem::align_of::<cast_key_st>() - 4usize];
    ["Offset of field: cast_key_st::data"][::core::mem::offset_of!(cast_key_st, data) - 0usize];
    ["Offset of field: cast_key_st::short_key"]
        [::core::mem::offset_of!(cast_key_st, short_key) - 128usize];
};
pub type CAST_KEY = cast_key_st;
unsafe extern "C" {
    pub fn CAST_set_key(key: *mut CAST_KEY, len: usize, data: *const u8);
}
unsafe extern "C" {
    pub fn CAST_ecb_encrypt(
        in_: *const u8,
        out: *mut u8,
        key: *const CAST_KEY,
        enc: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn CAST_encrypt(data: *mut u32, key: *const CAST_KEY);
}
unsafe extern "C" {
    pub fn CAST_decrypt(data: *mut u32, key: *const CAST_KEY);
}
unsafe extern "C" {
    pub fn CAST_cbc_encrypt(
        in_: *const u8,
        out: *mut u8,
        length: usize,
        ks: *const CAST_KEY,
        iv: *mut u8,
        enc: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn CAST_cfb64_encrypt(
        in_: *const u8,
        out: *mut u8,
        length: usize,
        schedule: *const CAST_KEY,
        ivec: *mut u8,
        num: *mut ::core::ffi::c_int,
        enc: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn CRYPTO_chacha_20(
        out: *mut u8,
        in_: *const u8,
        in_len: usize,
        key: *const u8,
        nonce: *const u8,
        counter: u32,
    );
}
unsafe extern "C" {
    pub fn EVP_rc4() -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_des_cbc() -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_des_ecb() -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_des_ede() -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_des_ede3() -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_des_ede_cbc() -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_des_ede3_cbc() -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_aes_128_ecb() -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_aes_128_cbc() -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_aes_128_ctr() -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_aes_128_ofb() -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_aes_256_ecb() -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_aes_256_cbc() -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_aes_256_ctr() -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_aes_256_ofb() -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_aes_256_xts() -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_enc_null() -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_rc2_cbc() -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_rc2_40_cbc() -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_get_cipherbynid(nid: ::core::ffi::c_int) -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_CIPHER_CTX_init(ctx: *mut EVP_CIPHER_CTX);
}
unsafe extern "C" {
    pub fn EVP_CIPHER_CTX_new() -> *mut EVP_CIPHER_CTX;
}
unsafe extern "C" {
    pub fn EVP_CIPHER_CTX_cleanup(ctx: *mut EVP_CIPHER_CTX) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_CIPHER_CTX_free(ctx: *mut EVP_CIPHER_CTX);
}
unsafe extern "C" {
    pub fn EVP_CIPHER_CTX_copy(
        out: *mut EVP_CIPHER_CTX,
        in_: *const EVP_CIPHER_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_CIPHER_CTX_reset(ctx: *mut EVP_CIPHER_CTX) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_CipherInit_ex(
        ctx: *mut EVP_CIPHER_CTX,
        cipher: *const EVP_CIPHER,
        engine: *mut ENGINE,
        key: *const u8,
        iv: *const u8,
        enc: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_EncryptInit_ex(
        ctx: *mut EVP_CIPHER_CTX,
        cipher: *const EVP_CIPHER,
        impl_: *mut ENGINE,
        key: *const u8,
        iv: *const u8,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_DecryptInit_ex(
        ctx: *mut EVP_CIPHER_CTX,
        cipher: *const EVP_CIPHER,
        impl_: *mut ENGINE,
        key: *const u8,
        iv: *const u8,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_EncryptUpdate_ex(
        ctx: *mut EVP_CIPHER_CTX,
        out: *mut u8,
        out_len: *mut usize,
        max_out_len: usize,
        in_: *const u8,
        in_len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_EncryptFinal_ex2(
        ctx: *mut EVP_CIPHER_CTX,
        out: *mut u8,
        out_len: *mut usize,
        max_out_len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_DecryptUpdate_ex(
        ctx: *mut EVP_CIPHER_CTX,
        out: *mut u8,
        out_len: *mut usize,
        max_out_len: usize,
        in_: *const u8,
        in_len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_DecryptFinal_ex2(
        ctx: *mut EVP_CIPHER_CTX,
        out: *mut u8,
        out_len: *mut usize,
        max_out_len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_CipherUpdate_ex(
        ctx: *mut EVP_CIPHER_CTX,
        out: *mut u8,
        out_len: *mut usize,
        max_out_len: usize,
        in_: *const u8,
        in_len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_CipherUpdateAAD(
        ctx: *mut EVP_CIPHER_CTX,
        in_: *const u8,
        in_len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_CipherFinal_ex2(
        ctx: *mut EVP_CIPHER_CTX,
        out: *mut u8,
        out_len: *mut usize,
        max_out_len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_CIPHER_CTX_max_next_update(ctx: *const EVP_CIPHER_CTX, in_len: usize) -> usize;
}
unsafe extern "C" {
    pub fn EVP_CIPHER_CTX_max_final(ctx: *const EVP_CIPHER_CTX) -> usize;
}
unsafe extern "C" {
    pub fn EVP_CIPHER_CTX_cipher(ctx: *const EVP_CIPHER_CTX) -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_CIPHER_CTX_nid(ctx: *const EVP_CIPHER_CTX) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_CIPHER_CTX_encrypting(ctx: *const EVP_CIPHER_CTX) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_CIPHER_CTX_block_size(ctx: *const EVP_CIPHER_CTX) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn EVP_CIPHER_CTX_key_length(ctx: *const EVP_CIPHER_CTX) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn EVP_CIPHER_CTX_iv_length(ctx: *const EVP_CIPHER_CTX) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn EVP_CIPHER_CTX_get_app_data(ctx: *const EVP_CIPHER_CTX) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn EVP_CIPHER_CTX_set_app_data(ctx: *mut EVP_CIPHER_CTX, data: *mut ::core::ffi::c_void);
}
unsafe extern "C" {
    pub fn EVP_CIPHER_CTX_flags(ctx: *const EVP_CIPHER_CTX) -> u32;
}
unsafe extern "C" {
    pub fn EVP_CIPHER_CTX_mode(ctx: *const EVP_CIPHER_CTX) -> u32;
}
unsafe extern "C" {
    pub fn EVP_CIPHER_CTX_ctrl(
        ctx: *mut EVP_CIPHER_CTX,
        command: ::core::ffi::c_int,
        arg: ::core::ffi::c_int,
        ptr: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_CIPHER_CTX_set_padding(
        ctx: *mut EVP_CIPHER_CTX,
        pad: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_CIPHER_CTX_set_key_length(
        ctx: *mut EVP_CIPHER_CTX,
        key_len: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_CIPHER_nid(cipher: *const EVP_CIPHER) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_CIPHER_block_size(cipher: *const EVP_CIPHER) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn EVP_CIPHER_key_length(cipher: *const EVP_CIPHER) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn EVP_CIPHER_iv_length(cipher: *const EVP_CIPHER) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn EVP_CIPHER_flags(cipher: *const EVP_CIPHER) -> u32;
}
unsafe extern "C" {
    pub fn EVP_CIPHER_mode(cipher: *const EVP_CIPHER) -> u32;
}
unsafe extern "C" {
    pub fn EVP_BytesToKey(
        type_: *const EVP_CIPHER,
        md: *const EVP_MD,
        salt: *const u8,
        data: *const u8,
        data_len: usize,
        count: ::core::ffi::c_uint,
        key: *mut u8,
        iv: *mut u8,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_CipherInit(
        ctx: *mut EVP_CIPHER_CTX,
        cipher: *const EVP_CIPHER,
        key: *const u8,
        iv: *const u8,
        enc: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_EncryptInit(
        ctx: *mut EVP_CIPHER_CTX,
        cipher: *const EVP_CIPHER,
        key: *const u8,
        iv: *const u8,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_DecryptInit(
        ctx: *mut EVP_CIPHER_CTX,
        cipher: *const EVP_CIPHER,
        key: *const u8,
        iv: *const u8,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_CipherUpdate(
        ctx: *mut EVP_CIPHER_CTX,
        out: *mut u8,
        out_len: *mut ::core::ffi::c_int,
        in_: *const u8,
        in_len: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_EncryptUpdate(
        ctx: *mut EVP_CIPHER_CTX,
        out: *mut u8,
        out_len: *mut ::core::ffi::c_int,
        in_: *const u8,
        in_len: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_DecryptUpdate(
        ctx: *mut EVP_CIPHER_CTX,
        out: *mut u8,
        out_len: *mut ::core::ffi::c_int,
        in_: *const u8,
        in_len: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_CipherFinal(
        ctx: *mut EVP_CIPHER_CTX,
        out: *mut u8,
        out_len: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_CipherFinal_ex(
        ctx: *mut EVP_CIPHER_CTX,
        out: *mut u8,
        out_len: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_EncryptFinal(
        ctx: *mut EVP_CIPHER_CTX,
        out: *mut u8,
        out_len: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_EncryptFinal_ex(
        ctx: *mut EVP_CIPHER_CTX,
        out: *mut u8,
        out_len: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_DecryptFinal(
        ctx: *mut EVP_CIPHER_CTX,
        out: *mut u8,
        out_len: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_DecryptFinal_ex(
        ctx: *mut EVP_CIPHER_CTX,
        out: *mut u8,
        out_len: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_Cipher(
        ctx: *mut EVP_CIPHER_CTX,
        out: *mut u8,
        in_: *const u8,
        in_len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_add_cipher_alias(
        a: *const ::core::ffi::c_char,
        b: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_get_cipherbyname(name: *const ::core::ffi::c_char) -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_aes_128_gcm() -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_aes_256_gcm() -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_aes_192_ecb() -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_aes_192_cbc() -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_aes_192_ctr() -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_aes_192_gcm() -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_aes_192_ofb() -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_des_ede3_ecb() -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_aes_128_cfb128() -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_aes_256_cfb128() -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_aes_128_cfb() -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_aes_192_cfb128() -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_aes_192_cfb() -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_aes_256_cfb() -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_bf_ecb() -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_bf_cbc() -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_bf_cfb() -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_cast5_ecb() -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_cast5_cbc() -> *const EVP_CIPHER;
}
unsafe extern "C" {
    pub fn EVP_CIPHER_CTX_set_flags(ctx: *const EVP_CIPHER_CTX, flags: u32);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_cipher_ctx_st {
    pub cipher: *const EVP_CIPHER,
    pub app_data: *mut ::core::ffi::c_void,
    pub cipher_data: *mut ::core::ffi::c_void,
    pub key_len: ::core::ffi::c_uint,
    pub encrypt: ::core::ffi::c_int,
    pub flags: u32,
    pub oiv: [u8; 16usize],
    pub iv: [u8; 16usize],
    pub buf: [u8; 32usize],
    pub buf_len: ::core::ffi::c_int,
    pub num: ::core::ffi::c_uint,
    pub final_used: ::core::ffi::c_int,
    pub final_: [u8; 32usize],
    pub poisoned: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of evp_cipher_ctx_st"][::core::mem::size_of::<evp_cipher_ctx_st>() - 152usize];
    ["Alignment of evp_cipher_ctx_st"][::core::mem::align_of::<evp_cipher_ctx_st>() - 8usize];
    ["Offset of field: evp_cipher_ctx_st::cipher"]
        [::core::mem::offset_of!(evp_cipher_ctx_st, cipher) - 0usize];
    ["Offset of field: evp_cipher_ctx_st::app_data"]
        [::core::mem::offset_of!(evp_cipher_ctx_st, app_data) - 8usize];
    ["Offset of field: evp_cipher_ctx_st::cipher_data"]
        [::core::mem::offset_of!(evp_cipher_ctx_st, cipher_data) - 16usize];
    ["Offset of field: evp_cipher_ctx_st::key_len"]
        [::core::mem::offset_of!(evp_cipher_ctx_st, key_len) - 24usize];
    ["Offset of field: evp_cipher_ctx_st::encrypt"]
        [::core::mem::offset_of!(evp_cipher_ctx_st, encrypt) - 28usize];
    ["Offset of field: evp_cipher_ctx_st::flags"]
        [::core::mem::offset_of!(evp_cipher_ctx_st, flags) - 32usize];
    ["Offset of field: evp_cipher_ctx_st::oiv"]
        [::core::mem::offset_of!(evp_cipher_ctx_st, oiv) - 36usize];
    ["Offset of field: evp_cipher_ctx_st::iv"]
        [::core::mem::offset_of!(evp_cipher_ctx_st, iv) - 52usize];
    ["Offset of field: evp_cipher_ctx_st::buf"]
        [::core::mem::offset_of!(evp_cipher_ctx_st, buf) - 68usize];
    ["Offset of field: evp_cipher_ctx_st::buf_len"]
        [::core::mem::offset_of!(evp_cipher_ctx_st, buf_len) - 100usize];
    ["Offset of field: evp_cipher_ctx_st::num"]
        [::core::mem::offset_of!(evp_cipher_ctx_st, num) - 104usize];
    ["Offset of field: evp_cipher_ctx_st::final_used"]
        [::core::mem::offset_of!(evp_cipher_ctx_st, final_used) - 108usize];
    ["Offset of field: evp_cipher_ctx_st::final_"]
        [::core::mem::offset_of!(evp_cipher_ctx_st, final_) - 112usize];
    ["Offset of field: evp_cipher_ctx_st::poisoned"]
        [::core::mem::offset_of!(evp_cipher_ctx_st, poisoned) - 144usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_cipher_info_st {
    pub cipher: *const EVP_CIPHER,
    pub iv: [::core::ffi::c_uchar; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of evp_cipher_info_st"][::core::mem::size_of::<evp_cipher_info_st>() - 24usize];
    ["Alignment of evp_cipher_info_st"][::core::mem::align_of::<evp_cipher_info_st>() - 8usize];
    ["Offset of field: evp_cipher_info_st::cipher"]
        [::core::mem::offset_of!(evp_cipher_info_st, cipher) - 0usize];
    ["Offset of field: evp_cipher_info_st::iv"]
        [::core::mem::offset_of!(evp_cipher_info_st, iv) - 8usize];
};
pub type EVP_CIPHER_INFO = evp_cipher_info_st;
unsafe extern "C" {
    pub fn AES_CMAC(
        out: *mut u8,
        key: *const u8,
        key_len: usize,
        in_: *const u8,
        in_len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CMAC_CTX_new() -> *mut CMAC_CTX;
}
unsafe extern "C" {
    pub fn CMAC_CTX_free(ctx: *mut CMAC_CTX);
}
unsafe extern "C" {
    pub fn CMAC_CTX_copy(out: *mut CMAC_CTX, in_: *const CMAC_CTX) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CMAC_Init(
        ctx: *mut CMAC_CTX,
        key: *const ::core::ffi::c_void,
        key_len: usize,
        cipher: *const EVP_CIPHER,
        engine: *mut ENGINE,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CMAC_Reset(ctx: *mut CMAC_CTX) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CMAC_Update(ctx: *mut CMAC_CTX, in_: *const u8, in_len: usize) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CMAC_Final(ctx: *mut CMAC_CTX, out: *mut u8, out_len: *mut usize) -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct conf_value_st {
    pub section: *mut ::core::ffi::c_char,
    pub name: *mut ::core::ffi::c_char,
    pub value: *mut ::core::ffi::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of conf_value_st"][::core::mem::size_of::<conf_value_st>() - 24usize];
    ["Alignment of conf_value_st"][::core::mem::align_of::<conf_value_st>() - 8usize];
    ["Offset of field: conf_value_st::section"]
        [::core::mem::offset_of!(conf_value_st, section) - 0usize];
    ["Offset of field: conf_value_st::name"][::core::mem::offset_of!(conf_value_st, name) - 8usize];
    ["Offset of field: conf_value_st::value"]
        [::core::mem::offset_of!(conf_value_st, value) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_st_CONF_VALUE {
    _unused: [u8; 0],
}
pub type sk_CONF_VALUE_free_func =
    ::core::option::Option<unsafe extern "C" fn(arg1: *mut CONF_VALUE)>;
pub type sk_CONF_VALUE_copy_func =
    ::core::option::Option<unsafe extern "C" fn(arg1: *const CONF_VALUE) -> *mut CONF_VALUE>;
pub type sk_CONF_VALUE_cmp_func = ::core::option::Option<
    unsafe extern "C" fn(
        arg1: *const *const CONF_VALUE,
        arg2: *const *const CONF_VALUE,
    ) -> ::core::ffi::c_int,
>;
pub type sk_CONF_VALUE_delete_if_func = ::core::option::Option<
    unsafe extern "C" fn(
        arg1: *mut CONF_VALUE,
        arg2: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int,
>;
unsafe extern "C" {
    #[link_name = "sk_CONF_VALUE_call_free_func__extern"]
    pub fn sk_CONF_VALUE_call_free_func(
        free_func: OPENSSL_sk_free_func,
        ptr: *mut ::core::ffi::c_void,
    );
}
unsafe extern "C" {
    #[link_name = "sk_CONF_VALUE_call_copy_func__extern"]
    pub fn sk_CONF_VALUE_call_copy_func(
        copy_func: OPENSSL_sk_copy_func,
        ptr: *const ::core::ffi::c_void,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[link_name = "sk_CONF_VALUE_call_cmp_func__extern"]
    pub fn sk_CONF_VALUE_call_cmp_func(
        cmp_func: OPENSSL_sk_cmp_func,
        a: *const ::core::ffi::c_void,
        b: *const ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "sk_CONF_VALUE_call_delete_if_func__extern"]
    pub fn sk_CONF_VALUE_call_delete_if_func(
        func: OPENSSL_sk_delete_if_func,
        obj: *mut ::core::ffi::c_void,
        data: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "sk_CONF_VALUE_new__extern"]
    pub fn sk_CONF_VALUE_new(comp: sk_CONF_VALUE_cmp_func) -> *mut stack_st_CONF_VALUE;
}
unsafe extern "C" {
    #[link_name = "sk_CONF_VALUE_new_null__extern"]
    pub fn sk_CONF_VALUE_new_null() -> *mut stack_st_CONF_VALUE;
}
unsafe extern "C" {
    #[link_name = "sk_CONF_VALUE_num__extern"]
    pub fn sk_CONF_VALUE_num(sk: *const stack_st_CONF_VALUE) -> usize;
}
unsafe extern "C" {
    #[link_name = "sk_CONF_VALUE_zero__extern"]
    pub fn sk_CONF_VALUE_zero(sk: *mut stack_st_CONF_VALUE);
}
unsafe extern "C" {
    #[link_name = "sk_CONF_VALUE_value__extern"]
    pub fn sk_CONF_VALUE_value(sk: *const stack_st_CONF_VALUE, i: usize) -> *mut CONF_VALUE;
}
unsafe extern "C" {
    #[link_name = "sk_CONF_VALUE_set__extern"]
    pub fn sk_CONF_VALUE_set(
        sk: *mut stack_st_CONF_VALUE,
        i: usize,
        p: *mut CONF_VALUE,
    ) -> *mut CONF_VALUE;
}
unsafe extern "C" {
    #[link_name = "sk_CONF_VALUE_free__extern"]
    pub fn sk_CONF_VALUE_free(sk: *mut stack_st_CONF_VALUE);
}
unsafe extern "C" {
    #[link_name = "sk_CONF_VALUE_pop_free__extern"]
    pub fn sk_CONF_VALUE_pop_free(sk: *mut stack_st_CONF_VALUE, free_func: sk_CONF_VALUE_free_func);
}
unsafe extern "C" {
    #[link_name = "sk_CONF_VALUE_insert__extern"]
    pub fn sk_CONF_VALUE_insert(
        sk: *mut stack_st_CONF_VALUE,
        p: *mut CONF_VALUE,
        where_: usize,
    ) -> usize;
}
unsafe extern "C" {
    #[link_name = "sk_CONF_VALUE_delete__extern"]
    pub fn sk_CONF_VALUE_delete(sk: *mut stack_st_CONF_VALUE, where_: usize) -> *mut CONF_VALUE;
}
unsafe extern "C" {
    #[link_name = "sk_CONF_VALUE_delete_ptr__extern"]
    pub fn sk_CONF_VALUE_delete_ptr(
        sk: *mut stack_st_CONF_VALUE,
        p: *const CONF_VALUE,
    ) -> *mut CONF_VALUE;
}
unsafe extern "C" {
    #[link_name = "sk_CONF_VALUE_delete_if__extern"]
    pub fn sk_CONF_VALUE_delete_if(
        sk: *mut stack_st_CONF_VALUE,
        func: sk_CONF_VALUE_delete_if_func,
        data: *mut ::core::ffi::c_void,
    );
}
unsafe extern "C" {
    #[link_name = "sk_CONF_VALUE_find__extern"]
    pub fn sk_CONF_VALUE_find(
        sk: *const stack_st_CONF_VALUE,
        out_index: *mut usize,
        p: *const CONF_VALUE,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "sk_CONF_VALUE_shift__extern"]
    pub fn sk_CONF_VALUE_shift(sk: *mut stack_st_CONF_VALUE) -> *mut CONF_VALUE;
}
unsafe extern "C" {
    #[link_name = "sk_CONF_VALUE_push__extern"]
    pub fn sk_CONF_VALUE_push(sk: *mut stack_st_CONF_VALUE, p: *mut CONF_VALUE) -> usize;
}
unsafe extern "C" {
    #[link_name = "sk_CONF_VALUE_pop__extern"]
    pub fn sk_CONF_VALUE_pop(sk: *mut stack_st_CONF_VALUE) -> *mut CONF_VALUE;
}
unsafe extern "C" {
    #[link_name = "sk_CONF_VALUE_dup__extern"]
    pub fn sk_CONF_VALUE_dup(sk: *const stack_st_CONF_VALUE) -> *mut stack_st_CONF_VALUE;
}
unsafe extern "C" {
    #[link_name = "sk_CONF_VALUE_sort__extern"]
    pub fn sk_CONF_VALUE_sort(sk: *mut stack_st_CONF_VALUE);
}
unsafe extern "C" {
    #[link_name = "sk_CONF_VALUE_sort_and_dedup__extern"]
    pub fn sk_CONF_VALUE_sort_and_dedup(
        sk: *mut stack_st_CONF_VALUE,
        free_func: sk_CONF_VALUE_free_func,
    );
}
unsafe extern "C" {
    #[link_name = "sk_CONF_VALUE_is_sorted__extern"]
    pub fn sk_CONF_VALUE_is_sorted(sk: *const stack_st_CONF_VALUE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "sk_CONF_VALUE_set_cmp_func__extern"]
    pub fn sk_CONF_VALUE_set_cmp_func(
        sk: *mut stack_st_CONF_VALUE,
        comp: sk_CONF_VALUE_cmp_func,
    ) -> sk_CONF_VALUE_cmp_func;
}
unsafe extern "C" {
    #[link_name = "sk_CONF_VALUE_deep_copy__extern"]
    pub fn sk_CONF_VALUE_deep_copy(
        sk: *const stack_st_CONF_VALUE,
        copy_func: sk_CONF_VALUE_copy_func,
        free_func: sk_CONF_VALUE_free_func,
    ) -> *mut stack_st_CONF_VALUE;
}
unsafe extern "C" {
    pub fn NCONF_new(method: *mut ::core::ffi::c_void) -> *mut CONF;
}
unsafe extern "C" {
    pub fn NCONF_free(conf: *mut CONF);
}
unsafe extern "C" {
    pub fn NCONF_load(
        conf: *mut CONF,
        filename: *const ::core::ffi::c_char,
        out_error_line: *mut ::core::ffi::c_long,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn NCONF_load_bio(
        conf: *mut CONF,
        bio: *mut BIO,
        out_error_line: *mut ::core::ffi::c_long,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn NCONF_get_section(
        conf: *const CONF,
        section: *const ::core::ffi::c_char,
    ) -> *const stack_st_CONF_VALUE;
}
unsafe extern "C" {
    pub fn NCONF_get_string(
        conf: *const CONF,
        section: *const ::core::ffi::c_char,
        name: *const ::core::ffi::c_char,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn CONF_modules_load_file(
        filename: *const ::core::ffi::c_char,
        appname: *const ::core::ffi::c_char,
        flags: ::core::ffi::c_ulong,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CONF_modules_unload(all: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn CONF_modules_free();
}
unsafe extern "C" {
    pub fn OPENSSL_config(config_name: *const ::core::ffi::c_char);
}
unsafe extern "C" {
    pub fn OPENSSL_no_config();
}
unsafe extern "C" {
    pub fn SHA224_Init(sha: *mut SHA256_CTX) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn SHA224_Update(
        sha: *mut SHA256_CTX,
        data: *const ::core::ffi::c_void,
        len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn SHA224_Final(out: *mut u8, sha: *mut SHA256_CTX) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn SHA224(data: *const u8, len: usize, out: *mut u8) -> *mut u8;
}
unsafe extern "C" {
    pub fn SHA256_Init(sha: *mut SHA256_CTX) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn SHA256_Update(
        sha: *mut SHA256_CTX,
        data: *const ::core::ffi::c_void,
        len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn SHA256_Final(out: *mut u8, sha: *mut SHA256_CTX) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn SHA256(data: *const u8, len: usize, out: *mut u8) -> *mut u8;
}
unsafe extern "C" {
    pub fn SHA256_Transform(sha: *mut SHA256_CTX, block: *const u8);
}
unsafe extern "C" {
    pub fn SHA256_TransformBlocks(state: *mut u32, data: *const u8, num_blocks: usize);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sha256_state_st {
    pub h: [u32; 8usize],
    pub Nl: u32,
    pub Nh: u32,
    pub data: [u8; 64usize],
    pub num: ::core::ffi::c_uint,
    pub md_len: ::core::ffi::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sha256_state_st"][::core::mem::size_of::<sha256_state_st>() - 112usize];
    ["Alignment of sha256_state_st"][::core::mem::align_of::<sha256_state_st>() - 4usize];
    ["Offset of field: sha256_state_st::h"][::core::mem::offset_of!(sha256_state_st, h) - 0usize];
    ["Offset of field: sha256_state_st::Nl"]
        [::core::mem::offset_of!(sha256_state_st, Nl) - 32usize];
    ["Offset of field: sha256_state_st::Nh"]
        [::core::mem::offset_of!(sha256_state_st, Nh) - 36usize];
    ["Offset of field: sha256_state_st::data"]
        [::core::mem::offset_of!(sha256_state_st, data) - 40usize];
    ["Offset of field: sha256_state_st::num"]
        [::core::mem::offset_of!(sha256_state_st, num) - 104usize];
    ["Offset of field: sha256_state_st::md_len"]
        [::core::mem::offset_of!(sha256_state_st, md_len) - 108usize];
};
unsafe extern "C" {
    pub fn SHA384_Init(sha: *mut SHA512_CTX) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn SHA384_Update(
        sha: *mut SHA512_CTX,
        data: *const ::core::ffi::c_void,
        len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn SHA384_Final(out: *mut u8, sha: *mut SHA512_CTX) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn SHA384(data: *const u8, len: usize, out: *mut u8) -> *mut u8;
}
unsafe extern "C" {
    pub fn SHA512_Init(sha: *mut SHA512_CTX) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn SHA512_Update(
        sha: *mut SHA512_CTX,
        data: *const ::core::ffi::c_void,
        len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn SHA512_Final(out: *mut u8, sha: *mut SHA512_CTX) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn SHA512(data: *const u8, len: usize, out: *mut u8) -> *mut u8;
}
unsafe extern "C" {
    pub fn SHA512_Transform(sha: *mut SHA512_CTX, block: *const u8);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sha512_state_st {
    pub h: [u64; 8usize],
    pub num: u16,
    pub md_len: u16,
    pub bytes_so_far_high: u32,
    pub bytes_so_far_low: u64,
    pub p: [u8; 128usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sha512_state_st"][::core::mem::size_of::<sha512_state_st>() - 208usize];
    ["Alignment of sha512_state_st"][::core::mem::align_of::<sha512_state_st>() - 8usize];
    ["Offset of field: sha512_state_st::h"][::core::mem::offset_of!(sha512_state_st, h) - 0usize];
    ["Offset of field: sha512_state_st::num"]
        [::core::mem::offset_of!(sha512_state_st, num) - 64usize];
    ["Offset of field: sha512_state_st::md_len"]
        [::core::mem::offset_of!(sha512_state_st, md_len) - 66usize];
    ["Offset of field: sha512_state_st::bytes_so_far_high"]
        [::core::mem::offset_of!(sha512_state_st, bytes_so_far_high) - 68usize];
    ["Offset of field: sha512_state_st::bytes_so_far_low"]
        [::core::mem::offset_of!(sha512_state_st, bytes_so_far_low) - 72usize];
    ["Offset of field: sha512_state_st::p"][::core::mem::offset_of!(sha512_state_st, p) - 80usize];
};
unsafe extern "C" {
    pub fn SHA512_256_Init(sha: *mut SHA512_CTX) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn SHA512_256_Update(
        sha: *mut SHA512_CTX,
        data: *const ::core::ffi::c_void,
        len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn SHA512_256_Final(out: *mut u8, sha: *mut SHA512_CTX) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn SHA512_256(data: *const u8, len: usize, out: *mut u8) -> *mut u8;
}
unsafe extern "C" {
    pub fn SHA512_224_Init(sha: *mut SHA512_CTX) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn SHA512_224_Update(
        sha: *mut SHA512_CTX,
        data: *const ::core::ffi::c_void,
        len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn SHA512_224_Final(out: *mut u8, sha: *mut SHA512_CTX) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn SHA512_224(data: *const u8, len: usize, out: *mut u8) -> *mut u8;
}
unsafe extern "C" {
    pub fn SHA1_Init(sha: *mut SHA_CTX) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn SHA1_Update(
        sha: *mut SHA_CTX,
        data: *const ::core::ffi::c_void,
        len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn SHA1_Final(out: *mut u8, sha: *mut SHA_CTX) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn SHA1(data: *const u8, len: usize, out: *mut u8) -> *mut u8;
}
unsafe extern "C" {
    pub fn SHA1_Transform(sha: *mut SHA_CTX, block: *const u8);
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sha_state_st {
    pub __bindgen_anon_1: sha_state_st__bindgen_ty_1,
    pub Nl: u32,
    pub Nh: u32,
    pub data: [u8; 64usize],
    pub num: ::core::ffi::c_uint,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union sha_state_st__bindgen_ty_1 {
    pub h: [u32; 5usize],
    pub __bindgen_anon_1: sha_state_st__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sha_state_st__bindgen_ty_1__bindgen_ty_1 {
    pub h0: u32,
    pub h1: u32,
    pub h2: u32,
    pub h3: u32,
    pub h4: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sha_state_st__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<sha_state_st__bindgen_ty_1__bindgen_ty_1>() - 20usize];
    ["Alignment of sha_state_st__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<sha_state_st__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Offset of field: sha_state_st__bindgen_ty_1__bindgen_ty_1::h0"]
        [::core::mem::offset_of!(sha_state_st__bindgen_ty_1__bindgen_ty_1, h0) - 0usize];
    ["Offset of field: sha_state_st__bindgen_ty_1__bindgen_ty_1::h1"]
        [::core::mem::offset_of!(sha_state_st__bindgen_ty_1__bindgen_ty_1, h1) - 4usize];
    ["Offset of field: sha_state_st__bindgen_ty_1__bindgen_ty_1::h2"]
        [::core::mem::offset_of!(sha_state_st__bindgen_ty_1__bindgen_ty_1, h2) - 8usize];
    ["Offset of field: sha_state_st__bindgen_ty_1__bindgen_ty_1::h3"]
        [::core::mem::offset_of!(sha_state_st__bindgen_ty_1__bindgen_ty_1, h3) - 12usize];
    ["Offset of field: sha_state_st__bindgen_ty_1__bindgen_ty_1::h4"]
        [::core::mem::offset_of!(sha_state_st__bindgen_ty_1__bindgen_ty_1, h4) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sha_state_st__bindgen_ty_1"]
        [::core::mem::size_of::<sha_state_st__bindgen_ty_1>() - 20usize];
    ["Alignment of sha_state_st__bindgen_ty_1"]
        [::core::mem::align_of::<sha_state_st__bindgen_ty_1>() - 4usize];
    ["Offset of field: sha_state_st__bindgen_ty_1::h"]
        [::core::mem::offset_of!(sha_state_st__bindgen_ty_1, h) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sha_state_st"][::core::mem::size_of::<sha_state_st>() - 96usize];
    ["Alignment of sha_state_st"][::core::mem::align_of::<sha_state_st>() - 4usize];
    ["Offset of field: sha_state_st::Nl"][::core::mem::offset_of!(sha_state_st, Nl) - 20usize];
    ["Offset of field: sha_state_st::Nh"][::core::mem::offset_of!(sha_state_st, Nh) - 24usize];
    ["Offset of field: sha_state_st::data"][::core::mem::offset_of!(sha_state_st, data) - 28usize];
    ["Offset of field: sha_state_st::num"][::core::mem::offset_of!(sha_state_st, num) - 92usize];
};
unsafe extern "C" {
    pub fn CRYPTO_fips_186_2_prf(out: *mut u8, out_len: usize, xkey: *const u8);
}
unsafe extern "C" {
    pub fn OPENSSL_malloc(size: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn OPENSSL_zalloc(size: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn OPENSSL_calloc(num: usize, size: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn OPENSSL_realloc(
        ptr: *mut ::core::ffi::c_void,
        new_size: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn OPENSSL_free(ptr: *mut ::core::ffi::c_void);
}
unsafe extern "C" {
    pub fn OPENSSL_cleanse(ptr: *mut ::core::ffi::c_void, len: usize);
}
unsafe extern "C" {
    pub fn CRYPTO_memcmp(
        a: *const ::core::ffi::c_void,
        b: *const ::core::ffi::c_void,
        len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn OPENSSL_hash32(ptr: *const ::core::ffi::c_void, len: usize) -> u32;
}
unsafe extern "C" {
    pub fn OPENSSL_strhash(s: *const ::core::ffi::c_char) -> u32;
}
unsafe extern "C" {
    pub fn OPENSSL_strdup(s: *const ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn OPENSSL_strnlen(s: *const ::core::ffi::c_char, len: usize) -> usize;
}
unsafe extern "C" {
    pub fn OPENSSL_isalpha(c: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn OPENSSL_isdigit(c: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn OPENSSL_isxdigit(c: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn OPENSSL_fromxdigit(out: *mut u8, c: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn OPENSSL_isalnum(c: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn OPENSSL_tolower(c: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn OPENSSL_isspace(c: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn OPENSSL_strcasecmp(
        a: *const ::core::ffi::c_char,
        b: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn OPENSSL_strncasecmp(
        a: *const ::core::ffi::c_char,
        b: *const ::core::ffi::c_char,
        n: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_snprintf(
        buf: *mut ::core::ffi::c_char,
        n: usize,
        format: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BIO_vsnprintf(
        buf: *mut ::core::ffi::c_char,
        n: usize,
        format: *const ::core::ffi::c_char,
        args: *mut __va_list_tag,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn OPENSSL_vasprintf(
        str_: *mut *mut ::core::ffi::c_char,
        format: *const ::core::ffi::c_char,
        args: *mut __va_list_tag,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn OPENSSL_asprintf(
        str_: *mut *mut ::core::ffi::c_char,
        format: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn OPENSSL_strndup(
        str_: *const ::core::ffi::c_char,
        size: usize,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn OPENSSL_memdup(
        data: *const ::core::ffi::c_void,
        size: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn OPENSSL_strlcpy(
        dst: *mut ::core::ffi::c_char,
        src: *const ::core::ffi::c_char,
        dst_size: usize,
    ) -> usize;
}
unsafe extern "C" {
    pub fn OPENSSL_strlcat(
        dst: *mut ::core::ffi::c_char,
        src: *const ::core::ffi::c_char,
        dst_size: usize,
    ) -> usize;
}
unsafe extern "C" {
    pub fn CRYPTO_malloc(
        size: usize,
        file: *const ::core::ffi::c_char,
        line: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn CRYPTO_realloc(
        ptr: *mut ::core::ffi::c_void,
        new_size: usize,
        file: *const ::core::ffi::c_char,
        line: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn CRYPTO_free(
        ptr: *mut ::core::ffi::c_void,
        file: *const ::core::ffi::c_char,
        line: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn OPENSSL_clear_free(ptr: *mut ::core::ffi::c_void, len: usize);
}
unsafe extern "C" {
    pub fn CRYPTO_secure_malloc_init(size: usize, min_size: usize) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CRYPTO_secure_malloc_initialized() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CRYPTO_secure_used() -> usize;
}
unsafe extern "C" {
    pub fn OPENSSL_secure_malloc(size: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn OPENSSL_secure_clear_free(ptr: *mut ::core::ffi::c_void, len: usize);
}
unsafe extern "C" {
    pub fn CRYPTO_num_locks() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CRYPTO_set_locking_callback(
        func: ::core::option::Option<
            unsafe extern "C" fn(
                mode: ::core::ffi::c_int,
                lock_num: ::core::ffi::c_int,
                file: *const ::core::ffi::c_char,
                line: ::core::ffi::c_int,
            ),
        >,
    );
}
unsafe extern "C" {
    pub fn CRYPTO_set_add_lock_callback(
        func: ::core::option::Option<
            unsafe extern "C" fn(
                num: *mut ::core::ffi::c_int,
                amount: ::core::ffi::c_int,
                lock_num: ::core::ffi::c_int,
                file: *const ::core::ffi::c_char,
                line: ::core::ffi::c_int,
            ) -> ::core::ffi::c_int,
        >,
    );
}
unsafe extern "C" {
    pub fn CRYPTO_get_locking_callback() -> ::core::option::Option<
        unsafe extern "C" fn(
            arg1: ::core::ffi::c_int,
            arg2: ::core::ffi::c_int,
            arg3: *const ::core::ffi::c_char,
            arg4: ::core::ffi::c_int,
        ),
    >;
}
unsafe extern "C" {
    pub fn CRYPTO_get_lock_name(lock_num: ::core::ffi::c_int) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn CRYPTO_THREADID_set_callback(
        threadid_func: ::core::option::Option<unsafe extern "C" fn(threadid: *mut CRYPTO_THREADID)>,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CRYPTO_THREADID_set_numeric(id: *mut CRYPTO_THREADID, val: ::core::ffi::c_ulong);
}
unsafe extern "C" {
    pub fn CRYPTO_THREADID_set_pointer(id: *mut CRYPTO_THREADID, ptr: *mut ::core::ffi::c_void);
}
unsafe extern "C" {
    pub fn CRYPTO_THREADID_current(id: *mut CRYPTO_THREADID);
}
unsafe extern "C" {
    pub fn CRYPTO_set_id_callback(
        func: ::core::option::Option<unsafe extern "C" fn() -> ::core::ffi::c_ulong>,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CRYPTO_dynlock {
    pub references: ::core::ffi::c_int,
    pub data: *mut CRYPTO_dynlock_value,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CRYPTO_dynlock"][::core::mem::size_of::<CRYPTO_dynlock>() - 16usize];
    ["Alignment of CRYPTO_dynlock"][::core::mem::align_of::<CRYPTO_dynlock>() - 8usize];
    ["Offset of field: CRYPTO_dynlock::references"]
        [::core::mem::offset_of!(CRYPTO_dynlock, references) - 0usize];
    ["Offset of field: CRYPTO_dynlock::data"]
        [::core::mem::offset_of!(CRYPTO_dynlock, data) - 8usize];
};
unsafe extern "C" {
    pub fn CRYPTO_set_dynlock_create_callback(
        dyn_create_function: ::core::option::Option<
            unsafe extern "C" fn(
                file: *const ::core::ffi::c_char,
                line: ::core::ffi::c_int,
            ) -> *mut CRYPTO_dynlock_value,
        >,
    );
}
unsafe extern "C" {
    pub fn CRYPTO_set_dynlock_lock_callback(
        dyn_lock_function: ::core::option::Option<
            unsafe extern "C" fn(
                mode: ::core::ffi::c_int,
                l: *mut CRYPTO_dynlock_value,
                file: *const ::core::ffi::c_char,
                line: ::core::ffi::c_int,
            ),
        >,
    );
}
unsafe extern "C" {
    pub fn CRYPTO_set_dynlock_destroy_callback(
        dyn_destroy_function: ::core::option::Option<
            unsafe extern "C" fn(
                l: *mut CRYPTO_dynlock_value,
                file: *const ::core::ffi::c_char,
                line: ::core::ffi::c_int,
            ),
        >,
    );
}
unsafe extern "C" {
    pub fn CRYPTO_get_dynlock_create_callback() -> ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *const ::core::ffi::c_char,
            arg2: ::core::ffi::c_int,
        ) -> *mut CRYPTO_dynlock_value,
    >;
}
unsafe extern "C" {
    pub fn CRYPTO_get_dynlock_lock_callback() -> ::core::option::Option<
        unsafe extern "C" fn(
            arg1: ::core::ffi::c_int,
            arg2: *mut CRYPTO_dynlock_value,
            arg3: *const ::core::ffi::c_char,
            arg4: ::core::ffi::c_int,
        ),
    >;
}
unsafe extern "C" {
    pub fn CRYPTO_get_dynlock_destroy_callback() -> ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut CRYPTO_dynlock_value,
            arg2: *const ::core::ffi::c_char,
            arg3: ::core::ffi::c_int,
        ),
    >;
}
unsafe extern "C" {
    pub fn CRYPTO_is_confidential_build() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CRYPTO_has_asm() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BORINGSSL_self_test() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BORINGSSL_self_test_all() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn BORINGSSL_integrity_test() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CRYPTO_pre_sandbox_init();
}
unsafe extern "C" {
    pub fn FIPS_mode() -> ::core::ffi::c_int;
}
pub const fips_counter_t_fips_counter_evp_aes_128_gcm: fips_counter_t = 0;
pub const fips_counter_t_fips_counter_evp_aes_256_gcm: fips_counter_t = 1;
pub const fips_counter_t_fips_counter_evp_aes_128_ctr: fips_counter_t = 2;
pub const fips_counter_t_fips_counter_evp_aes_256_ctr: fips_counter_t = 3;
pub const fips_counter_t_fips_counter_max: fips_counter_t = 3;
pub type fips_counter_t = ::core::ffi::c_uint;
unsafe extern "C" {
    pub fn FIPS_read_counter(counter: fips_counter_t) -> usize;
}
unsafe extern "C" {
    pub fn OpenSSL_version(which: ::core::ffi::c_int) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn SSLeay_version(which: ::core::ffi::c_int) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn SSLeay() -> ::core::ffi::c_ulong;
}
unsafe extern "C" {
    pub fn OpenSSL_version_num() -> ::core::ffi::c_ulong;
}
unsafe extern "C" {
    pub fn CRYPTO_malloc_init() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn OPENSSL_malloc_init() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ENGINE_load_builtin_engines();
}
unsafe extern "C" {
    pub fn ENGINE_register_all_complete() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ENGINE_cleanup();
}
unsafe extern "C" {
    pub fn OPENSSL_load_builtin_modules();
}
unsafe extern "C" {
    pub fn OPENSSL_init_crypto(
        opts: u64,
        settings: *const OPENSSL_INIT_SETTINGS,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn OPENSSL_cleanup();
}
unsafe extern "C" {
    pub fn FIPS_mode_set(on: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn FIPS_module_name() -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn FIPS_module_hash() -> *const u8;
}
unsafe extern "C" {
    pub fn FIPS_version() -> u32;
}
unsafe extern "C" {
    pub fn FIPS_query_algorithm_status(algorithm: *const ::core::ffi::c_char)
        -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CRYPTO_library_init();
}
unsafe extern "C" {
    pub fn CTR_DRBG_new(
        entropy: *const u8,
        personalization: *const u8,
        personalization_len: usize,
    ) -> *mut CTR_DRBG_STATE;
}
unsafe extern "C" {
    pub fn CTR_DRBG_new_df(
        entropy: *const u8,
        entropy_len: usize,
        nonce: *const u8,
        personalization: *const u8,
        personalization_len: usize,
    ) -> *mut CTR_DRBG_STATE;
}
unsafe extern "C" {
    pub fn CTR_DRBG_free(state: *mut CTR_DRBG_STATE);
}
unsafe extern "C" {
    pub fn CTR_DRBG_reseed(
        drbg: *mut CTR_DRBG_STATE,
        entropy: *const u8,
        additional_data: *const u8,
        additional_data_len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CTR_DRBG_reseed_ex(
        drbg: *mut CTR_DRBG_STATE,
        entropy: *const u8,
        entropy_len: usize,
        additional_data: *const u8,
        additional_data_len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CTR_DRBG_generate(
        drbg: *mut CTR_DRBG_STATE,
        out: *mut u8,
        out_len: usize,
        additional_data: *const u8,
        additional_data_len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CTR_DRBG_clear(drbg: *mut CTR_DRBG_STATE);
}
unsafe extern "C" {
    pub fn X25519_keypair(out_public_value: *mut u8, out_private_key: *mut u8);
}
unsafe extern "C" {
    pub fn X25519(
        out_shared_key: *mut u8,
        private_key: *const u8,
        peer_public_value: *const u8,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn X25519_public_from_private(out_public_value: *mut u8, private_key: *const u8);
}
unsafe extern "C" {
    pub fn ED25519_keypair(out_public_key: *mut u8, out_private_key: *mut u8);
}
unsafe extern "C" {
    pub fn ED25519_sign(
        out_sig: *mut u8,
        message: *const u8,
        message_len: usize,
        private_key: *const u8,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ED25519_verify(
        message: *const u8,
        message_len: usize,
        signature: *const u8,
        public_key: *const u8,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ED25519_keypair_from_seed(
        out_public_key: *mut u8,
        out_private_key: *mut u8,
        seed: *const u8,
    );
}
pub const spake2_role_t_spake2_role_alice: spake2_role_t = 0;
pub const spake2_role_t_spake2_role_bob: spake2_role_t = 1;
pub type spake2_role_t = ::core::ffi::c_uint;
unsafe extern "C" {
    pub fn SPAKE2_CTX_new(
        my_role: spake2_role_t,
        my_name: *const u8,
        my_name_len: usize,
        their_name: *const u8,
        their_name_len: usize,
    ) -> *mut SPAKE2_CTX;
}
unsafe extern "C" {
    pub fn SPAKE2_CTX_free(ctx: *mut SPAKE2_CTX);
}
unsafe extern "C" {
    pub fn SPAKE2_generate_msg(
        ctx: *mut SPAKE2_CTX,
        out: *mut u8,
        out_len: *mut usize,
        max_out_len: usize,
        password: *const u8,
        password_len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn SPAKE2_process_msg(
        ctx: *mut SPAKE2_CTX,
        out_key: *mut u8,
        out_key_len: *mut usize,
        max_out_key_len: usize,
        their_msg: *const u8,
        their_msg_len: usize,
    ) -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DES_cblock_st {
    pub bytes: [u8; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DES_cblock_st"][::core::mem::size_of::<DES_cblock_st>() - 8usize];
    ["Alignment of DES_cblock_st"][::core::mem::align_of::<DES_cblock_st>() - 1usize];
    ["Offset of field: DES_cblock_st::bytes"]
        [::core::mem::offset_of!(DES_cblock_st, bytes) - 0usize];
};
pub type DES_cblock = DES_cblock_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DES_ks {
    pub subkeys: [[u32; 2usize]; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DES_ks"][::core::mem::size_of::<DES_ks>() - 128usize];
    ["Alignment of DES_ks"][::core::mem::align_of::<DES_ks>() - 4usize];
    ["Offset of field: DES_ks::subkeys"][::core::mem::offset_of!(DES_ks, subkeys) - 0usize];
};
pub type DES_key_schedule = DES_ks;
unsafe extern "C" {
    pub fn DES_set_key(key: *const DES_cblock, schedule: *mut DES_key_schedule);
}
unsafe extern "C" {
    pub fn DES_set_odd_parity(key: *mut DES_cblock);
}
unsafe extern "C" {
    pub fn DES_ecb_encrypt(
        in_: *const DES_cblock,
        out: *mut DES_cblock,
        schedule: *const DES_key_schedule,
        is_encrypt: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn DES_ncbc_encrypt(
        in_: *const u8,
        out: *mut u8,
        len: usize,
        schedule: *const DES_key_schedule,
        ivec: *mut DES_cblock,
        enc: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn DES_ecb3_encrypt(
        input: *const DES_cblock,
        output: *mut DES_cblock,
        ks1: *const DES_key_schedule,
        ks2: *const DES_key_schedule,
        ks3: *const DES_key_schedule,
        enc: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn DES_ede3_cbc_encrypt(
        in_: *const u8,
        out: *mut u8,
        len: usize,
        ks1: *const DES_key_schedule,
        ks2: *const DES_key_schedule,
        ks3: *const DES_key_schedule,
        ivec: *mut DES_cblock,
        enc: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn DES_ede2_cbc_encrypt(
        in_: *const u8,
        out: *mut u8,
        len: usize,
        ks1: *const DES_key_schedule,
        ks2: *const DES_key_schedule,
        ivec: *mut DES_cblock,
        enc: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn DES_set_key_unchecked(key: *const DES_cblock, schedule: *mut DES_key_schedule);
}
unsafe extern "C" {
    pub fn DES_ede3_cfb64_encrypt(
        in_: *const u8,
        out: *mut u8,
        length: ::core::ffi::c_long,
        ks1: *mut DES_key_schedule,
        ks2: *mut DES_key_schedule,
        ks3: *mut DES_key_schedule,
        ivec: *mut DES_cblock,
        num: *mut ::core::ffi::c_int,
        enc: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn DES_ede3_cfb_encrypt(
        in_: *const u8,
        out: *mut u8,
        numbits: ::core::ffi::c_int,
        length: ::core::ffi::c_long,
        ks1: *mut DES_key_schedule,
        ks2: *mut DES_key_schedule,
        ks3: *mut DES_key_schedule,
        ivec: *mut DES_cblock,
        enc: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn DH_new() -> *mut DH;
}
unsafe extern "C" {
    pub fn DH_free(dh: *mut DH);
}
unsafe extern "C" {
    pub fn DH_up_ref(dh: *mut DH) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn DH_bits(dh: *const DH) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn DH_size(dh: *const DH) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn DH_get0_pub_key(dh: *const DH) -> *const BIGNUM;
}
unsafe extern "C" {
    pub fn DH_get0_priv_key(dh: *const DH) -> *const BIGNUM;
}
unsafe extern "C" {
    pub fn DH_get0_p(dh: *const DH) -> *const BIGNUM;
}
unsafe extern "C" {
    pub fn DH_get0_q(dh: *const DH) -> *const BIGNUM;
}
unsafe extern "C" {
    pub fn DH_get0_g(dh: *const DH) -> *const BIGNUM;
}
unsafe extern "C" {
    pub fn DH_get0_key(
        dh: *const DH,
        out_pub_key: *mut *const BIGNUM,
        out_priv_key: *mut *const BIGNUM,
    );
}
unsafe extern "C" {
    pub fn DH_set0_key(
        dh: *mut DH,
        pub_key: *mut BIGNUM,
        priv_key: *mut BIGNUM,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn DH_get0_pqg(
        dh: *const DH,
        out_p: *mut *const BIGNUM,
        out_q: *mut *const BIGNUM,
        out_g: *mut *const BIGNUM,
    );
}
unsafe extern "C" {
    pub fn DH_set0_pqg(
        dh: *mut DH,
        p: *mut BIGNUM,
        q: *mut BIGNUM,
        g: *mut BIGNUM,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn DH_set_length(dh: *mut DH, priv_length: ::core::ffi::c_uint) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn DH_get_rfc7919_2048() -> *mut DH;
}
unsafe extern "C" {
    pub fn BN_get_rfc3526_prime_1536(ret: *mut BIGNUM) -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn BN_get_rfc3526_prime_2048(ret: *mut BIGNUM) -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn BN_get_rfc3526_prime_3072(ret: *mut BIGNUM) -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn BN_get_rfc3526_prime_4096(ret: *mut BIGNUM) -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn BN_get_rfc3526_prime_6144(ret: *mut BIGNUM) -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn BN_get_rfc3526_prime_8192(ret: *mut BIGNUM) -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn DH_generate_parameters_ex(
        dh: *mut DH,
        prime_bits: ::core::ffi::c_int,
        generator: ::core::ffi::c_int,
        cb: *mut BN_GENCB,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn DH_generate_key(dh: *mut DH) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn DH_compute_key_padded(
        out: *mut u8,
        peers_key: *const BIGNUM,
        dh: *mut DH,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn DH_compute_key_hashed(
        dh: *mut DH,
        out: *mut u8,
        out_len: *mut usize,
        max_out_len: usize,
        peers_key: *const BIGNUM,
        digest: *const EVP_MD,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn DH_check(dh: *const DH, out_flags: *mut ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn DH_check_pub_key(
        dh: *const DH,
        pub_key: *const BIGNUM,
        out_flags: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn DHparams_dup(dh: *const DH) -> *mut DH;
}
unsafe extern "C" {
    pub fn DH_parse_parameters(cbs: *mut CBS) -> *mut DH;
}
unsafe extern "C" {
    pub fn DH_marshal_parameters(cbb: *mut CBB, dh: *const DH) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn DH_generate_parameters(
        prime_len: ::core::ffi::c_int,
        generator: ::core::ffi::c_int,
        callback: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: ::core::ffi::c_int,
                arg2: ::core::ffi::c_int,
                arg3: *mut ::core::ffi::c_void,
            ),
        >,
        cb_arg: *mut ::core::ffi::c_void,
    ) -> *mut DH;
}
unsafe extern "C" {
    pub fn d2i_DHparams(
        ret: *mut *mut DH,
        inp: *mut *const ::core::ffi::c_uchar,
        len: ::core::ffi::c_long,
    ) -> *mut DH;
}
unsafe extern "C" {
    pub fn i2d_DHparams(in_: *const DH, outp: *mut *mut ::core::ffi::c_uchar)
        -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn DH_compute_key(
        out: *mut u8,
        peers_key: *const BIGNUM,
        dh: *mut DH,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_md4() -> *const EVP_MD;
}
unsafe extern "C" {
    pub fn EVP_md5() -> *const EVP_MD;
}
unsafe extern "C" {
    pub fn EVP_sha1() -> *const EVP_MD;
}
unsafe extern "C" {
    pub fn EVP_sha224() -> *const EVP_MD;
}
unsafe extern "C" {
    pub fn EVP_sha256() -> *const EVP_MD;
}
unsafe extern "C" {
    pub fn EVP_sha384() -> *const EVP_MD;
}
unsafe extern "C" {
    pub fn EVP_sha512() -> *const EVP_MD;
}
unsafe extern "C" {
    pub fn EVP_sha512_224() -> *const EVP_MD;
}
unsafe extern "C" {
    pub fn EVP_sha512_256() -> *const EVP_MD;
}
unsafe extern "C" {
    pub fn EVP_sha3_224() -> *const EVP_MD;
}
unsafe extern "C" {
    pub fn EVP_sha3_256() -> *const EVP_MD;
}
unsafe extern "C" {
    pub fn EVP_sha3_384() -> *const EVP_MD;
}
unsafe extern "C" {
    pub fn EVP_sha3_512() -> *const EVP_MD;
}
unsafe extern "C" {
    pub fn EVP_blake2b256() -> *const EVP_MD;
}
unsafe extern "C" {
    pub fn EVP_blake2b512() -> *const EVP_MD;
}
unsafe extern "C" {
    pub fn EVP_md5_sha1() -> *const EVP_MD;
}
unsafe extern "C" {
    pub fn EVP_ripemd160() -> *const EVP_MD;
}
unsafe extern "C" {
    pub fn EVP_get_digestbynid(nid: ::core::ffi::c_int) -> *const EVP_MD;
}
unsafe extern "C" {
    pub fn EVP_get_digestbyobj(obj: *const ASN1_OBJECT) -> *const EVP_MD;
}
unsafe extern "C" {
    pub fn EVP_MD_CTX_init(ctx: *mut EVP_MD_CTX);
}
unsafe extern "C" {
    pub fn EVP_MD_CTX_new() -> *mut EVP_MD_CTX;
}
unsafe extern "C" {
    pub fn EVP_MD_CTX_cleanup(ctx: *mut EVP_MD_CTX) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_MD_CTX_cleanse(ctx: *mut EVP_MD_CTX);
}
unsafe extern "C" {
    pub fn EVP_MD_CTX_free(ctx: *mut EVP_MD_CTX);
}
unsafe extern "C" {
    pub fn EVP_MD_CTX_copy_ex(out: *mut EVP_MD_CTX, in_: *const EVP_MD_CTX) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_MD_CTX_move(out: *mut EVP_MD_CTX, in_: *mut EVP_MD_CTX);
}
unsafe extern "C" {
    pub fn EVP_MD_CTX_reset(ctx: *mut EVP_MD_CTX) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_DigestInit_ex(
        ctx: *mut EVP_MD_CTX,
        type_: *const EVP_MD,
        engine: *mut ENGINE,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_DigestUpdate(
        ctx: *mut EVP_MD_CTX,
        data: *const ::core::ffi::c_void,
        len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_DigestFinal_ex(
        ctx: *mut EVP_MD_CTX,
        md_out: *mut u8,
        out_size: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_DigestFinal(
        ctx: *mut EVP_MD_CTX,
        md_out: *mut u8,
        out_size: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_Digest(
        data: *const ::core::ffi::c_void,
        len: usize,
        md_out: *mut u8,
        md_out_size: *mut ::core::ffi::c_uint,
        type_: *const EVP_MD,
        impl_: *mut ENGINE,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_MD_type(md: *const EVP_MD) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_MD_flags(md: *const EVP_MD) -> u32;
}
unsafe extern "C" {
    pub fn EVP_MD_size(md: *const EVP_MD) -> usize;
}
unsafe extern "C" {
    pub fn EVP_MD_block_size(md: *const EVP_MD) -> usize;
}
unsafe extern "C" {
    pub fn EVP_MD_CTX_get0_md(ctx: *const EVP_MD_CTX) -> *const EVP_MD;
}
unsafe extern "C" {
    pub fn EVP_MD_CTX_md(ctx: *const EVP_MD_CTX) -> *const EVP_MD;
}
unsafe extern "C" {
    pub fn EVP_MD_CTX_size(ctx: *const EVP_MD_CTX) -> usize;
}
unsafe extern "C" {
    pub fn EVP_MD_CTX_block_size(ctx: *const EVP_MD_CTX) -> usize;
}
unsafe extern "C" {
    pub fn EVP_MD_CTX_type(ctx: *const EVP_MD_CTX) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_MD_CTX_pkey_ctx(ctx: *const EVP_MD_CTX) -> *mut EVP_PKEY_CTX;
}
unsafe extern "C" {
    pub fn EVP_parse_digest_algorithm(cbs: *mut CBS) -> *const EVP_MD;
}
unsafe extern "C" {
    pub fn EVP_parse_digest_algorithm_nid(cbs: *mut CBS) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_marshal_digest_algorithm(cbb: *mut CBB, md: *const EVP_MD) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_marshal_digest_algorithm_no_params(
        cbb: *mut CBB,
        md: *const EVP_MD,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_DigestInit(ctx: *mut EVP_MD_CTX, type_: *const EVP_MD) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_MD_CTX_copy(out: *mut EVP_MD_CTX, in_: *const EVP_MD_CTX) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_add_digest(digest: *const EVP_MD) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_get_digestbyname(name: *const ::core::ffi::c_char) -> *const EVP_MD;
}
unsafe extern "C" {
    pub fn EVP_dss1() -> *const EVP_MD;
}
unsafe extern "C" {
    pub fn EVP_MD_CTX_create() -> *mut EVP_MD_CTX;
}
unsafe extern "C" {
    pub fn EVP_MD_CTX_destroy(ctx: *mut EVP_MD_CTX);
}
unsafe extern "C" {
    pub fn EVP_DigestFinalXOF(ctx: *mut EVP_MD_CTX, out: *mut u8, len: usize)
        -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_MD_meth_get_flags(md: *const EVP_MD) -> u32;
}
unsafe extern "C" {
    pub fn EVP_MD_CTX_set_flags(ctx: *mut EVP_MD_CTX, flags: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn EVP_MD_nid(md: *const EVP_MD) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_MD_fetch(
        libctx: *mut OSSL_LIB_CTX,
        name: *const ::core::ffi::c_char,
        propq: *const ::core::ffi::c_char,
    ) -> *mut EVP_MD;
}
unsafe extern "C" {
    pub fn EVP_MD_up_ref(md: *mut EVP_MD) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_MD_free(md: *mut EVP_MD);
}
unsafe extern "C" {
    pub fn EVP_Q_digest(
        libctx: *mut OSSL_LIB_CTX,
        name: *const ::core::ffi::c_char,
        propq: *const ::core::ffi::c_char,
        in_: *const ::core::ffi::c_void,
        in_len: usize,
        out: *mut u8,
        out_len: *mut usize,
    ) -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_md_pctx_ops {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct env_md_ctx_st {
    pub __bindgen_anon_1: env_md_ctx_st__bindgen_ty_1,
    pub digest: *const EVP_MD,
    pub pctx: *mut EVP_PKEY_CTX,
    pub pctx_ops: *const evp_md_pctx_ops,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union env_md_ctx_st__bindgen_ty_1 {
    pub md_data: [u8; 240usize],
    pub alignment: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of env_md_ctx_st__bindgen_ty_1"]
        [::core::mem::size_of::<env_md_ctx_st__bindgen_ty_1>() - 240usize];
    ["Alignment of env_md_ctx_st__bindgen_ty_1"]
        [::core::mem::align_of::<env_md_ctx_st__bindgen_ty_1>() - 8usize];
    ["Offset of field: env_md_ctx_st__bindgen_ty_1::md_data"]
        [::core::mem::offset_of!(env_md_ctx_st__bindgen_ty_1, md_data) - 0usize];
    ["Offset of field: env_md_ctx_st__bindgen_ty_1::alignment"]
        [::core::mem::offset_of!(env_md_ctx_st__bindgen_ty_1, alignment) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of env_md_ctx_st"][::core::mem::size_of::<env_md_ctx_st>() - 264usize];
    ["Alignment of env_md_ctx_st"][::core::mem::align_of::<env_md_ctx_st>() - 8usize];
    ["Offset of field: env_md_ctx_st::digest"]
        [::core::mem::offset_of!(env_md_ctx_st, digest) - 240usize];
    ["Offset of field: env_md_ctx_st::pctx"]
        [::core::mem::offset_of!(env_md_ctx_st, pctx) - 248usize];
    ["Offset of field: env_md_ctx_st::pctx_ops"]
        [::core::mem::offset_of!(env_md_ctx_st, pctx_ops) - 256usize];
};
unsafe extern "C" {
    pub fn DSA_new() -> *mut DSA;
}
unsafe extern "C" {
    pub fn DSA_free(dsa: *mut DSA);
}
unsafe extern "C" {
    pub fn DSA_up_ref(dsa: *mut DSA) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn DSA_bits(dsa: *const DSA) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn DSA_get0_pub_key(dsa: *const DSA) -> *const BIGNUM;
}
unsafe extern "C" {
    pub fn DSA_get0_priv_key(dsa: *const DSA) -> *const BIGNUM;
}
unsafe extern "C" {
    pub fn DSA_get0_p(dsa: *const DSA) -> *const BIGNUM;
}
unsafe extern "C" {
    pub fn DSA_get0_q(dsa: *const DSA) -> *const BIGNUM;
}
unsafe extern "C" {
    pub fn DSA_get0_g(dsa: *const DSA) -> *const BIGNUM;
}
unsafe extern "C" {
    pub fn DSA_get0_key(
        dsa: *const DSA,
        out_pub_key: *mut *const BIGNUM,
        out_priv_key: *mut *const BIGNUM,
    );
}
unsafe extern "C" {
    pub fn DSA_get0_pqg(
        dsa: *const DSA,
        out_p: *mut *const BIGNUM,
        out_q: *mut *const BIGNUM,
        out_g: *mut *const BIGNUM,
    );
}
unsafe extern "C" {
    pub fn DSA_set0_key(
        dsa: *mut DSA,
        pub_key: *mut BIGNUM,
        priv_key: *mut BIGNUM,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn DSA_set0_pqg(
        dsa: *mut DSA,
        p: *mut BIGNUM,
        q: *mut BIGNUM,
        g: *mut BIGNUM,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn DSA_generate_parameters_ex(
        dsa: *mut DSA,
        bits: ::core::ffi::c_uint,
        seed: *const u8,
        seed_len: usize,
        out_counter: *mut ::core::ffi::c_int,
        out_h: *mut ::core::ffi::c_ulong,
        cb: *mut BN_GENCB,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn DSAparams_dup(dsa: *const DSA) -> *mut DSA;
}
unsafe extern "C" {
    pub fn DSA_generate_key(dsa: *mut DSA) -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DSA_SIG_st {
    pub r: *mut BIGNUM,
    pub s: *mut BIGNUM,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DSA_SIG_st"][::core::mem::size_of::<DSA_SIG_st>() - 16usize];
    ["Alignment of DSA_SIG_st"][::core::mem::align_of::<DSA_SIG_st>() - 8usize];
    ["Offset of field: DSA_SIG_st::r"][::core::mem::offset_of!(DSA_SIG_st, r) - 0usize];
    ["Offset of field: DSA_SIG_st::s"][::core::mem::offset_of!(DSA_SIG_st, s) - 8usize];
};
unsafe extern "C" {
    pub fn DSA_SIG_new() -> *mut DSA_SIG;
}
unsafe extern "C" {
    pub fn DSA_SIG_free(sig: *mut DSA_SIG);
}
unsafe extern "C" {
    pub fn DSA_SIG_get0(sig: *const DSA_SIG, out_r: *mut *const BIGNUM, out_s: *mut *const BIGNUM);
}
unsafe extern "C" {
    pub fn DSA_SIG_set0(sig: *mut DSA_SIG, r: *mut BIGNUM, s: *mut BIGNUM) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn DSA_do_sign(digest: *const u8, digest_len: usize, dsa: *const DSA) -> *mut DSA_SIG;
}
unsafe extern "C" {
    pub fn DSA_do_verify(
        digest: *const u8,
        digest_len: usize,
        sig: *const DSA_SIG,
        dsa: *const DSA,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn DSA_do_check_signature(
        out_valid: *mut ::core::ffi::c_int,
        digest: *const u8,
        digest_len: usize,
        sig: *const DSA_SIG,
        dsa: *const DSA,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn DSA_sign(
        type_: ::core::ffi::c_int,
        digest: *const u8,
        digest_len: usize,
        out_sig: *mut u8,
        out_siglen: *mut ::core::ffi::c_uint,
        dsa: *const DSA,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn DSA_verify(
        type_: ::core::ffi::c_int,
        digest: *const u8,
        digest_len: usize,
        sig: *const u8,
        sig_len: usize,
        dsa: *const DSA,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn DSA_check_signature(
        out_valid: *mut ::core::ffi::c_int,
        digest: *const u8,
        digest_len: usize,
        sig: *const u8,
        sig_len: usize,
        dsa: *const DSA,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn DSA_size(dsa: *const DSA) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn DSA_SIG_parse(cbs: *mut CBS) -> *mut DSA_SIG;
}
unsafe extern "C" {
    pub fn DSA_SIG_marshal(cbb: *mut CBB, sig: *const DSA_SIG) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn DSA_parse_public_key(cbs: *mut CBS) -> *mut DSA;
}
unsafe extern "C" {
    pub fn DSA_marshal_public_key(cbb: *mut CBB, dsa: *const DSA) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn DSA_parse_private_key(cbs: *mut CBS) -> *mut DSA;
}
unsafe extern "C" {
    pub fn DSA_marshal_private_key(cbb: *mut CBB, dsa: *const DSA) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn DSA_parse_parameters(cbs: *mut CBS) -> *mut DSA;
}
unsafe extern "C" {
    pub fn DSA_marshal_parameters(cbb: *mut CBB, dsa: *const DSA) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn DSA_dup_DH(dsa: *const DSA) -> *mut DH;
}
unsafe extern "C" {
    pub fn DSA_get_ex_new_index(
        argl: ::core::ffi::c_long,
        argp: *mut ::core::ffi::c_void,
        unused: *mut CRYPTO_EX_unused,
        dup_unused: CRYPTO_EX_dup,
        free_func: CRYPTO_EX_free,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn DSA_set_ex_data(
        dsa: *mut DSA,
        idx: ::core::ffi::c_int,
        arg: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn DSA_get_ex_data(dsa: *const DSA, idx: ::core::ffi::c_int) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn d2i_DSA_SIG(
        out_sig: *mut *mut DSA_SIG,
        inp: *mut *const u8,
        len: ::core::ffi::c_long,
    ) -> *mut DSA_SIG;
}
unsafe extern "C" {
    pub fn i2d_DSA_SIG(in_: *const DSA_SIG, outp: *mut *mut u8) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn d2i_DSAPublicKey(
        out: *mut *mut DSA,
        inp: *mut *const u8,
        len: ::core::ffi::c_long,
    ) -> *mut DSA;
}
unsafe extern "C" {
    pub fn i2d_DSAPublicKey(in_: *const DSA, outp: *mut *mut u8) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn d2i_DSAPrivateKey(
        out: *mut *mut DSA,
        inp: *mut *const u8,
        len: ::core::ffi::c_long,
    ) -> *mut DSA;
}
unsafe extern "C" {
    pub fn i2d_DSAPrivateKey(in_: *const DSA, outp: *mut *mut u8) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn d2i_DSAparams(
        out: *mut *mut DSA,
        inp: *mut *const u8,
        len: ::core::ffi::c_long,
    ) -> *mut DSA;
}
unsafe extern "C" {
    pub fn i2d_DSAparams(in_: *const DSA, outp: *mut *mut u8) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn DSA_generate_parameters(
        bits: ::core::ffi::c_int,
        seed: *mut ::core::ffi::c_uchar,
        seed_len: ::core::ffi::c_int,
        counter_ret: *mut ::core::ffi::c_int,
        h_ret: *mut ::core::ffi::c_ulong,
        callback: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: ::core::ffi::c_int,
                arg2: ::core::ffi::c_int,
                arg3: *mut ::core::ffi::c_void,
            ),
        >,
        cb_arg: *mut ::core::ffi::c_void,
    ) -> *mut DSA;
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum point_conversion_form_t {
    POINT_CONVERSION_COMPRESSED = 2,
    POINT_CONVERSION_UNCOMPRESSED = 4,
    POINT_CONVERSION_HYBRID = 6,
}
unsafe extern "C" {
    pub fn EC_group_p224() -> *const EC_GROUP;
}
unsafe extern "C" {
    pub fn EC_group_p256() -> *const EC_GROUP;
}
unsafe extern "C" {
    pub fn EC_group_p384() -> *const EC_GROUP;
}
unsafe extern "C" {
    pub fn EC_group_p521() -> *const EC_GROUP;
}
unsafe extern "C" {
    pub fn EC_GROUP_new_by_curve_name(nid: ::core::ffi::c_int) -> *mut EC_GROUP;
}
unsafe extern "C" {
    pub fn EC_GROUP_cmp(
        a: *const EC_GROUP,
        b: *const EC_GROUP,
        ignored: *mut BN_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_GROUP_get0_generator(group: *const EC_GROUP) -> *const EC_POINT;
}
unsafe extern "C" {
    pub fn EC_GROUP_get0_order(group: *const EC_GROUP) -> *const BIGNUM;
}
unsafe extern "C" {
    pub fn EC_GROUP_order_bits(group: *const EC_GROUP) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_GROUP_get_cofactor(
        group: *const EC_GROUP,
        cofactor: *mut BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_GROUP_get_curve_GFp(
        group: *const EC_GROUP,
        out_p: *mut BIGNUM,
        out_a: *mut BIGNUM,
        out_b: *mut BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_GROUP_get_curve_name(group: *const EC_GROUP) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_GROUP_get_degree(group: *const EC_GROUP) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn EC_curve_nid2nist(nid: ::core::ffi::c_int) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn EC_curve_nist2nid(name: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_POINT_new(group: *const EC_GROUP) -> *mut EC_POINT;
}
unsafe extern "C" {
    pub fn EC_POINT_free(point: *mut EC_POINT);
}
unsafe extern "C" {
    pub fn EC_POINT_copy(dest: *mut EC_POINT, src: *const EC_POINT) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_POINT_dup(src: *const EC_POINT, group: *const EC_GROUP) -> *mut EC_POINT;
}
unsafe extern "C" {
    pub fn EC_POINT_set_to_infinity(
        group: *const EC_GROUP,
        point: *mut EC_POINT,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_POINT_is_at_infinity(
        group: *const EC_GROUP,
        point: *const EC_POINT,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_POINT_is_on_curve(
        group: *const EC_GROUP,
        point: *const EC_POINT,
        ctx: *mut BN_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_POINT_cmp(
        group: *const EC_GROUP,
        a: *const EC_POINT,
        b: *const EC_POINT,
        ctx: *mut BN_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_POINT_get_affine_coordinates_GFp(
        group: *const EC_GROUP,
        point: *const EC_POINT,
        x: *mut BIGNUM,
        y: *mut BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_POINT_get_affine_coordinates(
        group: *const EC_GROUP,
        point: *const EC_POINT,
        x: *mut BIGNUM,
        y: *mut BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_POINT_set_affine_coordinates_GFp(
        group: *const EC_GROUP,
        point: *mut EC_POINT,
        x: *const BIGNUM,
        y: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_POINT_set_affine_coordinates(
        group: *const EC_GROUP,
        point: *mut EC_POINT,
        x: *const BIGNUM,
        y: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_POINT_point2oct(
        group: *const EC_GROUP,
        point: *const EC_POINT,
        form: point_conversion_form_t,
        buf: *mut u8,
        max_out: usize,
        ctx: *mut BN_CTX,
    ) -> usize;
}
unsafe extern "C" {
    pub fn EC_POINT_point2buf(
        group: *const EC_GROUP,
        point: *const EC_POINT,
        form: point_conversion_form_t,
        out_buf: *mut *mut u8,
        ctx: *mut BN_CTX,
    ) -> usize;
}
unsafe extern "C" {
    pub fn EC_POINT_point2cbb(
        out: *mut CBB,
        group: *const EC_GROUP,
        point: *const EC_POINT,
        form: point_conversion_form_t,
        ctx: *mut BN_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_POINT_oct2point(
        group: *const EC_GROUP,
        point: *mut EC_POINT,
        buf: *const u8,
        len: usize,
        ctx: *mut BN_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_POINT_set_compressed_coordinates_GFp(
        group: *const EC_GROUP,
        point: *mut EC_POINT,
        x: *const BIGNUM,
        y_bit: ::core::ffi::c_int,
        ctx: *mut BN_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_POINT_add(
        group: *const EC_GROUP,
        r: *mut EC_POINT,
        a: *const EC_POINT,
        b: *const EC_POINT,
        ctx: *mut BN_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_POINT_dbl(
        group: *const EC_GROUP,
        r: *mut EC_POINT,
        a: *const EC_POINT,
        ctx: *mut BN_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_POINT_invert(
        group: *const EC_GROUP,
        a: *mut EC_POINT,
        ctx: *mut BN_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_POINT_mul(
        group: *const EC_GROUP,
        r: *mut EC_POINT,
        n: *const BIGNUM,
        q: *const EC_POINT,
        m: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_hash_to_curve_p256_xmd_sha256_sswu(
        group: *const EC_GROUP,
        out: *mut EC_POINT,
        dst: *const u8,
        dst_len: usize,
        msg: *const u8,
        msg_len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_hash_to_curve_p384_xmd_sha384_sswu(
        group: *const EC_GROUP,
        out: *mut EC_POINT,
        dst: *const u8,
        dst_len: usize,
        msg: *const u8,
        msg_len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_encode_to_curve_p256_xmd_sha256_sswu(
        group: *const EC_GROUP,
        out: *mut EC_POINT,
        dst: *const u8,
        dst_len: usize,
        msg: *const u8,
        msg_len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_encode_to_curve_p384_xmd_sha384_sswu(
        group: *const EC_GROUP,
        out: *mut EC_POINT,
        dst: *const u8,
        dst_len: usize,
        msg: *const u8,
        msg_len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_GROUP_free(group: *mut EC_GROUP);
}
unsafe extern "C" {
    pub fn EC_GROUP_dup(group: *const EC_GROUP) -> *mut EC_GROUP;
}
unsafe extern "C" {
    pub fn EC_GROUP_new_curve_GFp(
        p: *const BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> *mut EC_GROUP;
}
unsafe extern "C" {
    pub fn EC_GROUP_set_generator(
        group: *mut EC_GROUP,
        generator: *const EC_POINT,
        order: *const BIGNUM,
        cofactor: *const BIGNUM,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_GROUP_get_order(
        group: *const EC_GROUP,
        order: *mut BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_GROUP_set_asn1_flag(group: *mut EC_GROUP, flag: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn EC_GROUP_get_asn1_flag(group: *const EC_GROUP) -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ec_method_st {
    _unused: [u8; 0],
}
pub type EC_METHOD = ec_method_st;
unsafe extern "C" {
    pub fn EC_GROUP_method_of(group: *const EC_GROUP) -> *const EC_METHOD;
}
unsafe extern "C" {
    pub fn EC_METHOD_get_field_type(meth: *const EC_METHOD) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_GROUP_set_point_conversion_form(group: *mut EC_GROUP, form: point_conversion_form_t);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct EC_builtin_curve {
    pub nid: ::core::ffi::c_int,
    pub comment: *const ::core::ffi::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of EC_builtin_curve"][::core::mem::size_of::<EC_builtin_curve>() - 16usize];
    ["Alignment of EC_builtin_curve"][::core::mem::align_of::<EC_builtin_curve>() - 8usize];
    ["Offset of field: EC_builtin_curve::nid"]
        [::core::mem::offset_of!(EC_builtin_curve, nid) - 0usize];
    ["Offset of field: EC_builtin_curve::comment"]
        [::core::mem::offset_of!(EC_builtin_curve, comment) - 8usize];
};
unsafe extern "C" {
    pub fn EC_get_builtin_curves(out_curves: *mut EC_builtin_curve, max_num_curves: usize)
        -> usize;
}
unsafe extern "C" {
    pub fn EC_POINT_clear_free(point: *mut EC_POINT);
}
unsafe extern "C" {
    pub fn ENGINE_new() -> *mut ENGINE;
}
unsafe extern "C" {
    pub fn ENGINE_free(engine: *mut ENGINE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ENGINE_set_RSA_method(
        engine: *mut ENGINE,
        method: *const RSA_METHOD,
        method_size: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ENGINE_get_RSA_method(engine: *const ENGINE) -> *mut RSA_METHOD;
}
unsafe extern "C" {
    pub fn ENGINE_set_ECDSA_method(
        engine: *mut ENGINE,
        method: *const ECDSA_METHOD,
        method_size: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ENGINE_get_ECDSA_method(engine: *const ENGINE) -> *mut ECDSA_METHOD;
}
unsafe extern "C" {
    pub fn METHOD_ref(method: *mut ::core::ffi::c_void);
}
unsafe extern "C" {
    pub fn METHOD_unref(method: *mut ::core::ffi::c_void);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct openssl_method_common_st {
    pub references: ::core::ffi::c_int,
    pub is_static: ::core::ffi::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of openssl_method_common_st"]
        [::core::mem::size_of::<openssl_method_common_st>() - 8usize];
    ["Alignment of openssl_method_common_st"]
        [::core::mem::align_of::<openssl_method_common_st>() - 4usize];
    ["Offset of field: openssl_method_common_st::references"]
        [::core::mem::offset_of!(openssl_method_common_st, references) - 0usize];
    ["Offset of field: openssl_method_common_st::is_static"]
        [::core::mem::offset_of!(openssl_method_common_st, is_static) - 4usize];
};
unsafe extern "C" {
    pub fn EC_KEY_new() -> *mut EC_KEY;
}
unsafe extern "C" {
    pub fn EC_KEY_new_method(engine: *const ENGINE) -> *mut EC_KEY;
}
unsafe extern "C" {
    pub fn EC_KEY_new_by_curve_name(nid: ::core::ffi::c_int) -> *mut EC_KEY;
}
unsafe extern "C" {
    pub fn EC_KEY_free(key: *mut EC_KEY);
}
unsafe extern "C" {
    pub fn EC_KEY_dup(src: *const EC_KEY) -> *mut EC_KEY;
}
unsafe extern "C" {
    pub fn EC_KEY_up_ref(key: *mut EC_KEY) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_KEY_is_opaque(key: *const EC_KEY) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_KEY_get0_group(key: *const EC_KEY) -> *const EC_GROUP;
}
unsafe extern "C" {
    pub fn EC_KEY_set_group(key: *mut EC_KEY, group: *const EC_GROUP) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_KEY_get0_private_key(key: *const EC_KEY) -> *const BIGNUM;
}
unsafe extern "C" {
    pub fn EC_KEY_set_private_key(key: *mut EC_KEY, priv_: *const BIGNUM) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_KEY_get0_public_key(key: *const EC_KEY) -> *const EC_POINT;
}
unsafe extern "C" {
    pub fn EC_KEY_set_public_key(key: *mut EC_KEY, pub_: *const EC_POINT) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_KEY_get_enc_flags(key: *const EC_KEY) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn EC_KEY_set_enc_flags(key: *mut EC_KEY, flags: ::core::ffi::c_uint);
}
unsafe extern "C" {
    pub fn EC_KEY_get_conv_form(key: *const EC_KEY) -> point_conversion_form_t;
}
unsafe extern "C" {
    pub fn EC_KEY_set_conv_form(key: *mut EC_KEY, cform: point_conversion_form_t);
}
unsafe extern "C" {
    pub fn EC_KEY_check_key(key: *const EC_KEY) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_KEY_check_fips(key: *const EC_KEY) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_KEY_set_public_key_affine_coordinates(
        key: *mut EC_KEY,
        x: *const BIGNUM,
        y: *const BIGNUM,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_KEY_oct2key(
        key: *mut EC_KEY,
        in_: *const u8,
        len: usize,
        ctx: *mut BN_CTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_KEY_key2buf(
        key: *const EC_KEY,
        form: point_conversion_form_t,
        out_buf: *mut *mut u8,
        ctx: *mut BN_CTX,
    ) -> usize;
}
unsafe extern "C" {
    pub fn EC_KEY_oct2priv(key: *mut EC_KEY, in_: *const u8, len: usize) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_KEY_priv2oct(key: *const EC_KEY, out: *mut u8, max_out: usize) -> usize;
}
unsafe extern "C" {
    pub fn EC_KEY_priv2buf(key: *const EC_KEY, out_buf: *mut *mut u8) -> usize;
}
unsafe extern "C" {
    pub fn EC_KEY_generate_key(key: *mut EC_KEY) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_KEY_generate_key_fips(key: *mut EC_KEY) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_KEY_derive_from_secret(
        group: *const EC_GROUP,
        secret: *const u8,
        secret_len: usize,
    ) -> *mut EC_KEY;
}
unsafe extern "C" {
    pub fn EC_KEY_parse_private_key(cbs: *mut CBS, group: *const EC_GROUP) -> *mut EC_KEY;
}
unsafe extern "C" {
    pub fn EC_KEY_marshal_private_key(
        cbb: *mut CBB,
        key: *const EC_KEY,
        enc_flags: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_KEY_parse_curve_name(cbs: *mut CBS) -> *mut EC_GROUP;
}
unsafe extern "C" {
    pub fn EC_KEY_marshal_curve_name(cbb: *mut CBB, group: *const EC_GROUP) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_KEY_parse_parameters(cbs: *mut CBS) -> *mut EC_GROUP;
}
unsafe extern "C" {
    pub fn EC_KEY_get_ex_new_index(
        argl: ::core::ffi::c_long,
        argp: *mut ::core::ffi::c_void,
        unused: *mut CRYPTO_EX_unused,
        dup_unused: CRYPTO_EX_dup,
        free_func: CRYPTO_EX_free,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_KEY_set_ex_data(
        r: *mut EC_KEY,
        idx: ::core::ffi::c_int,
        arg: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EC_KEY_get_ex_data(
        r: *const EC_KEY,
        idx: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_void;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ecdsa_method_st {
    pub common: openssl_method_common_st,
    pub app_data: *mut ::core::ffi::c_void,
    pub init: ::core::option::Option<unsafe extern "C" fn(key: *mut EC_KEY) -> ::core::ffi::c_int>,
    pub finish:
        ::core::option::Option<unsafe extern "C" fn(key: *mut EC_KEY) -> ::core::ffi::c_int>,
    pub sign: ::core::option::Option<
        unsafe extern "C" fn(
            digest: *const u8,
            digest_len: usize,
            sig: *mut u8,
            sig_len: *mut ::core::ffi::c_uint,
            eckey: *mut EC_KEY,
        ) -> ::core::ffi::c_int,
    >,
    pub flags: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ecdsa_method_st"][::core::mem::size_of::<ecdsa_method_st>() - 48usize];
    ["Alignment of ecdsa_method_st"][::core::mem::align_of::<ecdsa_method_st>() - 8usize];
    ["Offset of field: ecdsa_method_st::common"]
        [::core::mem::offset_of!(ecdsa_method_st, common) - 0usize];
    ["Offset of field: ecdsa_method_st::app_data"]
        [::core::mem::offset_of!(ecdsa_method_st, app_data) - 8usize];
    ["Offset of field: ecdsa_method_st::init"]
        [::core::mem::offset_of!(ecdsa_method_st, init) - 16usize];
    ["Offset of field: ecdsa_method_st::finish"]
        [::core::mem::offset_of!(ecdsa_method_st, finish) - 24usize];
    ["Offset of field: ecdsa_method_st::sign"]
        [::core::mem::offset_of!(ecdsa_method_st, sign) - 32usize];
    ["Offset of field: ecdsa_method_st::flags"]
        [::core::mem::offset_of!(ecdsa_method_st, flags) - 40usize];
};
unsafe extern "C" {
    pub fn EC_KEY_set_asn1_flag(key: *mut EC_KEY, flag: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn d2i_ECPrivateKey(
        out_key: *mut *mut EC_KEY,
        inp: *mut *const u8,
        len: ::core::ffi::c_long,
    ) -> *mut EC_KEY;
}
unsafe extern "C" {
    pub fn i2d_ECPrivateKey(key: *const EC_KEY, outp: *mut *mut u8) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn d2i_ECPKParameters(
        out: *mut *mut EC_GROUP,
        inp: *mut *const u8,
        len: ::core::ffi::c_long,
    ) -> *mut EC_GROUP;
}
unsafe extern "C" {
    pub fn i2d_ECPKParameters(group: *const EC_GROUP, outp: *mut *mut u8) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn d2i_ECParameters(
        out_key: *mut *mut EC_KEY,
        inp: *mut *const u8,
        len: ::core::ffi::c_long,
    ) -> *mut EC_KEY;
}
unsafe extern "C" {
    pub fn i2d_ECParameters(key: *const EC_KEY, outp: *mut *mut u8) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn o2i_ECPublicKey(
        out_key: *mut *mut EC_KEY,
        inp: *mut *const u8,
        len: ::core::ffi::c_long,
    ) -> *mut EC_KEY;
}
unsafe extern "C" {
    pub fn i2o_ECPublicKey(
        key: *const EC_KEY,
        outp: *mut *mut ::core::ffi::c_uchar,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ECDH_compute_key(
        out: *mut ::core::ffi::c_void,
        outlen: usize,
        pub_key: *const EC_POINT,
        priv_key: *const EC_KEY,
        kdf: ::core::option::Option<
            unsafe extern "C" fn(
                in_: *const ::core::ffi::c_void,
                inlen: usize,
                out: *mut ::core::ffi::c_void,
                outlen: *mut usize,
            ) -> *mut ::core::ffi::c_void,
        >,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ECDH_compute_key_fips(
        out: *mut u8,
        out_len: usize,
        pub_key: *const EC_POINT,
        priv_key: *const EC_KEY,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ECDSA_sign(
        type_: ::core::ffi::c_int,
        digest: *const u8,
        digest_len: usize,
        sig: *mut u8,
        sig_len: *mut ::core::ffi::c_uint,
        key: *const EC_KEY,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ECDSA_verify(
        type_: ::core::ffi::c_int,
        digest: *const u8,
        digest_len: usize,
        sig: *const u8,
        sig_len: usize,
        key: *const EC_KEY,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ECDSA_size(key: *const EC_KEY) -> usize;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ecdsa_sig_st {
    pub r: *mut BIGNUM,
    pub s: *mut BIGNUM,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ecdsa_sig_st"][::core::mem::size_of::<ecdsa_sig_st>() - 16usize];
    ["Alignment of ecdsa_sig_st"][::core::mem::align_of::<ecdsa_sig_st>() - 8usize];
    ["Offset of field: ecdsa_sig_st::r"][::core::mem::offset_of!(ecdsa_sig_st, r) - 0usize];
    ["Offset of field: ecdsa_sig_st::s"][::core::mem::offset_of!(ecdsa_sig_st, s) - 8usize];
};
unsafe extern "C" {
    pub fn ECDSA_SIG_new() -> *mut ECDSA_SIG;
}
unsafe extern "C" {
    pub fn ECDSA_SIG_free(sig: *mut ECDSA_SIG);
}
unsafe extern "C" {
    pub fn ECDSA_SIG_get0_r(sig: *const ECDSA_SIG) -> *const BIGNUM;
}
unsafe extern "C" {
    pub fn ECDSA_SIG_get0_s(sig: *const ECDSA_SIG) -> *const BIGNUM;
}
unsafe extern "C" {
    pub fn ECDSA_SIG_get0(
        sig: *const ECDSA_SIG,
        out_r: *mut *const BIGNUM,
        out_s: *mut *const BIGNUM,
    );
}
unsafe extern "C" {
    pub fn ECDSA_SIG_set0(
        sig: *mut ECDSA_SIG,
        r: *mut BIGNUM,
        s: *mut BIGNUM,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ECDSA_do_sign(
        digest: *const u8,
        digest_len: usize,
        key: *const EC_KEY,
    ) -> *mut ECDSA_SIG;
}
unsafe extern "C" {
    pub fn ECDSA_do_verify(
        digest: *const u8,
        digest_len: usize,
        sig: *const ECDSA_SIG,
        key: *const EC_KEY,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ECDSA_SIG_parse(cbs: *mut CBS) -> *mut ECDSA_SIG;
}
unsafe extern "C" {
    pub fn ECDSA_SIG_from_bytes(in_: *const u8, in_len: usize) -> *mut ECDSA_SIG;
}
unsafe extern "C" {
    pub fn ECDSA_SIG_marshal(cbb: *mut CBB, sig: *const ECDSA_SIG) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ECDSA_SIG_to_bytes(
        out_bytes: *mut *mut u8,
        out_len: *mut usize,
        sig: *const ECDSA_SIG,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ECDSA_SIG_max_len(order_len: usize) -> usize;
}
unsafe extern "C" {
    pub fn ECDSA_sign_p1363(
        digest: *const u8,
        digest_len: usize,
        sig: *mut u8,
        out_sig_len: *mut usize,
        max_sig_len: usize,
        key: *const EC_KEY,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ECDSA_verify_p1363(
        digest: *const u8,
        digest_len: usize,
        sig: *const u8,
        sig_len: usize,
        key: *const EC_KEY,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ECDSA_size_p1363(key: *const EC_KEY) -> usize;
}
unsafe extern "C" {
    pub fn ECDSA_sign_with_nonce_and_leak_private_key_for_testing(
        digest: *const u8,
        digest_len: usize,
        eckey: *const EC_KEY,
        nonce: *const u8,
        nonce_len: usize,
    ) -> *mut ECDSA_SIG;
}
unsafe extern "C" {
    pub fn d2i_ECDSA_SIG(
        out: *mut *mut ECDSA_SIG,
        inp: *mut *const u8,
        len: ::core::ffi::c_long,
    ) -> *mut ECDSA_SIG;
}
unsafe extern "C" {
    pub fn i2d_ECDSA_SIG(sig: *const ECDSA_SIG, outp: *mut *mut u8) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_aead_aes_128_gcm() -> *const EVP_AEAD;
}
unsafe extern "C" {
    pub fn EVP_aead_aes_192_gcm() -> *const EVP_AEAD;
}
unsafe extern "C" {
    pub fn EVP_aead_aes_256_gcm() -> *const EVP_AEAD;
}
unsafe extern "C" {
    pub fn EVP_aead_chacha20_poly1305() -> *const EVP_AEAD;
}
unsafe extern "C" {
    pub fn EVP_aead_xchacha20_poly1305() -> *const EVP_AEAD;
}
unsafe extern "C" {
    pub fn EVP_aead_aes_128_ctr_hmac_sha256() -> *const EVP_AEAD;
}
unsafe extern "C" {
    pub fn EVP_aead_aes_256_ctr_hmac_sha256() -> *const EVP_AEAD;
}
unsafe extern "C" {
    pub fn EVP_aead_aes_128_gcm_siv() -> *const EVP_AEAD;
}
unsafe extern "C" {
    pub fn EVP_aead_aes_256_gcm_siv() -> *const EVP_AEAD;
}
unsafe extern "C" {
    pub fn EVP_aead_aes_128_gcm_randnonce() -> *const EVP_AEAD;
}
unsafe extern "C" {
    pub fn EVP_aead_aes_256_gcm_randnonce() -> *const EVP_AEAD;
}
unsafe extern "C" {
    pub fn EVP_aead_aes_128_ccm_bluetooth() -> *const EVP_AEAD;
}
unsafe extern "C" {
    pub fn EVP_aead_aes_128_ccm_bluetooth_8() -> *const EVP_AEAD;
}
unsafe extern "C" {
    pub fn EVP_aead_aes_128_ccm_matter() -> *const EVP_AEAD;
}
unsafe extern "C" {
    pub fn EVP_has_aes_hardware() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_aead_aes_128_eax() -> *const EVP_AEAD;
}
unsafe extern "C" {
    pub fn EVP_aead_aes_256_eax() -> *const EVP_AEAD;
}
unsafe extern "C" {
    pub fn EVP_AEAD_key_length(aead: *const EVP_AEAD) -> usize;
}
unsafe extern "C" {
    pub fn EVP_AEAD_nonce_length(aead: *const EVP_AEAD) -> usize;
}
unsafe extern "C" {
    pub fn EVP_AEAD_max_overhead(aead: *const EVP_AEAD) -> usize;
}
unsafe extern "C" {
    pub fn EVP_AEAD_max_tag_len(aead: *const EVP_AEAD) -> usize;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union evp_aead_ctx_st_state {
    pub opaque: [u8; 560usize],
    pub alignment: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of evp_aead_ctx_st_state"][::core::mem::size_of::<evp_aead_ctx_st_state>() - 560usize];
    ["Alignment of evp_aead_ctx_st_state"]
        [::core::mem::align_of::<evp_aead_ctx_st_state>() - 8usize];
    ["Offset of field: evp_aead_ctx_st_state::opaque"]
        [::core::mem::offset_of!(evp_aead_ctx_st_state, opaque) - 0usize];
    ["Offset of field: evp_aead_ctx_st_state::alignment"]
        [::core::mem::offset_of!(evp_aead_ctx_st_state, alignment) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct evp_aead_ctx_st {
    pub aead: *const EVP_AEAD,
    pub state: evp_aead_ctx_st_state,
    pub tag_len: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of evp_aead_ctx_st"][::core::mem::size_of::<evp_aead_ctx_st>() - 576usize];
    ["Alignment of evp_aead_ctx_st"][::core::mem::align_of::<evp_aead_ctx_st>() - 8usize];
    ["Offset of field: evp_aead_ctx_st::aead"]
        [::core::mem::offset_of!(evp_aead_ctx_st, aead) - 0usize];
    ["Offset of field: evp_aead_ctx_st::state"]
        [::core::mem::offset_of!(evp_aead_ctx_st, state) - 8usize];
    ["Offset of field: evp_aead_ctx_st::tag_len"]
        [::core::mem::offset_of!(evp_aead_ctx_st, tag_len) - 568usize];
};
unsafe extern "C" {
    pub fn EVP_AEAD_CTX_zero(ctx: *mut EVP_AEAD_CTX);
}
unsafe extern "C" {
    pub fn EVP_AEAD_CTX_new(
        aead: *const EVP_AEAD,
        key: *const u8,
        key_len: usize,
        tag_len: usize,
    ) -> *mut EVP_AEAD_CTX;
}
unsafe extern "C" {
    pub fn EVP_AEAD_CTX_free(ctx: *mut EVP_AEAD_CTX);
}
unsafe extern "C" {
    pub fn EVP_AEAD_CTX_init(
        ctx: *mut EVP_AEAD_CTX,
        aead: *const EVP_AEAD,
        key: *const u8,
        key_len: usize,
        tag_len: usize,
        impl_: *mut ENGINE,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_AEAD_CTX_cleanup(ctx: *mut EVP_AEAD_CTX);
}
unsafe extern "C" {
    pub fn EVP_AEAD_CTX_seal(
        ctx: *const EVP_AEAD_CTX,
        out: *mut u8,
        out_len: *mut usize,
        max_out_len: usize,
        nonce: *const u8,
        nonce_len: usize,
        in_: *const u8,
        in_len: usize,
        ad: *const u8,
        ad_len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_AEAD_CTX_open(
        ctx: *const EVP_AEAD_CTX,
        out: *mut u8,
        out_len: *mut usize,
        max_out_len: usize,
        nonce: *const u8,
        nonce_len: usize,
        in_: *const u8,
        in_len: usize,
        ad: *const u8,
        ad_len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_AEAD_CTX_seal_scatter(
        ctx: *const EVP_AEAD_CTX,
        out: *mut u8,
        out_tag: *mut u8,
        out_tag_len: *mut usize,
        max_out_tag_len: usize,
        nonce: *const u8,
        nonce_len: usize,
        in_: *const u8,
        in_len: usize,
        extra_in: *const u8,
        extra_in_len: usize,
        ad: *const u8,
        ad_len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_AEAD_CTX_open_gather(
        ctx: *const EVP_AEAD_CTX,
        out: *mut u8,
        nonce: *const u8,
        nonce_len: usize,
        in_: *const u8,
        in_len: usize,
        in_tag: *const u8,
        in_tag_len: usize,
        ad: *const u8,
        ad_len: usize,
    ) -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct crypto_ivec_st {
    pub in_: *const u8,
    pub len: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of crypto_ivec_st"][::core::mem::size_of::<crypto_ivec_st>() - 16usize];
    ["Alignment of crypto_ivec_st"][::core::mem::align_of::<crypto_ivec_st>() - 8usize];
    ["Offset of field: crypto_ivec_st::in_"][::core::mem::offset_of!(crypto_ivec_st, in_) - 0usize];
    ["Offset of field: crypto_ivec_st::len"][::core::mem::offset_of!(crypto_ivec_st, len) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct crypto_iovec_st {
    pub out: *mut u8,
    pub in_: *const u8,
    pub len: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of crypto_iovec_st"][::core::mem::size_of::<crypto_iovec_st>() - 24usize];
    ["Alignment of crypto_iovec_st"][::core::mem::align_of::<crypto_iovec_st>() - 8usize];
    ["Offset of field: crypto_iovec_st::out"]
        [::core::mem::offset_of!(crypto_iovec_st, out) - 0usize];
    ["Offset of field: crypto_iovec_st::in_"]
        [::core::mem::offset_of!(crypto_iovec_st, in_) - 8usize];
    ["Offset of field: crypto_iovec_st::len"]
        [::core::mem::offset_of!(crypto_iovec_st, len) - 16usize];
};
unsafe extern "C" {
    pub fn EVP_AEAD_CTX_sealv(
        ctx: *const EVP_AEAD_CTX,
        iovec: *const CRYPTO_IOVEC,
        num_iovec: usize,
        out_tag: *mut u8,
        out_tag_len: *mut usize,
        max_out_tag_len: usize,
        nonce: *const u8,
        nonce_len: usize,
        aadvec: *const CRYPTO_IVEC,
        num_aadvec: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_AEAD_CTX_openv(
        ctx: *const EVP_AEAD_CTX,
        iovec: *const CRYPTO_IOVEC,
        num_iovec: usize,
        out_total_bytes: *mut usize,
        nonce: *const u8,
        nonce_len: usize,
        aadvec: *const CRYPTO_IVEC,
        num_aadvec: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_AEAD_CTX_openv_detached(
        ctx: *const EVP_AEAD_CTX,
        iovec: *const CRYPTO_IOVEC,
        num_iovec: usize,
        nonce: *const u8,
        nonce_len: usize,
        in_tag: *const u8,
        in_tag_len: usize,
        aadvec: *const CRYPTO_IVEC,
        num_aadvec: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_AEAD_CTX_aead(ctx: *const EVP_AEAD_CTX) -> *const EVP_AEAD;
}
unsafe extern "C" {
    pub fn EVP_aead_aes_128_cbc_sha1_tls() -> *const EVP_AEAD;
}
unsafe extern "C" {
    pub fn EVP_aead_aes_128_cbc_sha1_tls_implicit_iv() -> *const EVP_AEAD;
}
unsafe extern "C" {
    pub fn EVP_aead_aes_128_cbc_sha256_tls() -> *const EVP_AEAD;
}
unsafe extern "C" {
    pub fn EVP_aead_aes_256_cbc_sha1_tls() -> *const EVP_AEAD;
}
unsafe extern "C" {
    pub fn EVP_aead_aes_256_cbc_sha1_tls_implicit_iv() -> *const EVP_AEAD;
}
unsafe extern "C" {
    pub fn EVP_aead_des_ede3_cbc_sha1_tls() -> *const EVP_AEAD;
}
unsafe extern "C" {
    pub fn EVP_aead_des_ede3_cbc_sha1_tls_implicit_iv() -> *const EVP_AEAD;
}
unsafe extern "C" {
    pub fn EVP_aead_aes_128_gcm_tls12() -> *const EVP_AEAD;
}
unsafe extern "C" {
    pub fn EVP_aead_aes_256_gcm_tls12() -> *const EVP_AEAD;
}
unsafe extern "C" {
    pub fn EVP_aead_aes_128_gcm_tls13() -> *const EVP_AEAD;
}
unsafe extern "C" {
    pub fn EVP_aead_aes_256_gcm_tls13() -> *const EVP_AEAD;
}
pub const evp_aead_direction_t_evp_aead_open: evp_aead_direction_t = 0;
pub const evp_aead_direction_t_evp_aead_seal: evp_aead_direction_t = 1;
pub type evp_aead_direction_t = ::core::ffi::c_uint;
unsafe extern "C" {
    pub fn EVP_AEAD_CTX_init_with_direction(
        ctx: *mut EVP_AEAD_CTX,
        aead: *const EVP_AEAD,
        key: *const u8,
        key_len: usize,
        tag_len: usize,
        dir: evp_aead_direction_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_AEAD_CTX_get_iv(
        ctx: *const EVP_AEAD_CTX,
        out_iv: *mut *const u8,
        out_len: *mut usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_AEAD_CTX_tag_len(
        ctx: *const EVP_AEAD_CTX,
        out_tag_len: *mut usize,
        in_len: usize,
        extra_in_len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_new() -> *mut EVP_PKEY;
}
unsafe extern "C" {
    pub fn EVP_PKEY_free(pkey: *mut EVP_PKEY);
}
unsafe extern "C" {
    pub fn EVP_PKEY_up_ref(pkey: *mut EVP_PKEY) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_dup_ref(pkey: *const EVP_PKEY) -> *mut EVP_PKEY;
}
unsafe extern "C" {
    pub fn EVP_PKEY_is_opaque(pkey: *const EVP_PKEY) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_eq(a: *const EVP_PKEY, b: *const EVP_PKEY) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_copy_parameters(to: *mut EVP_PKEY, from: *const EVP_PKEY)
        -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_missing_parameters(pkey: *const EVP_PKEY) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_parameters_eq(a: *const EVP_PKEY, b: *const EVP_PKEY) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_size(pkey: *const EVP_PKEY) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_bits(pkey: *const EVP_PKEY) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_has_public(pkey: *const EVP_PKEY) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_has_private(pkey: *const EVP_PKEY) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_copy_public(pkey: *const EVP_PKEY) -> *mut EVP_PKEY;
}
unsafe extern "C" {
    pub fn EVP_PKEY_id(pkey: *const EVP_PKEY) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_pkey_rsa() -> *const EVP_PKEY_ALG;
}
unsafe extern "C" {
    pub fn EVP_pkey_ec_p224() -> *const EVP_PKEY_ALG;
}
unsafe extern "C" {
    pub fn EVP_pkey_ec_p256() -> *const EVP_PKEY_ALG;
}
unsafe extern "C" {
    pub fn EVP_pkey_ec_p384() -> *const EVP_PKEY_ALG;
}
unsafe extern "C" {
    pub fn EVP_pkey_ec_p521() -> *const EVP_PKEY_ALG;
}
unsafe extern "C" {
    pub fn EVP_pkey_x25519() -> *const EVP_PKEY_ALG;
}
unsafe extern "C" {
    pub fn EVP_pkey_ed25519() -> *const EVP_PKEY_ALG;
}
unsafe extern "C" {
    pub fn EVP_pkey_ml_dsa_44() -> *const EVP_PKEY_ALG;
}
unsafe extern "C" {
    pub fn EVP_pkey_ml_dsa_65() -> *const EVP_PKEY_ALG;
}
unsafe extern "C" {
    pub fn EVP_pkey_ml_dsa_87() -> *const EVP_PKEY_ALG;
}
unsafe extern "C" {
    pub fn EVP_pkey_ml_kem_768() -> *const EVP_PKEY_ALG;
}
unsafe extern "C" {
    pub fn EVP_pkey_ml_kem_1024() -> *const EVP_PKEY_ALG;
}
unsafe extern "C" {
    pub fn EVP_pkey_xwing() -> *const EVP_PKEY_ALG;
}
unsafe extern "C" {
    pub fn EVP_pkey_dsa() -> *const EVP_PKEY_ALG;
}
unsafe extern "C" {
    pub fn EVP_pkey_rsa_pss_sha256() -> *const EVP_PKEY_ALG;
}
unsafe extern "C" {
    pub fn EVP_pkey_rsa_pss_sha384() -> *const EVP_PKEY_ALG;
}
unsafe extern "C" {
    pub fn EVP_pkey_rsa_pss_sha512() -> *const EVP_PKEY_ALG;
}
unsafe extern "C" {
    pub fn EVP_PKEY_set1_RSA(pkey: *mut EVP_PKEY, key: *mut RSA) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_assign_RSA(pkey: *mut EVP_PKEY, key: *mut RSA) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_get0_RSA(pkey: *const EVP_PKEY) -> *mut RSA;
}
unsafe extern "C" {
    pub fn EVP_PKEY_get1_RSA(pkey: *const EVP_PKEY) -> *mut RSA;
}
unsafe extern "C" {
    pub fn EVP_PKEY_set1_DSA(pkey: *mut EVP_PKEY, key: *mut DSA) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_assign_DSA(pkey: *mut EVP_PKEY, key: *mut DSA) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_get0_DSA(pkey: *const EVP_PKEY) -> *mut DSA;
}
unsafe extern "C" {
    pub fn EVP_PKEY_get1_DSA(pkey: *const EVP_PKEY) -> *mut DSA;
}
unsafe extern "C" {
    pub fn EVP_PKEY_set1_EC_KEY(pkey: *mut EVP_PKEY, key: *mut EC_KEY) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_assign_EC_KEY(pkey: *mut EVP_PKEY, key: *mut EC_KEY) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_get0_EC_KEY(pkey: *const EVP_PKEY) -> *mut EC_KEY;
}
unsafe extern "C" {
    pub fn EVP_PKEY_get1_EC_KEY(pkey: *const EVP_PKEY) -> *mut EC_KEY;
}
unsafe extern "C" {
    pub fn EVP_PKEY_set1_DH(pkey: *mut EVP_PKEY, key: *mut DH) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_assign_DH(pkey: *mut EVP_PKEY, key: *mut DH) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_get0_DH(pkey: *const EVP_PKEY) -> *mut DH;
}
unsafe extern "C" {
    pub fn EVP_PKEY_get1_DH(pkey: *const EVP_PKEY) -> *mut DH;
}
unsafe extern "C" {
    pub fn EVP_PKEY_from_subject_public_key_info(
        in_: *const u8,
        len: usize,
        algs: *const *const EVP_PKEY_ALG,
        num_algs: usize,
    ) -> *mut EVP_PKEY;
}
unsafe extern "C" {
    pub fn EVP_parse_public_key(cbs: *mut CBS) -> *mut EVP_PKEY;
}
unsafe extern "C" {
    pub fn EVP_marshal_public_key(cbb: *mut CBB, key: *const EVP_PKEY) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_from_private_key_info(
        in_: *const u8,
        len: usize,
        algs: *const *const EVP_PKEY_ALG,
        num_algs: usize,
    ) -> *mut EVP_PKEY;
}
unsafe extern "C" {
    pub fn EVP_parse_private_key(cbs: *mut CBS) -> *mut EVP_PKEY;
}
unsafe extern "C" {
    pub fn EVP_marshal_private_key(cbb: *mut CBB, key: *const EVP_PKEY) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_from_raw_private_key(
        alg: *const EVP_PKEY_ALG,
        in_: *const u8,
        len: usize,
    ) -> *mut EVP_PKEY;
}
unsafe extern "C" {
    pub fn EVP_PKEY_from_private_seed(
        alg: *const EVP_PKEY_ALG,
        in_: *const u8,
        len: usize,
    ) -> *mut EVP_PKEY;
}
unsafe extern "C" {
    pub fn EVP_PKEY_from_raw_public_key(
        alg: *const EVP_PKEY_ALG,
        in_: *const u8,
        len: usize,
    ) -> *mut EVP_PKEY;
}
unsafe extern "C" {
    pub fn EVP_PKEY_get_raw_private_key(
        pkey: *const EVP_PKEY,
        out: *mut u8,
        out_len: *mut usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_get_private_seed(
        pkey: *const EVP_PKEY,
        out: *mut u8,
        out_len: *mut usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_get_raw_public_key(
        pkey: *const EVP_PKEY,
        out: *mut u8,
        out_len: *mut usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_generate_from_alg(alg: *const EVP_PKEY_ALG) -> *mut EVP_PKEY;
}
unsafe extern "C" {
    pub fn EVP_DigestSignInit(
        ctx: *mut EVP_MD_CTX,
        pctx: *mut *mut EVP_PKEY_CTX,
        type_: *const EVP_MD,
        e: *mut ENGINE,
        pkey: *mut EVP_PKEY,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_DigestSignUpdate(
        ctx: *mut EVP_MD_CTX,
        data: *const ::core::ffi::c_void,
        len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_DigestSignFinal(
        ctx: *mut EVP_MD_CTX,
        out_sig: *mut u8,
        out_sig_len: *mut usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_DigestSign(
        ctx: *mut EVP_MD_CTX,
        out_sig: *mut u8,
        out_sig_len: *mut usize,
        data: *const u8,
        data_len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_DigestVerifyInit(
        ctx: *mut EVP_MD_CTX,
        pctx: *mut *mut EVP_PKEY_CTX,
        type_: *const EVP_MD,
        e: *mut ENGINE,
        pkey: *mut EVP_PKEY,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_DigestVerifyUpdate(
        ctx: *mut EVP_MD_CTX,
        data: *const ::core::ffi::c_void,
        len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_DigestVerifyFinal(
        ctx: *mut EVP_MD_CTX,
        sig: *const u8,
        sig_len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_DigestVerify(
        ctx: *mut EVP_MD_CTX,
        sig: *const u8,
        sig_len: usize,
        data: *const u8,
        len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_SignInit_ex(
        ctx: *mut EVP_MD_CTX,
        type_: *const EVP_MD,
        impl_: *mut ENGINE,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_SignInit(ctx: *mut EVP_MD_CTX, type_: *const EVP_MD) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_SignUpdate(
        ctx: *mut EVP_MD_CTX,
        data: *const ::core::ffi::c_void,
        len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_SignFinal(
        ctx: *const EVP_MD_CTX,
        sig: *mut u8,
        out_sig_len: *mut ::core::ffi::c_uint,
        pkey: *mut EVP_PKEY,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_VerifyInit_ex(
        ctx: *mut EVP_MD_CTX,
        type_: *const EVP_MD,
        impl_: *mut ENGINE,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_VerifyInit(ctx: *mut EVP_MD_CTX, type_: *const EVP_MD) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_VerifyUpdate(
        ctx: *mut EVP_MD_CTX,
        data: *const ::core::ffi::c_void,
        len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_VerifyFinal(
        ctx: *mut EVP_MD_CTX,
        sig: *const u8,
        sig_len: usize,
        pkey: *mut EVP_PKEY,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_print_public(
        out: *mut BIO,
        pkey: *const EVP_PKEY,
        indent: ::core::ffi::c_int,
        pctx: *mut ASN1_PCTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_print_private(
        out: *mut BIO,
        pkey: *const EVP_PKEY,
        indent: ::core::ffi::c_int,
        pctx: *mut ASN1_PCTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_print_params(
        out: *mut BIO,
        pkey: *const EVP_PKEY,
        indent: ::core::ffi::c_int,
        pctx: *mut ASN1_PCTX,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn PKCS5_PBKDF2_HMAC(
        password: *const ::core::ffi::c_char,
        password_len: usize,
        salt: *const u8,
        salt_len: usize,
        iterations: u32,
        digest: *const EVP_MD,
        key_len: usize,
        out_key: *mut u8,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn PKCS5_PBKDF2_HMAC_SHA1(
        password: *const ::core::ffi::c_char,
        password_len: usize,
        salt: *const u8,
        salt_len: usize,
        iterations: u32,
        key_len: usize,
        out_key: *mut u8,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PBE_validate_scrypt_params(
        password: *const ::core::ffi::c_char,
        password_len: usize,
        salt: *const u8,
        salt_len: usize,
        N: u64,
        r: u64,
        p: u64,
        max_mem: usize,
        out_key: *mut u8,
        key_len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PBE_scrypt(
        password: *const ::core::ffi::c_char,
        password_len: usize,
        salt: *const u8,
        salt_len: usize,
        N: u64,
        r: u64,
        p: u64,
        max_mem: usize,
        out_key: *mut u8,
        key_len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_CTX_new(pkey: *mut EVP_PKEY, e: *mut ENGINE) -> *mut EVP_PKEY_CTX;
}
unsafe extern "C" {
    pub fn EVP_PKEY_CTX_new_id(id: ::core::ffi::c_int, e: *mut ENGINE) -> *mut EVP_PKEY_CTX;
}
unsafe extern "C" {
    pub fn EVP_PKEY_CTX_free(ctx: *mut EVP_PKEY_CTX);
}
unsafe extern "C" {
    pub fn EVP_PKEY_CTX_dup(ctx: *mut EVP_PKEY_CTX) -> *mut EVP_PKEY_CTX;
}
unsafe extern "C" {
    pub fn EVP_PKEY_CTX_get0_pkey(ctx: *mut EVP_PKEY_CTX) -> *mut EVP_PKEY;
}
unsafe extern "C" {
    pub fn EVP_PKEY_sign_init(ctx: *mut EVP_PKEY_CTX) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_sign(
        ctx: *mut EVP_PKEY_CTX,
        sig: *mut u8,
        sig_len: *mut usize,
        digest: *const u8,
        digest_len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_verify_init(ctx: *mut EVP_PKEY_CTX) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_verify(
        ctx: *mut EVP_PKEY_CTX,
        sig: *const u8,
        sig_len: usize,
        digest: *const u8,
        digest_len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_encrypt_init(ctx: *mut EVP_PKEY_CTX) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_encrypt(
        ctx: *mut EVP_PKEY_CTX,
        out: *mut u8,
        out_len: *mut usize,
        in_: *const u8,
        in_len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_decrypt_init(ctx: *mut EVP_PKEY_CTX) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_decrypt(
        ctx: *mut EVP_PKEY_CTX,
        out: *mut u8,
        out_len: *mut usize,
        in_: *const u8,
        in_len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_verify_recover_init(ctx: *mut EVP_PKEY_CTX) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_verify_recover(
        ctx: *mut EVP_PKEY_CTX,
        out: *mut u8,
        out_len: *mut usize,
        sig: *const u8,
        siglen: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_derive_init(ctx: *mut EVP_PKEY_CTX) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_derive_set_peer(
        ctx: *mut EVP_PKEY_CTX,
        peer: *mut EVP_PKEY,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_derive(
        ctx: *mut EVP_PKEY_CTX,
        key: *mut u8,
        out_key_len: *mut usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_keygen_init(ctx: *mut EVP_PKEY_CTX) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_keygen(
        ctx: *mut EVP_PKEY_CTX,
        out_pkey: *mut *mut EVP_PKEY,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_paramgen_init(ctx: *mut EVP_PKEY_CTX) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_paramgen(
        ctx: *mut EVP_PKEY_CTX,
        out_pkey: *mut *mut EVP_PKEY,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_encapsulate_init(
        ctx: *mut EVP_PKEY_CTX,
        params: *const OSSL_PARAM,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_encapsulate(
        ctx: *mut EVP_PKEY_CTX,
        out_ciphertext: *mut u8,
        out_ciphertext_len: *mut usize,
        out_secret: *mut u8,
        out_secret_len: *mut usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_decapsulate_init(
        ctx: *mut EVP_PKEY_CTX,
        params: *const OSSL_PARAM,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_decapsulate(
        ctx: *mut EVP_PKEY_CTX,
        out_secret: *mut u8,
        out_secret_len: *mut usize,
        ciphertext: *const u8,
        ciphertext_len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_CTX_set_signature_md(
        ctx: *mut EVP_PKEY_CTX,
        md: *const EVP_MD,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_CTX_get_signature_md(
        ctx: *mut EVP_PKEY_CTX,
        out_md: *mut *const EVP_MD,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_CTX_set1_signature_context_string(
        ctx: *mut EVP_PKEY_CTX,
        context: *const u8,
        context_len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_RSA_gen(bits: ::core::ffi::c_uint) -> *mut EVP_PKEY;
}
unsafe extern "C" {
    pub fn EVP_PKEY_CTX_set_rsa_padding(
        ctx: *mut EVP_PKEY_CTX,
        padding: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_CTX_get_rsa_padding(
        ctx: *mut EVP_PKEY_CTX,
        out_padding: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_CTX_set_rsa_pss_saltlen(
        ctx: *mut EVP_PKEY_CTX,
        salt_len: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_CTX_get_rsa_pss_saltlen(
        ctx: *mut EVP_PKEY_CTX,
        out_salt_len: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_CTX_set_rsa_keygen_bits(
        ctx: *mut EVP_PKEY_CTX,
        bits: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_CTX_set_rsa_keygen_pubexp(
        ctx: *mut EVP_PKEY_CTX,
        e: *mut BIGNUM,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_CTX_set_rsa_oaep_md(
        ctx: *mut EVP_PKEY_CTX,
        md: *const EVP_MD,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_CTX_get_rsa_oaep_md(
        ctx: *mut EVP_PKEY_CTX,
